roblatour/ESP32TimeServer/main/main.cpp
// ESP32 Time Server v2.9
// Copyright Rob Latour, 2026
// License: MIT
// Website: https://github.com/roblatour/ESP32TimeServer
//
// ESP32 Dev Board:     ESP32-P4-ETH https://www.waveshare.com/esp32-p4-eth.htm
//                                   https://www.waveshare.com/wiki/ESP32-P4-ETH?srsltid=AfmBOoo6nZm5hsPAhtpzT6lWSHd2zhWNPM_mqgbNvyoESbjvbO7uykcH
//
//                      NOTE: Powering the ESP32-P4_ETH by either a USB C cable or, with its optional POE had installed,
//                      a POE Ethernet cable is sufficient to power the ESP32-P4-ETH, GNSS module and LCD screen.
//
//                      ************************************************************************************************
//                      * HOWEVER DO NOT POWER THE ESP32-P4_ETH VIA BOTH ITS USB C CONNECTION AND POE AT THE SAME TIME *
//                      ************************************************************************************************
//
// GNSS (recommended):  SparkFun GNSS Receiver Breakout - MAX-M10S  https://www.sparkfun.com/sparkfun-gnss-receiver-breakout-max-m10s-qwiic.html
//
// LCD2004:             blue/green screen with HD44780 I2C serial interface adapter https://www.aliexpress.com/item/1005006829045609.html.
//
// Wiring:
//
// (mandatory) GNSS module wiring to and from the ESP32-P4-ETH board:
// GNSS GND            <- -> ESP32-P4-ETH GND
// GNSS VCC            <- -> ESP32-P4-ETH 3V3
// GNSS TXD            <- -> ESP32-P4-ETH GPIO17 (RX)
// GNSS RXD            <- -> ESP32-P4-ETH GPIO16 (TX)
// GNSS PPS            <- -> ESP32-P4-ETH GPIO18
//
// (optional) LCD204A V1.5 (HD44780 + PCF8574T I2C backpack) wiring to and from the ESP32-P4-ETH board:
// LCD GND            <- -> ESP32-P4-ETH GND
// LCD VCC            <- -> ESP32-P4-ETH 3V3
// LCD SDA            <- -> ESP32-P4-ETH GPIO8 (SDA)
// LCD SLC/SCL        <- -> ESP32-P4-ETH GPIO7 (SCL)
//
// (optional) Uptime momentary button to and from teh ESP32-P4-ETH board:
// one terminal       <- -> ESP32-P4-ETH GPI03
// the other terminal <- -> ESP32-P4-ETH GND

#include <atomic>
#include <cerrno>
#include <cstdarg>
#include <cstdio>
#include <cstdlib>
#include <cstring>
#include <ctime>
#include <dirent.h>
#include <sys/stat.h>
#include <sys/time.h>
#include <unistd.h>
#include <algorithm>
#include <string>
#include <vector>

#include "Arduino.h"
#include "ArduinoOTA.h"
#include "ETH.h"
#include "SparkFun_u-blox_GNSS_v3.h"
#include "ESP32TimeServerSettings.h"
#include "custom/app_metadata.h"
#include "custom/ntp_cache.h"

extern "C"
{
#include "esp_event.h"
#include "esp_eth_clock.h"
#include "esp_eth_driver.h"
#include "esp_eth_mac_esp.h"
#include "esp_log.h"
#include "ff.h"
#include "esp_mac.h"
#if MQTT_ENABLED
#include "esp_heap_caps.h"
#include "mqtt_client.h"
#endif
#include "esp_netif.h"
#include "esp_rom_sys.h"
#include "esp_timer.h"
#include "esp_vfs_fat.h"
#include "nvs.h"
#include "driver/mcpwm_cap.h"
#include "driver/sdmmc_host.h"
#include "sd_pwr_ctrl_by_on_chip_ldo.h"
#include "sdmmc_cmd.h"
#include "nvs_flash.h"
#include "freertos/FreeRTOS.h"
#include "freertos/event_groups.h"
#include "freertos/queue.h"
#include "freertos/semphr.h"
#include "freertos/task.h"
#if LIQUID_CRYSTAL_DISPLAY_ENABLED
#include "hd44780.h"
#include "pcf8574.h"
#endif
#include "lwip/inet.h"
#include "lwip/sockets.h"
}

static const char *TAG = "main_cpp";

// Optional startup health test
//
// When enabled the startup health test will perform a series of checks to ensure the system is functioning correctly at boot.
//
// These tests include:
//
// Part 1: the program sends itself NTPv3 and NTPv4 (standard and interlaced) requests via IPv4 and IPv6,
// using loop back and assigned addresses,
//
// Part 2: it health test the same logic that all NTP requests go through to receive those requests,
// process and reply to them using standard and RFC 9769-compatible interleaved responses,
//
// Part 3: it verifying the responses to ensure proper operations and reports a pass/fail result.
//
// Additionally, this activity is reflected in regular receive/send/client stats within MQTT reporting. .
//
// The startup health test can be useful during development and troubleshooting, but it slightly increase boot time
// and resource usage.
//
// However, it is recommended to keep this option be disabled in production builds to minimize boot time and resource usage.
// Also, and perhaps more importantly, as its results may be misinterpreted.
// For example: if the user's network does not support IPv6 the IPv6 tests may fail even though the system is
// functioning correctly.
//

#define STARTUP_HEALTH_TEST_ENABLED 0 // 0 = Disabled; 1 = Enabled

// The following series of conditional compile flags are used to determine the ideal stack sizes for
// xTaskCreatePinnedToCore calls used throughout the program.
//
// Unless you are changing the code associated with options below and need to know the impacts of
// those changes have on the stack sizes then e conditional compile flags below should be disabled (set to 0)

#define CALCULATE_ETHERNET_TRANSPORT_RECOVERY_TASK_STACK_SIZE_ENABLED 0 // 0 = Disabled; 1 = Enabled
#define CALCULATE_GNSS_RECOVERY_TASK_STACK_SIZE_ENABLED 0               // 0 = Disabled; 1 = Enabled
#define CALCULATE_GNSS_Time_Sync_Task_Stack_Size_ENABLED 0              // 0 = Disabled; 1 = Enabled
#define CALCULATE_HARDWARE_NTP_SERVER_TASK_STACK_SIZE_ENABLED 0         // 0 = Disabled; 1 = Enabled
#define CALCULATE_MQTT_SERVICE_TASK_STACK_SIZE_ENABLED 0                // 0 = Disabled; 1 = Enabled
#define CALCULATE_NTP_CACHE_PURGE_TASK_STACK_SIZE_ENABLED 0             // 0 = Disabled; 1 = Enabled
#define CALCULATE_NTP_SERVER_TASK_STACK_SIZE_ENABLED 0                  // 0 = Disabled; 1 = Enabled
#define CALCULATE_OTE_SERVICE_TASK_STACK_SIZE_ENABLED 0                 // 0 = Disabled; 1 = Enabled
#define CALCULATE_PPS_DISCIPLINE_TASK_STACK_SIZE_ENABLED 0              // 0 = Disabled; 1 = Enabled
#define CALCULATE_UPDATE_DISPLAY_TASK_STACK_SIZE_ENABLED 0              // 0 = Disabled; 1 = Enabled

