roblatour/ESP32TimeServer/main/main.cpp
// FreeRTOS task stack allocations, in bytes.

static constexpr size_t Ethernet_Transport_Recovery_Task_Stack_Size = 3072;
static constexpr size_t GNSS_Recovery_Task_Stack_Size = 12288;
static constexpr size_t GNSS_Time_Sync_Task_Stack_Size = 2517;
static constexpr size_t Hardware_NTP_Server_Task_Stack_Size = 4096;
static constexpr size_t MQTT_Service_Task_Stack_Size = 3512;
static constexpr size_t NTP_Cache_Purge_Task_Stack_Size = 2304;
static constexpr size_t NTP_Server_Task_Stack_Size = 3560;
static constexpr size_t OTE_Service_Task_Stack_Size = 3560; // unlikely to exceed this stack size (based on current implementation)
static constexpr size_t PPS_Discipline_Task_Stack_Size = 2347;
static constexpr size_t Update_Display_Task_Stack_Size = 3063;

static constexpr unsigned int Default_Safety_Margin_Percent = 30; // unless otherwise specified add this percentage to the highest stack usage as a safety margin

#if CALCULATE_ETHERNET_TRANSPORT_RECOVERY_TASK_STACK_SIZE_ENABLED || \
    CALCULATE_GNSS_RECOVERY_TASK_STACK_SIZE_ENABLED ||               \
    CALCULATE_GNSS_TIME_SYNC_TASK_STACK_SIZE_ENABLED ||              \
    CALCULATE_HARDWARE_NTP_SERVER_TASK_STACK_SIZE_ENABLED ||         \
    CALCULATE_MQTT_SERVICE_TASK_STACK_SIZE_ENABLED ||                \
    CALCULATE_NTP_CACHE_PURGE_TASK_STACK_SIZE_ENABLED ||             \
    CALCULATE_NTP_SERVER_TASK_STACK_SIZE_ENABLED ||                  \
    CALCULATE_OTE_SERVICE_TASK_STACK_SIZE_ENABLED ||                 \
    CALCULATE_PPS_DISCIPLINE_TASK_STACK_SIZE_ENABLED ||              \
    CALCULATE_UPDATE_DISPLAY_TASK_STACK_SIZE_ENABLED

// For the purposes of calculating stack sizes force DEBUG_ENABLED if any of the stack size calculations are enabled
// so that the task includes all debug processing is included in the stack size calculations
#define DEBUG_ENABLED 1

// For the purposes of calculating stack sizes force all MQTT tasks as enabled if MQTT_ENABLED is enabled
#if MQTT_ENABLED
#define MQTT_CLIENT_REPORTING_ENABLED 1
#define MQTT_MEMORY_REPORTING_ENABLED 1
#define MQTT_HISTORICAL_REPORTING_ENABLED 1
#endif

typedef enum
{
    Ethernet_Transport_Recovery,
    GNSS_Recovery,
    GNSS_Time_Sync,
    Hardware_NTP_Server,
    MQTT_Service,
    NTP_Cache_Purge,
    NTP_Server,
    OTE_Service,
    PPS_Discipline,
    Update_Display
} TaskToPinToCore_t;

static size_t Highest_Ethernet_Transport_Recovery_Task_Stack_Size = 0;
static size_t Highest_GNSS_Recovery_Task_Stack_Size = 0;
static size_t Highest_GNSS_Time_Sync_Task_Stack_Size = 0;
static size_t Highest_Hardware_NTP_Server_Task_Stack_Size = 0;
static size_t Highest_MQTT_Service_Task_Stack_Size = 0;
static size_t Highest_NTP_Cache_Purge_Task_Stack_Size = 0;
static size_t Highest_NTP_Server_Task_Stack_Size = 0;
static size_t Highest_OTE_Service_Task_Stack_Size = 0;
static size_t Highest_PPS_Discipline_Task_Stack_Size = 0;
static size_t Highest_Update_Display_Task_Stack_Size = 0;
static SemaphoreHandle_t s_task_stack_usage_mutex = nullptr;

static void report_current_task_stack_usage(TaskToPinToCore_t task_id)
{
    xSemaphoreTake(s_task_stack_usage_mutex, portMAX_DELAY);

    const char *task_name = nullptr;
    size_t allocated_bytes = 0;
    unsigned int safety_margin_percent = 30;
    bool highest_value_changed = false;
    bool show_details = false;

    switch (task_id)
    {
    case Ethernet_Transport_Recovery:
        task_name = "ethernet_transport_task";
        allocated_bytes = Ethernet_Transport_Recovery_Task_Stack_Size;
        break;
    case GNSS_Recovery:
        task_name = "gnss_recovery_task";
        allocated_bytes = GNSS_Recovery_Task_Stack_Size;
        break;
    case GNSS_Time_Sync:
        task_name = "gnss_time_sync_task";
        allocated_bytes = GNSS_Time_Sync_Task_Stack_Size;
        break;
    case Hardware_NTP_Server:
        task_name = "hardware_ntp_server_task";
        allocated_bytes = Hardware_NTP_Server_Task_Stack_Size;
        break;
    case MQTT_Service:
        task_name = "mqtt_service_task";
        allocated_bytes = MQTT_Service_Task_Stack_Size;
        break;
    case NTP_Cache_Purge:
        task_name = "ntp_cache_purge_task";
        allocated_bytes = NTP_Cache_Purge_Task_Stack_Size;
        break;
    case NTP_Server:
        task_name = "ntp_server_task";
        allocated_bytes = NTP_Server_Task_Stack_Size;
        safety_margin_percent = 50;
        ESP_LOGE(task_name, "I see you");
        break;
    case OTE_Service:
        task_name = "ote_service_task";
        allocated_bytes = OTE_Service_Task_Stack_Size;
        break;
    case PPS_Discipline:
        task_name = "pps_discipline_task";
        allocated_bytes = PPS_Discipline_Task_Stack_Size;
        break;
    case Update_Display:
        task_name = "update_display_task";
        allocated_bytes = Update_Display_Task_Stack_Size;
        safety_margin_percent = 60;
        break;
    default:
        task_name = "unknown_task";
        break;
    }

    // calculate the suggested stack size based on the peak usage and safety margin

    const size_t high_watermark_bytes = uxTaskGetStackHighWaterMark(nullptr);
    const size_t peak_usage_bytes = allocated_bytes > high_watermark_bytes ? allocated_bytes - high_watermark_bytes : 0;
    const size_t curent_suggestion = (peak_usage_bytes * (100U + safety_margin_percent) + 99U) / 100U;

    if (show_details)
    {
        ESP_LOGI(task_name,
                 "Stack report: Allocated=%u bytes, HighWater=%u bytes unused, PeakUsage=%u bytes, Suggested=%u bytes",
                 static_cast<unsigned int>(allocated_bytes),
                 static_cast<unsigned int>(high_watermark_bytes),
                 static_cast<unsigned int>(peak_usage_bytes),
                 static_cast<unsigned int>(curent_suggestion));
    }

    if (curent_suggestion == 0)
        ESP_LOGE(task_name, "Error: Suggested stack size is 0 bytes. Try increasing the allocted bytes of %u", static_cast<unsigned int>(allocated_bytes));

    switch (task_id)
    {
    case Ethernet_Transport_Recovery:
        if (curent_suggestion > Highest_Ethernet_Transport_Recovery_Task_Stack_Size)
        {
            Highest_Ethernet_Transport_Recovery_Task_Stack_Size = curent_suggestion;
            highest_value_changed = true;
        }
        break;
    case GNSS_Recovery:
        if (curent_suggestion > Highest_GNSS_Recovery_Task_Stack_Size)
        {
            Highest_GNSS_Recovery_Task_Stack_Size = curent_suggestion;
            highest_value_changed = true;
        }
        break;
    case GNSS_Time_Sync:
        if (curent_suggestion > Highest_GNSS_Time_Sync_Task_Stack_Size)
        {
            Highest_GNSS_Time_Sync_Task_Stack_Size = curent_suggestion;
            highest_value_changed = true;
        }
        break;
    case Hardware_NTP_Server:
        if (curent_suggestion > Highest_Hardware_NTP_Server_Task_Stack_Size)
        {
            Highest_Hardware_NTP_Server_Task_Stack_Size = curent_suggestion;
            highest_value_changed = true;
        }
        break;
    case MQTT_Service:
        if (curent_suggestion > Highest_MQTT_Service_Task_Stack_Size)
        {
            Highest_MQTT_Service_Task_Stack_Size = curent_suggestion;
            highest_value_changed = true;
        }
        break;
    case NTP_Cache_Purge:
        if (curent_suggestion > Highest_NTP_Cache_Purge_Task_Stack_Size)
        {
            Highest_NTP_Cache_Purge_Task_Stack_Size = curent_suggestion;
            highest_value_changed = true;
        }
        break;
    case NTP_Server:
        if (curent_suggestion > Highest_NTP_Server_Task_Stack_Size)
        {
            Highest_NTP_Server_Task_Stack_Size = curent_suggestion;
            highest_value_changed = true;
        }
        break;
    case OTE_Service:
        if (curent_suggestion > Highest_OTE_Service_Task_Stack_Size)
        {
            Highest_OTE_Service_Task_Stack_Size = curent_suggestion;
            highest_value_changed = true;
        }

        break;
    case PPS_Discipline:
        if (curent_suggestion > Highest_PPS_Discipline_Task_Stack_Size)
        {
            Highest_PPS_Discipline_Task_Stack_Size = curent_suggestion;
            highest_value_changed = true;
        }
        break;
    case Update_Display:
        if (curent_suggestion > Highest_Update_Display_Task_Stack_Size)
        {
            Highest_Update_Display_Task_Stack_Size = curent_suggestion;
            highest_value_changed = true;
        }
        break;
    default:

        break;
    }

    // Report the highest suggested stack sizes for all tasks to date in such a way that they can be easily copied into the code above
    // If no new highest value has yet been reported for a task the value shown will be 0, the old value will remain as the comment
    if (highest_value_changed)
    {
        ESP_LOGI(TAG, "Suggested updated task stack sizes:");
        ESP_LOGI(TAG, " ");

        if (Highest_Ethernet_Transport_Recovery_Task_Stack_Size > Ethernet_Transport_Recovery_Task_Stack_Size)
            ESP_LOGW(TAG, "static constexpr size_t Ethernet_Transport_Recovery_Task_Stack_Size = %u; // %u;", static_cast<unsigned int>(Highest_Ethernet_Transport_Recovery_Task_Stack_Size), static_cast<unsigned int>(Ethernet_Transport_Recovery_Task_Stack_Size));
        else
            ESP_LOGI(TAG, "static constexpr size_t Ethernet_Transport_Recovery_Task_Stack_Size = %u; // %u;", static_cast<unsigned int>(Highest_Ethernet_Transport_Recovery_Task_Stack_Size), static_cast<unsigned int>(Ethernet_Transport_Recovery_Task_Stack_Size));

