roblatour/ESP32TimeServer/main/main.cpp
#if LIQUID_CRYSTAL_DISPLAY_ENABLED
static constexpr i2c_port_t LCD_I2C_PORT = I2C_NUM_0;
static constexpr gpio_num_t LCD_I2C_SDA_GPIO = GPIO_NUM_8;
static constexpr gpio_num_t LCD_I2C_SCL_GPIO = GPIO_NUM_7;
#endif

static constexpr uint16_t NTP_PORT = 123;
static constexpr size_t NTP_PACKET_SIZE = 48;
static constexpr uint64_t NTP_EPOCH_OFFSET = 2208988800ULL;
static constexpr int8_t NTP_PRECISION_EXPONENT = -13;
static constexpr uint32_t NTP_ROOT_DISPERSION = 66;
static constexpr uint64_t NTP_CACHE_TIMESTAMP_MATCH_TOLERANCE = 8;
static constexpr size_t NTP_SOCKET_BATCH_LIMIT = 16;
static constexpr EventBits_t ETH_CONNECTED_BIT = BIT0;
static constexpr EventBits_t ETH_GOT_IP_BIT = BIT1;
static constexpr EventBits_t ETH_GOT_IP6_BIT = BIT2;
static constexpr size_t IP_ADDRESS_TEXT_SIZE = INET6_ADDRSTRLEN;
static constexpr uint32_t OTE_Failure_Display_Time_Ms = 10000;
static constexpr uint32_t OTE_Reboot_Delay_Ms = 5000;

#if LIQUID_CRYSTAL_DISPLAY_ENABLED
static i2c_dev_t s_lcd_io{};
static uint8_t s_lcd_addr = 0;
static bool s_lcd_ready = false;
static hd44780_t s_lcd{};
static char s_lcd_last_lines[lcdRows][lcdColumns + 1] = {};
static bool s_lcd_line_cached[lcdRows] = {};
#else
#define display_line(...)
#endif

struct PpsCaptureEvent
{
    int64_t approximate_edge_us;
};

static constexpr uint32_t PPS_CAPTURE_RESOLUTION_HZ = 80000000;

static EventGroupHandle_t s_net_event_group = nullptr;
static SemaphoreHandle_t s_time_mutex = nullptr;
static SemaphoreHandle_t s_pps_semaphore = nullptr;
static QueueHandle_t s_pps_timestamp_queue = nullptr;
static QueueHandle_t s_pps_sync_timestamp_queue = nullptr;
static mcpwm_cap_timer_handle_t s_pps_capture_timer = nullptr;
static mcpwm_cap_channel_handle_t s_pps_capture_channel = nullptr;
static SemaphoreHandle_t s_ote_mutex = nullptr;
#if LIQUID_CRYSTAL_DISPLAY_ENABLED
static SemaphoreHandle_t s_lcd_mutex = nullptr;
#endif
static SemaphoreHandle_t s_sync_state_mutex = nullptr;

#if OTE_UPDATES_ENABLED
static bool s_ote_in_progress = false;
static bool s_ote_failed = false;
static bool s_ote_success = false;
static int s_ote_progress_percent = -1;
static int64_t s_ote_failure_display_until_us = 0;
static int64_t s_ote_reboot_at_us = 0;
static char s_ote_error_reason[lcdColumns + 1] = "";
#endif

static std::atomic<bool> s_safe_guard_tripped{false};
static std::atomic<bool> s_time_setting_in_progress{false};
static std::atomic<bool> s_time_has_been_set{false};
static std::atomic<uint64_t> s_ntp_reference_time_64{0};
static std::atomic<bool> s_ntp_reference_valid{false};
static std::atomic<bool> s_ptp_clock_ready{false};

static_assert(PreferIPvX == 0 || PreferIPvX == 4 || PreferIPvX == 6, "PreferIPvX must be 0, 4, or 6");

static char s_ip_address[IP_ADDRESS_TEXT_SIZE] = "";
static char s_ipv4_address[INET_ADDRSTRLEN] = "";
static char s_ipv6_address[IP_ADDRESS_TEXT_SIZE] = "";

static void update_selected_ip_address()
{
    const bool has_ipv4 = s_ipv4_address[0] != '\0';
    const bool has_ipv6 = s_ipv6_address[0] != '\0';

    const char *selected_address = "";
    if (PreferIPvX == 4)
        selected_address = has_ipv4 ? s_ipv4_address : s_ipv6_address;
    else if (PreferIPvX == 6)
        selected_address = has_ipv6 ? s_ipv6_address : s_ipv4_address;
    else if (strcmp(s_ip_address, s_ipv4_address) == 0 && has_ipv4)
        selected_address = s_ipv4_address;
    else if (strcmp(s_ip_address, s_ipv6_address) == 0 && has_ipv6)
        selected_address = s_ipv6_address;
    else
        selected_address = has_ipv4 ? s_ipv4_address : s_ipv6_address;

    snprintf(s_ip_address, sizeof(s_ip_address), "%s", selected_address);
}

static std::atomic<bool> s_ethernet_connected{false};
static std::atomic<bool> s_hardware_ntp_accepting{false};
static std::atomic<int64_t> s_last_hardware_ntp_response_us{0};
static SemaphoreHandle_t s_hardware_ntp_transmit_mutex = nullptr;

static bool configure_static_ip();
static bool configure_hardware_timestamps();
static bool start_ethernet_driver();

static bool format_socket_address(const struct sockaddr_storage &address, char *buffer, size_t buffer_size)
{
    if (buffer_size == 0)
        return false;

    const void *source = nullptr;
    if (address.ss_family == AF_INET)
        source = &reinterpret_cast<const struct sockaddr_in *>(&address)->sin_addr;
    else if (address.ss_family == AF_INET6)
        source = &reinterpret_cast<const struct sockaddr_in6 *>(&address)->sin6_addr;
    else
    {
        buffer[0] = '\0';
        return false;
    }

    return inet_ntop(address.ss_family, source, buffer, buffer_size) != nullptr;
}

#if MQTT_ENABLED

// MQTT_MAX_REPORT_SIZE is based on MQTT_TF_Client_Limit (in ESP32TimeServerSetting.h)
// please see the spreadsheet at tools/json_message_calculator.xlsx for calculation details
// Note: increasing this limit will increase memory usage for MQTT report buffering and may impact system performance.
static constexpr size_t MQTT_MAX_REPORT_SIZE = 31944; // examples: for 256 clients use 2060; for 500 clients use 31944

// MQTT_REPORT_SIZE based on MQTT_CLIENT_SIZE (below)
// please see the spreadsheet at tools/json_message_calculator.xlsx for calculation details
// Note: increasing this limit will increase memory usage for MQTT report buffering and may impact system performance.
static constexpr size_t MQTT_CLIENT_LIMIT = 50;
static constexpr size_t MQTT_REPORT_SIZE = 4944;

static constexpr size_t MQTT_NTP_EVENT_QUEUE_DEPTH = 1024;
static constexpr size_t MQTT_REPORT_QUEUE_DEPTH = 4;
static constexpr size_t MQTT_NTP_EVENT_BATCH_LIMIT = 128;

static constexpr uint32_t MQTT_RESTART_PUBLISH_TIMEOUT_MS = 1000;
static constexpr uint32_t MQTT_QUEUED_PUBLISH_DELAY_MS = 250;
static constexpr char TF_MOUNT_POINT[] = "/tfcard";
static constexpr char TF_QUEUE_DIRECTORY[] = "/tfcard/Queue";

struct mqtt_client_request_t
{
    sa_family_t address_family = AF_UNSPEC;
    uint8_t address[sizeof(struct in6_addr)] = {};
    uint32_t requests = 0;
};

struct mqtt_report_t
{
    char payload[MQTT_REPORT_SIZE] = "";
};

