roblatour/ESP32TimeServer/main/main.cpp
static SemaphoreHandle_t s_mqtt_stats_mutex = nullptr;
static QueueHandle_t s_mqtt_ntp_event_queue = nullptr;
static esp_mqtt_client_handle_t s_mqtt_client = nullptr;
static std::atomic<bool> s_mqtt_setup_failed{false};
static std::atomic<bool> s_mqtt_connected{false};
static std::atomic<bool> s_mqtt_has_connected{false};
static std::atomic<int64_t> s_mqtt_disconnected_since_us{0};
static std::atomic<int> s_mqtt_restart_publish_id{-1};
static std::atomic<bool> s_mqtt_restart_publish_completed{false};
static std::atomic<uint32_t> s_pps_pulses{0};
static std::atomic<uint32_t> s_ntp_requests_this_second{0};
static std::atomic<uint32_t> s_ntp_valid_requests{0};
static std::atomic<uint32_t> s_ntp_invalid_requests{0};
static std::atomic<uint32_t> s_ntp_responses{0};
static std::atomic<uint32_t> s_ntp_responses_synchronized_and_disciplined{0};
static std::atomic<uint32_t> s_ntp_responses_gnss_unsynchronized{0};
static std::atomic<uint32_t> s_ntp_responses_pps_undisciplined{0};
static std::atomic<uint32_t> s_ntp_telemetry_events_dropped{0};
static std::atomic<uint8_t> s_satellite_count{0};
static std::atomic<uint8_t> s_satellite_min{UINT8_MAX};
static std::atomic<uint8_t> s_satellite_max{0};

static void mqtt_note_satellite_count(uint8_t satellites)
{
    s_satellite_count.store(satellites, std::memory_order_relaxed);

    uint8_t minimum = s_satellite_min.load(std::memory_order_relaxed);
    while (satellites < minimum &&
           !s_satellite_min.compare_exchange_weak(minimum, satellites, std::memory_order_relaxed, std::memory_order_relaxed))
    {
    }

    uint8_t maximum = s_satellite_max.load(std::memory_order_relaxed);
    while (satellites > maximum &&
           !s_satellite_max.compare_exchange_weak(maximum, satellites, std::memory_order_relaxed, std::memory_order_relaxed))
    {
    }
}

static std::atomic<int64_t> s_eth_link_connected_us{0};
static std::atomic<int64_t> s_eth_link_up_total_us{0};
#if MQTT_ENABLED && MQTT_HISTORICAL_REPORTING_ENABLED
static std::atomic<time_t> s_last_synchronized_and_disciplined{0};
static std::atomic<time_t> s_last_gnss_unsynchronized{0};
static std::atomic<time_t> s_last_pps_undisciplined{0};
static std::atomic<bool> s_historical_gnss_fault_active{false};
static std::atomic<bool> s_historical_pps_fault_active{false};
#endif

#if MQTT_ENABLED && MQTT_CLIENT_REPORTING_ENABLED
static std::atomic<bool> s_mqtt_client_table_overflown{false};
static size_t s_mqtt_client_count = 0;
#endif

static int64_t s_mqtt_last_link_up_us = 0;
static mqtt_report_t s_mqtt_reports[MQTT_REPORT_QUEUE_DEPTH]{};
static char s_mqtt_payload[MQTT_MAX_REPORT_SIZE] = "";
static size_t s_mqtt_report_head = 0;
static std::atomic<size_t> s_mqtt_queued_messages_count{0};
static uint32_t s_mqtt_queued_messages_discarded = 0;
static mqtt_client_request_t s_mqtt_clients[MQTT_TF_Client_Limit]{};
static std::atomic<bool> s_tf_queue_available{false};
static sdmmc_card_t *s_tf_card = nullptr;
static uint64_t s_tf_queue_next_sequence = 0;
static std::atomic<uint32_t> s_ntp_most_requests_per_second{0};
static char s_mqtt_uri[64] = "";
static char s_mqtt_report_topic[128] = "";
static char s_mqtt_status_topic[128] = "";

static void mqtt_publish_final_report();
static bool mqtt_publish_or_queue_restart_notification(const char *reason);
static void mqtt_enqueue_ntp_request(const struct sockaddr_storage &source_address);
#endif

static HardwareSerial s_gnss_serial(1);
static SFE_UBLOX_GNSS_SERIAL s_gnss;
static uint32_t s_detected_gnss_baud = 0;
static bool s_gnss_required_assume_success = false;

// The following flag for National Marine Electronics Association (NEMA) fallback doesn't determine if it is allowed or not
// rather the program sets it to true if it is required (due to an older / ubox noncompliant hardware gnss module being used)

static bool s_use_nmea_fallback = false;
static bool s_gnss_is_max_m10s = false;
static std::atomic<bool> s_gnss_locked{false};
static std::atomic<int64_t> s_gnss_lock_started_us{0};
static std::atomic<int64_t> s_gnss_locked_total_us{0};
static std::atomic<bool> s_pps_discipline_active{false};
static std::atomic<bool> s_gnss_recovery_in_progress{false};
static std::atomic<int64_t> s_last_gnss_recovery_us{0};

struct sync_faults_t
{
    bool pps_missing = false;
    bool gnss_invalid = false;
    bool sanity_mismatch = false;
    bool sync_stale = false;
};

static bool has_sync_fault(const sync_faults_t &faults)
{
    return faults.pps_missing || faults.gnss_invalid || faults.sanity_mismatch || faults.sync_stale;
}

struct sync_state_t
{
    int64_t last_successful_sync_us = 0;
    int64_t last_sync_attempt_us = 0;
    int64_t last_pps_seen_us = 0;
    time_t last_sync_delta_seconds = 0;
    uint32_t consecutive_sync_failures = 0;
    uint32_t consecutive_sanity_failures = 0;
    bool holdover_mode = false;
    bool pps_active = false;
    bool gnss_timing_valid = false;
    int64_t last_gnss_valid_us = 0;
    sync_faults_t faults{};
};

struct sync_candidate_t
{
    time_t candidate_time = 0;
    bool use_pps_alignment = false;
    bool used_nmea_fallback = false;
    int64_t pps_release_time_us = 0;
    sync_faults_t failures{};
};

static sync_state_t s_sync_state{};
static sync_state_t get_sync_state_snapshot();
static std::atomic<uint32_t> s_ntp_sync_state_sequence{0};
static std::atomic<int64_t> s_ntp_last_successful_sync_us{0};
static std::atomic<int64_t> s_ntp_last_gnss_valid_us{0};
static std::atomic<bool> s_ntp_pps_active{false};
static std::atomic<bool> s_ntp_gnss_timing_valid{false};
static std::atomic<bool> s_ntp_pps_missing{false};
static std::atomic<bool> s_ntp_gnss_invalid{false};
static std::atomic<bool> s_ntp_sanity_mismatch{false};
static std::atomic<bool> s_ntp_sync_stale{false};
static constexpr int64_t Sync_Stale_After_Us = static_cast<int64_t>(periodicGNSSRefreshEveryThisNumberOfMinutes) * 60LL * 1000000LL * 3LL;
static constexpr int64_t Gnss_Validity_Timeout_Us = 3500000LL;
static constexpr int64_t Sync_Reboot_After_Us = 30LL * 60LL * 1000000LL;
static constexpr int64_t Max_Sync_Attempt_Us = 10000000LL;
static constexpr int64_t Gnss_Invalid_Reacquisition_After_Us = 30LL * 1000000LL;
static constexpr int64_t Runtime_gnss_Recovery_Min_Interval_Us = 5LL * 60LL * 1000000LL;
static constexpr uint32_t Sync_Failures_Before_Runtime_Recovery = 20;
static constexpr uint32_t Sanity_Failures_Before_Fault = 2;
static constexpr uint32_t gnss_Startup_Qualification_Duration_Ms = 15000UL;
static constexpr uint32_t gnss_Startup_Qualification_PPS_Edges = 10;
static constexpr int64_t gnss_Startup_Min_PPS_Interval_Us = 800000LL;
static constexpr int64_t gnss_Startup_Max_PPS_Interval_Us = 1200000LL;

