roblatour/ESP32TimeServer/main/main.cpp
static constexpr char gnss_NVS_NAMESPACE[] = "gnss_state";
static constexpr char gnss_NVS_KEY_ID_TYPE[] = "id_type";
static constexpr char gnss_NVS_KEY_ID_VALUE[] = "id_value";
static constexpr char gnss_NVS_KEY_MAX_BAUD[] = "max_baud";
static constexpr char gnss_NVS_KEY_ATTEMPT_NO_SIGNAL_RECOVERY[] = "no_sig_rcv";
static constexpr char restart_NVS_NAMESPACE[] = "restart_evt";
static constexpr char restart_NVS_KEY_PENDING[] = "pending";

static constexpr char gnss_ID_TYPE_UNIQID[] = "uniqid";
static constexpr char gnss_ID_TYPE_MODULE_FP[] = "module_fp";
static constexpr char gnss_ID_TYPE_GENERIC[] = "generic";
static constexpr char gnss_ID_VALUE_UNDETERMINED[] = "undetermined_gnss_board";

/* pre-release code - commented out
static constexpr bool reduceGNSSUART1OutputToTimeMessages = true;
static constexpr bool saveReducedGNSSUART1OutputPermanently = false;
*/
struct gnss_identity_t
{
    bool valid = false;
    char type[16] = "";
    char value[96] = "";
};

struct gnss_nvs_data_t
{
    bool has_id_type = false;
    char id_type[16] = "";
    char id_value[96] = "";
    uint32_t max_baud = 0;
};

static uint32_t s_gnss_target_baud = 0;

struct nmea_rmc_time_t
{
    int year = 0;
    int month = 0;
    int day = 0;
    int hour = 0;
    int minute = 0;
    int second = 0;
};

static void refresh_sync_state_locked(sync_state_t *state, int64_t now_us)
{
    if (state == nullptr)
        return;

    bool sync_stale = state->last_successful_sync_us > 0 && (now_us - state->last_successful_sync_us) > Sync_Stale_After_Us;
    bool pps_missing = s_time_has_been_set.load() && !state->pps_active;
    bool gnss_missing = s_time_has_been_set.load() && (!state->gnss_timing_valid ||
                                                       state->last_gnss_valid_us == 0 ||
                                                       (now_us - state->last_gnss_valid_us) > Gnss_Validity_Timeout_Us);

    state->faults.sync_stale = sync_stale;
    state->faults.gnss_invalid = gnss_missing;
    state->faults.pps_missing = pps_missing;

#if DEBUG_ENABLED
    if (gnss_missing)
        ESP_LOGE(TAG, "GNSS invalid - GNSS missing.");
#endif

    state->holdover_mode = has_sync_fault(state->faults);
}

static void publish_ntp_sync_state_locked(const sync_state_t &state)
{
    s_ntp_sync_state_sequence.fetch_add(1, std::memory_order_release);
    s_ntp_last_successful_sync_us.store(state.last_successful_sync_us, std::memory_order_relaxed);
    s_ntp_last_gnss_valid_us.store(state.last_gnss_valid_us, std::memory_order_relaxed);
    s_ntp_pps_active.store(state.pps_active, std::memory_order_relaxed);
    s_ntp_gnss_timing_valid.store(state.gnss_timing_valid, std::memory_order_relaxed);
    s_ntp_pps_missing.store(state.faults.pps_missing, std::memory_order_relaxed);
    s_ntp_gnss_invalid.store(state.faults.gnss_invalid, std::memory_order_relaxed);
    s_ntp_sanity_mismatch.store(state.faults.sanity_mismatch, std::memory_order_relaxed);
    s_ntp_sync_stale.store(state.faults.sync_stale, std::memory_order_relaxed);
    s_ntp_sync_state_sequence.fetch_add(1, std::memory_order_release);
}

static void sync_state_note_attempt()
{
    if (xSemaphoreTake(s_sync_state_mutex, portMAX_DELAY) == pdTRUE)
    {
        s_sync_state.last_sync_attempt_us = esp_timer_get_time();
        refresh_sync_state_locked(&s_sync_state, s_sync_state.last_sync_attempt_us);
        publish_ntp_sync_state_locked(s_sync_state);
        xSemaphoreGive(s_sync_state_mutex);
    }
}

static void sync_state_note_pps_edge(int64_t edge_us)
{
    if (xSemaphoreTake(s_sync_state_mutex, portMAX_DELAY) == pdTRUE)
    {
        s_sync_state.last_pps_seen_us = edge_us;
        s_sync_state.pps_active = true;
        refresh_sync_state_locked(&s_sync_state, edge_us);
        publish_ntp_sync_state_locked(s_sync_state);
        xSemaphoreGive(s_sync_state_mutex);
    }
}

static void sync_state_note_pps_timeout(int64_t now_us)
{
#if MQTT_ENABLED && MQTT_HISTORICAL_REPORTING_ENABLED
    if (s_time_has_been_set.load() && !s_historical_pps_fault_active.exchange(true))
        s_last_pps_undisciplined.store(time(nullptr));
#endif

    if (xSemaphoreTake(s_sync_state_mutex, portMAX_DELAY) == pdTRUE)
    {
        s_sync_state.pps_active = false;
        refresh_sync_state_locked(&s_sync_state, now_us);
        publish_ntp_sync_state_locked(s_sync_state);
        xSemaphoreGive(s_sync_state_mutex);
    }
}

static void set_gnss_lock_state(bool valid)
{
    int64_t now_us = esp_timer_get_time();
    bool previous = s_gnss_locked.exchange(valid);
    if (previous == valid)
        return;

    if (valid)
    {
        s_gnss_lock_started_us.store(now_us);
    }
    else
    {
        int64_t lock_started_us = s_gnss_lock_started_us.exchange(0);
        if (lock_started_us > 0 && now_us > lock_started_us)
            s_gnss_locked_total_us.fetch_add(now_us - lock_started_us);
    }
}

static void sync_state_note_gnss_validity(bool valid)
{
    set_gnss_lock_state(valid);

#if MQTT_ENABLED && MQTT_HISTORICAL_REPORTING_ENABLED
    if (!valid && s_time_has_been_set.load() && !s_historical_gnss_fault_active.exchange(true))
        s_last_gnss_unsynchronized.store(time(nullptr));
#endif

    if (xSemaphoreTake(s_sync_state_mutex, portMAX_DELAY) == pdTRUE)
    {
        int64_t now_us = esp_timer_get_time();
        s_sync_state.gnss_timing_valid = valid;
        if (valid)
            s_sync_state.last_gnss_valid_us = now_us;
        refresh_sync_state_locked(&s_sync_state, now_us);
        publish_ntp_sync_state_locked(s_sync_state);
        xSemaphoreGive(s_sync_state_mutex);
    }
}

static uint32_t sync_state_note_failure(const sync_faults_t &faults, time_t update_delta)
{
    uint32_t failure_count = 0;

    if (faults.gnss_invalid)
        set_gnss_lock_state(false);

#if MQTT_ENABLED && MQTT_HISTORICAL_REPORTING_ENABLED
    if (s_time_has_been_set.load())
    {
        if (faults.gnss_invalid && !s_historical_gnss_fault_active.exchange(true))
            s_last_gnss_unsynchronized.store(time(nullptr));
        if (faults.pps_missing && !s_historical_pps_fault_active.exchange(true))
            s_last_pps_undisciplined.store(time(nullptr));
    }
#endif

