roblatour/ESP32TimeServer/main/main.cpp
    err = nvs_erase_key(handle, gnss_NVS_KEY_ID_VALUE);
    if (err != ESP_OK && err != ESP_ERR_NVS_NOT_FOUND)
    {
        nvs_close(handle);
        return;
    }

    err = nvs_erase_key(handle, gnss_NVS_KEY_MAX_BAUD);
    if (err != ESP_OK && err != ESP_ERR_NVS_NOT_FOUND)
    {
        nvs_close(handle);
        return;
    }

    err = nvs_erase_key(handle, gnss_NVS_KEY_ATTEMPT_NO_SIGNAL_RECOVERY);
    if (err != ESP_OK && err != ESP_ERR_NVS_NOT_FOUND)
    {
        nvs_close(handle);
        return;
    }

    (void)nvs_commit(handle);
    nvs_close(handle);
}

static gnss_identity_t query_gnss_identity()
{
    gnss_identity_t identity{};

    UBX_SEC_UNIQID_data_t unique_chip_data{};
    if (s_gnss.getUniqueChipId(&unique_chip_data, 2000))
    {
        const char *unique_chip_id = s_gnss.getUniqueChipIdStr(&unique_chip_data, 2000);
        if (unique_chip_id != nullptr && unique_chip_id[0] != '\0')
        {
            snprintf(identity.type, sizeof(identity.type), "%s", gnss_ID_TYPE_UNIQID);
            snprintf(identity.value, sizeof(identity.value), "%s", unique_chip_id);
            identity.valid = true;
            return identity;
        }
    }

    if (s_gnss.getModuleInfo(2000))
    {
        const char *module_name = s_gnss.getModuleName(2000);
        const char *firmware_type = s_gnss.getFirmwareType(2000);
        uint8_t firmware_high = s_gnss.getFirmwareVersionHigh(2000);
        uint8_t firmware_low = s_gnss.getFirmwareVersionLow(2000);
        uint8_t protocol_high = s_gnss.getProtocolVersionHigh(2000);
        uint8_t protocol_low = s_gnss.getProtocolVersionLow(2000);

        if (module_name != nullptr && module_name[0] != '\0')
        {
            snprintf(identity.type, sizeof(identity.type), "%s", gnss_ID_TYPE_MODULE_FP);
            snprintf(identity.value,
                     sizeof(identity.value),
                     "%s|%s|FW%u.%u|PR%u.%u",
                     module_name,
                     firmware_type == nullptr ? "" : firmware_type,
                     static_cast<unsigned int>(firmware_high),
                     static_cast<unsigned int>(firmware_low),
                     static_cast<unsigned int>(protocol_high),
                     static_cast<unsigned int>(protocol_low));
            identity.valid = true;
            return identity;
        }
    }

    snprintf(identity.type, sizeof(identity.type), "%s", gnss_ID_TYPE_GENERIC);
    snprintf(identity.value, sizeof(identity.value), "%s", gnss_ID_VALUE_UNDETERMINED);
    identity.valid = true;
    return identity;
}

static bool gnss_identity_matches(const gnss_nvs_data_t &stored, const gnss_identity_t &current)
{
    if (!stored.has_id_type || !current.valid)
        return false;

    return strcmp(stored.id_type, current.type) == 0 && strcmp(stored.id_value, current.value) == 0;
}

#if UPTIME_RESTART_BUTTON_ENABLED
static bool check_uptime_request()
{

    static bool button_was_pressed = false;
    static uint32_t button_press_start_ms = 0;

    bool button_pressed = gpio_get_level(static_cast<gpio_num_t>(upTimeRestartPin)) == 0;

    if (button_pressed)
    {
        vTaskDelay(pdMS_TO_TICKS(10));
        button_pressed = gpio_get_level(static_cast<gpio_num_t>(upTimeRestartPin)) == 0;
    }

    if (!button_pressed)
    {
        button_was_pressed = false;
        button_press_start_ms = 0;
        return false;
    }

    if (!button_was_pressed)
    {
        button_was_pressed = true;
        button_press_start_ms = millis();
    }
    else if (millis() - button_press_start_ms >= holdUpTimeRestartButtonForThisManySecondsToTriggerAReset * 1000UL)
    {
        clear_gnss_nvs_data();
#if DEBUG_ENABLED
        ESP_LOGI(TAG, "Uptime/reset button restart requested: cleared stored GNSS NVS values.");
#endif
#if MQTT_ENABLED
        mqtt_publish_final_report();
#endif
        esp_restart();
    }

    return true;
}
#endif

static int64_t days_from_civil(int year, unsigned month, unsigned day)
{
    year -= month <= 2;
    const int era = (year >= 0 ? year : year - 399) / 400;
    const unsigned yoe = static_cast<unsigned>(year - era * 400);
    const unsigned doy = (153U * (month + (month > 2 ? static_cast<unsigned>(-3) : 9U)) + 2U) / 5U + day - 1U;
    const unsigned doe = yoe * 365U + yoe / 4U - yoe / 100U + doy;
    return static_cast<int64_t>(era) * 146097LL + static_cast<int64_t>(doe) - 719468LL;
}

static time_t epoch_from_utc(int year, int month, int day, int hour, int minute, int second)
{
    int64_t days = days_from_civil(year, static_cast<unsigned>(month), static_cast<unsigned>(day));
    int64_t seconds = days * 86400LL + hour * 3600LL + minute * 60LL + second;
    return static_cast<time_t>(seconds);
}

static uint64_t get_current_time_in_ntp64_format()

{

    struct timeval now{};

    gettimeofday(&now, nullptr);

    uint64_t seconds = NTP_EPOCH_OFFSET + static_cast<uint64_t>(now.tv_sec);

    uint64_t fraction = (static_cast<uint64_t>(now.tv_usec) << 32) / 1000000ULL;

    return (seconds << 32) | fraction;
}

static void write_ntp_timestamp(uint8_t *reply, size_t offset, uint64_t timestamp)
{
    reply[offset + 0] = static_cast<uint8_t>((timestamp >> 56) & 0xFF);
    reply[offset + 1] = static_cast<uint8_t>((timestamp >> 48) & 0xFF);
    reply[offset + 2] = static_cast<uint8_t>((timestamp >> 40) & 0xFF);
    reply[offset + 3] = static_cast<uint8_t>((timestamp >> 32) & 0xFF);
    reply[offset + 4] = static_cast<uint8_t>((timestamp >> 24) & 0xFF);
    reply[offset + 5] = static_cast<uint8_t>((timestamp >> 16) & 0xFF);
    reply[offset + 6] = static_cast<uint8_t>((timestamp >> 8) & 0xFF);
    reply[offset + 7] = static_cast<uint8_t>(timestamp & 0xFF);
}

struct ntp_reply_status_t
{
    uint8_t leap_indicator = 3;
    uint8_t stratum = 16;
    const char *reference_id = "INIT";
    bool reference_time_valid = false;
    bool gnss_synchronized = false;
    bool pps_disciplined = false;
};

static ntp_reply_status_t get_ntp_reply_status()
{
    for (size_t attempt = 0; attempt < 3; ++attempt)
    {
        uint32_t sequence_before = s_ntp_sync_state_sequence.load(std::memory_order_acquire);
        if ((sequence_before & 1U) != 0)
            continue;

        int64_t last_successful_sync_us = s_ntp_last_successful_sync_us.load(std::memory_order_relaxed);
        int64_t last_gnss_valid_us = s_ntp_last_gnss_valid_us.load(std::memory_order_relaxed);
        bool pps_active = s_ntp_pps_active.load(std::memory_order_relaxed);
        bool gnss_timing_valid = s_ntp_gnss_timing_valid.load(std::memory_order_relaxed);
        sync_faults_t faults{
            s_ntp_pps_missing.load(std::memory_order_relaxed),
            s_ntp_gnss_invalid.load(std::memory_order_relaxed),
            s_ntp_sanity_mismatch.load(std::memory_order_relaxed),
            s_ntp_sync_stale.load(std::memory_order_relaxed)};

        if (sequence_before != s_ntp_sync_state_sequence.load(std::memory_order_acquire))
            continue;

        int64_t now_us = esp_timer_get_time();
        bool gnss_recent = gnss_timing_valid && last_gnss_valid_us > 0 &&
                           (now_us - last_gnss_valid_us) <= Gnss_Validity_Timeout_Us;
        bool sync_stale = last_successful_sync_us > 0 &&
                          (now_us - last_successful_sync_us) > Sync_Stale_After_Us;
        bool gnss_synchronized = gnss_recent && !sync_stale && !faults.gnss_invalid;
        bool stratum_one = s_time_has_been_set.load(std::memory_order_acquire) &&
                           !s_time_setting_in_progress.load(std::memory_order_acquire) &&
                           !has_sync_fault(faults) && pps_active && gnss_synchronized &&
                           s_ntp_reference_valid.load(std::memory_order_acquire);

        if (stratum_one)
            return {0, 1, "GPS", true, gnss_synchronized, pps_active};
        return {3, 16, "INIT", false, gnss_synchronized, pps_active};
    }

