roblatour/ESP32TimeServer/main/main.cpp
    return {};
}

static constexpr uint8_t NTP_REPLY_TEMPLATE[NTP_PACKET_SIZE] = {
    0, 0, 4, static_cast<uint8_t>(NTP_PRECISION_EXPONENT),
    0, 0, 0, 0,
    0, 0, 0, static_cast<uint8_t>(NTP_ROOT_DISPERSION)};

static void build_ntp_reply(const uint8_t *request, uint8_t *reply, uint8_t version, uint64_t receive_time, const ntp_reply_status_t &status)
{
    memcpy(reply, NTP_REPLY_TEMPLATE, sizeof(NTP_REPLY_TEMPLATE));

    reply[0] = static_cast<uint8_t>((status.leap_indicator << 6) | (version << 3) | 4);
    reply[1] = status.stratum;
    memcpy(reply + 12, status.reference_id, 4);

    if (status.reference_time_valid)
        write_ntp_timestamp(reply, 16, s_ntp_reference_time_64.load(std::memory_order_acquire));

    memcpy(reply + 24, request + 40, 8);
    write_ntp_timestamp(reply, 32, receive_time);
}

static constexpr size_t ETH_HEADER_SIZE = 14;
static constexpr size_t IPV4_HEADER_SIZE = 20;
static constexpr size_t IPV6_HEADER_SIZE = 40;
static constexpr size_t UDP_HEADER_SIZE = 8;
static constexpr size_t RAW_NTP_FRAME_SIZE = ETH_HEADER_SIZE + IPV4_HEADER_SIZE + UDP_HEADER_SIZE + NTP_PACKET_SIZE;
static constexpr size_t RAW_IPV6_NTP_FRAME_SIZE = ETH_HEADER_SIZE + IPV6_HEADER_SIZE + UDP_HEADER_SIZE + NTP_PACKET_SIZE;
static constexpr size_t HARDWARE_NTP_REQUEST_QUEUE_DEPTH = 256;
static constexpr size_t HARDWARE_NTP_REQUEST_BUFFER_COUNT = 64; // Do not increase this value, larger pools caused unacceptable internal/DMA-memory pressure
static constexpr size_t HARDWARE_NTP_REQUEST_BUFFER_SIZE = ETH_HEADER_SIZE + IPV6_HEADER_SIZE + 60 + UDP_HEADER_SIZE + NTP_PACKET_SIZE;
static constexpr int64_t HARDWARE_NTP_TIMESTAMP_REFRESH_MS = 1000;
static constexpr uint32_t HARDWARE_NTP_TRANSMIT_RETRY_COUNT = 3;
static constexpr uint32_t HARDWARE_NTP_TRANSMIT_RETRY_DELAY_US = 10;
static constexpr uint32_t ETHERNET_RECOVERY_DELAY_MS = 100;
static constexpr uint32_t ETHERNET_RECOVERY_STOP_TIMEOUT_MS = 1000;
static constexpr uint32_t ETHERNET_RECOVERY_IP_TIMEOUT_MS = 10000;
static constexpr int64_t NTP_TRANSPORT_STALL_TIMEOUT_US = 35000000LL;

struct hardware_ntp_request_t
{
    esp_eth_handle_t handle;
    uint8_t *frame;
    uint32_t length;
    esp_netif_t *netif;
    eth_mac_time_t rx_timestamp;
};

static QueueHandle_t s_hardware_ntp_request_queue = nullptr;
static QueueHandle_t s_hardware_ntp_request_buffer_queue = nullptr;
static TaskHandle_t s_ntp_cache_purge_task_handle = nullptr;
static TaskHandle_t s_hardware_ntp_server_task_handle = nullptr;
static uint8_t s_hardware_ntp_request_buffers[HARDWARE_NTP_REQUEST_BUFFER_COUNT][HARDWARE_NTP_REQUEST_BUFFER_SIZE]{};

static bool initialize_hardware_ntp_request_buffers()
{
    for (size_t index = 0; index < HARDWARE_NTP_REQUEST_BUFFER_COUNT; ++index)
    {
        uint8_t *buffer = s_hardware_ntp_request_buffers[index];
        if (xQueueSend(s_hardware_ntp_request_buffer_queue, &buffer, 0) != pdTRUE)
            return false;
    }
    return true;
}

static void release_hardware_ntp_request_buffer(uint8_t *buffer)
{
    if (buffer != nullptr && s_hardware_ntp_request_buffer_queue != nullptr)
        xQueueSend(s_hardware_ntp_request_buffer_queue, &buffer, 0);
}

static void deinitialize_hardware_ntp_server()
{
    s_hardware_ntp_accepting.store(false, std::memory_order_release);
    if (s_hardware_ntp_server_task_handle != nullptr)
    {
        vTaskDelete(s_hardware_ntp_server_task_handle);
        s_hardware_ntp_server_task_handle = nullptr;
    }
    if (s_ntp_cache_purge_task_handle != nullptr)
    {
        vTaskDelete(s_ntp_cache_purge_task_handle);
        s_ntp_cache_purge_task_handle = nullptr;
    }
    if (s_hardware_ntp_request_queue != nullptr)
    {
        vQueueDelete(s_hardware_ntp_request_queue);
        s_hardware_ntp_request_queue = nullptr;
    }
    if (s_hardware_ntp_request_buffer_queue != nullptr)
    {
        vQueueDelete(s_hardware_ntp_request_buffer_queue);
        s_hardware_ntp_request_buffer_queue = nullptr;
    }
    if (s_hardware_ntp_transmit_mutex != nullptr)
    {
        vSemaphoreDelete(s_hardware_ntp_transmit_mutex);
        s_hardware_ntp_transmit_mutex = nullptr;
    }
    ntp_cache_deinit();
}

static uint16_t internet_checksum(const uint8_t *data, size_t length)
{
    uint32_t sum = 0;
    while (length >= 2)
    {
        sum += static_cast<uint16_t>((data[0] << 8) | data[1]);
        data += 2;
        length -= 2;
    }
    if (length != 0)
        sum += static_cast<uint16_t>(data[0] << 8);
    while ((sum >> 16) != 0)
        sum = (sum & 0xFFFFU) + (sum >> 16);
    return static_cast<uint16_t>(~sum);
}

static uint64_t ntp64_from_hardware_timestamp(const eth_mac_time_t &timestamp)
{
    const uint64_t seconds = NTP_EPOCH_OFFSET + timestamp.seconds;
    const uint64_t fraction = (static_cast<uint64_t>(timestamp.nanoseconds) << 32) / 1000000000ULL;
    return (seconds << 32) | fraction;
}

static bool timestamp_is_valid(const eth_mac_time_t *timestamp)
{
    return timestamp != nullptr && (timestamp->seconds != 0 || timestamp->nanoseconds != 0);
}

static bool is_ipv4_ntp_request(const uint8_t *frame, uint32_t length, size_t *ip_offset, size_t *udp_offset)
{
    if (frame == nullptr || length < RAW_NTP_FRAME_SIZE || frame[12] != 0x08 || frame[13] != 0x00)
        return false;

    const size_t ipv4_offset = ETH_HEADER_SIZE;
    const uint8_t version_ihl = frame[ipv4_offset];
    const size_t header_length = static_cast<size_t>(version_ihl & 0x0F) * 4;
    if ((version_ihl >> 4) != 4 || header_length < IPV4_HEADER_SIZE || length < ETH_HEADER_SIZE + header_length + UDP_HEADER_SIZE + NTP_PACKET_SIZE)
        return false;
    if (frame[ipv4_offset + 9] != IPPROTO_UDP)
        return false;

    const size_t udp_header_offset = ipv4_offset + header_length;
    const uint16_t udp_length = static_cast<uint16_t>((frame[udp_header_offset + 4] << 8) | frame[udp_header_offset + 5]);
    const uint16_t destination_port = static_cast<uint16_t>((frame[udp_header_offset + 2] << 8) | frame[udp_header_offset + 3]);
    if (destination_port != NTP_PORT || udp_length != UDP_HEADER_SIZE + NTP_PACKET_SIZE)
        return false;

    *ip_offset = ipv4_offset;
    *udp_offset = udp_header_offset;
    return true;
}

static bool is_ipv6_extension_header(uint8_t next_header)
{
    return next_header == 0 || next_header == 43 || next_header == 60 || next_header == 135 || next_header == 51;
}

static bool is_ipv6_ntp_request(const uint8_t *frame, uint32_t length, size_t *ip_offset, size_t *udp_offset)
{
    if (frame == nullptr || length < RAW_IPV6_NTP_FRAME_SIZE || frame[12] != 0x86 || frame[13] != 0xDD)
        return false;

    const size_t ipv6_offset = ETH_HEADER_SIZE;
    if ((frame[ipv6_offset] >> 4) != 6)
        return false;

    const size_t payload_length = static_cast<size_t>((frame[ipv6_offset + 4] << 8) | frame[ipv6_offset + 5]);
    const size_t payload_end = ipv6_offset + IPV6_HEADER_SIZE + payload_length;
    if (payload_end > length)
        return false;

