roblatour/ESP32TimeServer/main/main.cpp
    uint8_t next_header = frame[ipv6_offset + 6];
    size_t offset = ipv6_offset + IPV6_HEADER_SIZE;
    for (size_t count = 0; is_ipv6_extension_header(next_header); ++count)
    {
        if (count == 8 || offset + 2 > payload_end)
            return false;
        const size_t extension_length = next_header == 51
                                            ? static_cast<size_t>(frame[offset + 1] + 2) * 4
                                            : static_cast<size_t>(frame[offset + 1] + 1) * 8;
        if (extension_length < 8 || offset + extension_length > payload_end)
            return false;
        next_header = frame[offset];
        offset += extension_length;
    }

    if (next_header != IPPROTO_UDP || offset + UDP_HEADER_SIZE + NTP_PACKET_SIZE > payload_end)
        return false;

    const uint16_t udp_length = static_cast<uint16_t>((frame[offset + 4] << 8) | frame[offset + 5]);
    const uint16_t destination_port = static_cast<uint16_t>((frame[offset + 2] << 8) | frame[offset + 3]);
    if (destination_port != NTP_PORT || udp_length != UDP_HEADER_SIZE + NTP_PACKET_SIZE ||
        offset + udp_length != payload_end)
        return false;

    *ip_offset = ipv6_offset;
    *udp_offset = offset;
    return true;
}

static uint16_t ipv6_udp_checksum(const uint8_t *source, const uint8_t *destination, const uint8_t *udp, size_t udp_length)
{
    uint8_t checksum_data[IPV6_HEADER_SIZE + UDP_HEADER_SIZE + NTP_PACKET_SIZE] = {};
    memcpy(checksum_data, source, 16);
    memcpy(checksum_data + 16, destination, 16);
    checksum_data[35] = static_cast<uint8_t>(udp_length);
    checksum_data[39] = IPPROTO_UDP;
    memcpy(checksum_data + IPV6_HEADER_SIZE, udp, udp_length);
    const uint16_t checksum = internet_checksum(checksum_data, IPV6_HEADER_SIZE + udp_length);
    return checksum == 0 ? 0xFFFF : checksum;
}

static esp_err_t process_hardware_ntp_request(esp_eth_handle_t handle, uint8_t *frame, uint32_t length, void *netif, void *info)
{
    size_t ip_offset = 0;
    size_t udp_offset = 0;
    const eth_mac_time_t *rx_timestamp = static_cast<const eth_mac_time_t *>(info);
    if (!is_ipv4_ntp_request(frame, length, &ip_offset, &udp_offset) || !timestamp_is_valid(rx_timestamp))
    {
        release_hardware_ntp_request_buffer(frame);
        return ESP_OK;
    }

    const eth_mac_time_t receive_timestamp = *rx_timestamp;
    const uint8_t *request = frame + udp_offset + UDP_HEADER_SIZE;
    const uint8_t version = (request[0] >> 3) & 0x07;
    const uint8_t mode = request[0] & 0x07;
    if (version < 3 || version > 4 || mode != 3)
    {
        release_hardware_ntp_request_buffer(frame);
        return ESP_OK;
    }

    const uint32_t client_ip = (static_cast<uint32_t>(frame[ip_offset + 16]) << 24) |
                               (static_cast<uint32_t>(frame[ip_offset + 17]) << 16) |
                               (static_cast<uint32_t>(frame[ip_offset + 18]) << 8) |
                               frame[ip_offset + 19];
    const uint16_t client_port = static_cast<uint16_t>((frame[udp_offset] << 8) | frame[udp_offset + 1]);
    ntp_client_record_t client_record{};
    if (!ntp_cache_find_or_create(client_ip, client_port, &client_record))
    {
        release_hardware_ntp_request_buffer(frame);
        return ESP_OK;
    }

    const uint64_t receive_time = ntp64_from_hardware_timestamp(receive_timestamp);
#if MQTT_ENABLED
    struct sockaddr_storage source_address{};
    auto *source_ipv4_address = reinterpret_cast<struct sockaddr_in *>(&source_address);
    source_ipv4_address->sin_family = AF_INET;
    source_ipv4_address->sin_port = htons(client_port);
    memcpy(&source_ipv4_address->sin_addr, frame + ip_offset + 12, sizeof(source_ipv4_address->sin_addr));
    s_ntp_valid_requests.fetch_add(1, std::memory_order_relaxed);
    mqtt_enqueue_ntp_request(source_address);
#endif
    uint8_t reply[NTP_PACKET_SIZE] = {};
    const ntp_reply_status_t status = get_ntp_reply_status();
#if MQTT_ENABLED
    if (status.gnss_synchronized && status.pps_disciplined)
        s_ntp_responses_synchronized_and_disciplined.fetch_add(1, std::memory_order_relaxed);
    if (!status.gnss_synchronized)
        s_ntp_responses_gnss_unsynchronized.fetch_add(1, std::memory_order_relaxed);
    if (!status.pps_disciplined)
        s_ntp_responses_pps_undisciplined.fetch_add(1, std::memory_order_relaxed);
#endif
    build_ntp_reply(request, reply, version, receive_time, status);

    const uint64_t client_receive_timestamp =
        (static_cast<uint64_t>(request[32]) << 56) | (static_cast<uint64_t>(request[33]) << 48) |
        (static_cast<uint64_t>(request[34]) << 40) | (static_cast<uint64_t>(request[35]) << 32) |
        (static_cast<uint64_t>(request[36]) << 24) | (static_cast<uint64_t>(request[37]) << 16) |
        (static_cast<uint64_t>(request[38]) << 8) | request[39];
    const uint64_t client_origin_timestamp =
        (static_cast<uint64_t>(request[24]) << 56) | (static_cast<uint64_t>(request[25]) << 48) |
        (static_cast<uint64_t>(request[26]) << 40) | (static_cast<uint64_t>(request[27]) << 32) |
        (static_cast<uint64_t>(request[28]) << 24) | (static_cast<uint64_t>(request[29]) << 16) |
        (static_cast<uint64_t>(request[30]) << 8) | request[31];
    const uint64_t client_transmit_timestamp =
        (static_cast<uint64_t>(request[40]) << 56) | (static_cast<uint64_t>(request[41]) << 48) |
        (static_cast<uint64_t>(request[42]) << 40) | (static_cast<uint64_t>(request[43]) << 32) |
        (static_cast<uint64_t>(request[44]) << 24) | (static_cast<uint64_t>(request[45]) << 16) |
        (static_cast<uint64_t>(request[46]) << 8) | request[47];
    const uint64_t previous_t2 = ((NTP_EPOCH_OFFSET + static_cast<uint64_t>(client_record.prev_t2_sec)) << 32) |
                                 ((static_cast<uint64_t>(client_record.prev_t2_ns) << 32) / 1000000000ULL);
    const uint64_t previous_t3 = ((NTP_EPOCH_OFFSET + static_cast<uint64_t>(client_record.prev_t3_sec)) << 32) |
                                 ((static_cast<uint64_t>(client_record.prev_t3_ns) << 32) / 1000000000ULL);
    const bool interleaved_reply = client_record.prev_t2_sec != 0 &&
                                   client_receive_timestamp != client_transmit_timestamp &&
                                   client_origin_timestamp == previous_t2;
    if (interleaved_reply)
    {
        write_ntp_timestamp(reply, 24, client_receive_timestamp);
        write_ntp_timestamp(reply, 40, previous_t3);
    }
    else
    {
        write_ntp_timestamp(reply, 40, get_current_time_in_ntp64_format());
    }

