roblatour/ESP32TimeServer/main/main.cpp
    uint8_t response_frame[RAW_NTP_FRAME_SIZE] = {};
    memcpy(response_frame, frame + 6, 6);
    memcpy(response_frame + 6, frame, 6);
    response_frame[12] = 0x08;
    response_frame[13] = 0x00;
    uint8_t *ip = response_frame + ETH_HEADER_SIZE;
    ip[0] = 0x45;
    ip[2] = 0;
    ip[3] = IPV4_HEADER_SIZE + UDP_HEADER_SIZE + NTP_PACKET_SIZE;
    ip[8] = 64;
    ip[9] = IPPROTO_UDP;
    memcpy(ip + 12, frame + ip_offset + 16, 4);
    memcpy(ip + 16, frame + ip_offset + 12, 4);
    const uint16_t checksum = internet_checksum(ip, IPV4_HEADER_SIZE);
    ip[10] = static_cast<uint8_t>(checksum >> 8);
    ip[11] = static_cast<uint8_t>(checksum);
    uint8_t *udp = ip + IPV4_HEADER_SIZE;
    udp[0] = 0;
    udp[1] = static_cast<uint8_t>(NTP_PORT);
    udp[2] = frame[udp_offset];
    udp[3] = frame[udp_offset + 1];
    udp[4] = 0;
    udp[5] = UDP_HEADER_SIZE + NTP_PACKET_SIZE;
    memcpy(udp + UDP_HEADER_SIZE, reply, sizeof(reply));

    const bool request_hardware_tx_timestamp = interleaved_reply ||
                                               client_record.prev_t2_sec == 0 ||
                                               (esp_timer_get_time() / 1000 - client_record.last_seen_ms) >= HARDWARE_NTP_TIMESTAMP_REFRESH_MS;
    eth_mac_time_t tx_timestamp{};
    bool tx_timestamp_valid = false;
    esp_err_t result = ESP_ERR_INVALID_STATE;
    if (s_hardware_ntp_accepting.load(std::memory_order_acquire) &&
        s_hardware_ntp_transmit_mutex != nullptr)
    {
        if (xSemaphoreTake(s_hardware_ntp_transmit_mutex, portMAX_DELAY) == pdTRUE)
        {
            if (s_hardware_ntp_accepting.load(std::memory_order_acquire))
            {
                for (uint32_t attempt = 0; attempt < HARDWARE_NTP_TRANSMIT_RETRY_COUNT; ++attempt)
                {
                    if (!interleaved_reply)
                    {
                        write_ntp_timestamp(reply, 40, get_current_time_in_ntp64_format());
                        memcpy(udp + UDP_HEADER_SIZE, reply, sizeof(reply));
                    }

                    if (request_hardware_tx_timestamp)
                    {
                        result = esp_eth_transmit_ctrl_vargs(handle, &tx_timestamp, 2, response_frame, sizeof(response_frame));
                        tx_timestamp_valid = timestamp_is_valid(&tx_timestamp);
                    }
                    else
                    {
                        result = esp_eth_transmit(handle, response_frame, sizeof(response_frame));
                    }
                    if (result != ESP_ERR_NO_MEM)
                        break;
                    esp_rom_delay_us(HARDWARE_NTP_TRANSMIT_RETRY_DELAY_US);
                }
            }
            xSemaphoreGive(s_hardware_ntp_transmit_mutex);
        }
    }
    if (result == ESP_OK)
    {
        if (tx_timestamp_valid)
        {
            ntp_cache_update(client_ip, client_port, receive_timestamp.seconds, receive_timestamp.nanoseconds,
                             tx_timestamp.seconds, tx_timestamp.nanoseconds);
        }
        s_last_hardware_ntp_response_us.store(esp_timer_get_time(), std::memory_order_release);
#if MQTT_ENABLED
        s_ntp_responses.fetch_add(1, std::memory_order_relaxed);
#endif
    }

    release_hardware_ntp_request_buffer(frame);
    return result;
}

static uint64_t read_ntp_timestamp(const uint8_t *packet, size_t offset)
{
    return (static_cast<uint64_t>(packet[offset]) << 56) |
           (static_cast<uint64_t>(packet[offset + 1]) << 48) |
           (static_cast<uint64_t>(packet[offset + 2]) << 40) |
           (static_cast<uint64_t>(packet[offset + 3]) << 32) |
           (static_cast<uint64_t>(packet[offset + 4]) << 24) |
           (static_cast<uint64_t>(packet[offset + 5]) << 16) |
           (static_cast<uint64_t>(packet[offset + 6]) << 8) |
           static_cast<uint64_t>(packet[offset + 7]);
}

static esp_err_t process_hardware_ipv6_ntp_request(esp_eth_handle_t handle, uint8_t *frame, uint32_t length, void *netif, void *info)
{
    size_t ip_offset = 0;
    size_t udp_offset = 0;
    const eth_mac_time_t *rx_timestamp = static_cast<const eth_mac_time_t *>(info);
    if (!is_ipv6_ntp_request(frame, length, &ip_offset, &udp_offset) || !timestamp_is_valid(rx_timestamp))
    {
        release_hardware_ntp_request_buffer(frame);
        return ESP_OK;
    }

    const eth_mac_time_t receive_timestamp = *rx_timestamp;
    const uint8_t *request = frame + udp_offset + UDP_HEADER_SIZE;
    const uint8_t version = (request[0] >> 3) & 0x07;
    const uint8_t mode = request[0] & 0x07;
    if (version < 3 || version > 4 || mode != 3)
    {
        release_hardware_ntp_request_buffer(frame);
        return ESP_OK;
    }

    struct in6_addr client_ip{};
    memcpy(&client_ip, frame + ip_offset + 8, sizeof(client_ip));
    const uint16_t client_port = static_cast<uint16_t>((frame[udp_offset] << 8) | frame[udp_offset + 1]);
    ntp_client_record_ipv6_t client_record{};
    if (!ntp_cache_find_or_create_ipv6(&client_ip, client_port, &client_record))
    {
        release_hardware_ntp_request_buffer(frame);
        return ESP_OK;
    }

    const uint64_t receive_time = ntp64_from_hardware_timestamp(receive_timestamp);
#if MQTT_ENABLED
    struct sockaddr_storage source_address{};
    auto *source_ipv6_address = reinterpret_cast<struct sockaddr_in6 *>(&source_address);
    source_ipv6_address->sin6_family = AF_INET6;
    source_ipv6_address->sin6_port = htons(client_port);
    source_ipv6_address->sin6_scope_id = esp_netif_get_netif_impl_index(static_cast<esp_netif_t *>(netif));
    source_ipv6_address->sin6_addr = client_ip;
    s_ntp_valid_requests.fetch_add(1, std::memory_order_relaxed);
    mqtt_enqueue_ntp_request(source_address);
#endif
    uint8_t reply[NTP_PACKET_SIZE] = {};
    const ntp_reply_status_t status = get_ntp_reply_status();
#if MQTT_ENABLED
    if (status.gnss_synchronized && status.pps_disciplined)
        s_ntp_responses_synchronized_and_disciplined.fetch_add(1, std::memory_order_relaxed);
    if (!status.gnss_synchronized)
        s_ntp_responses_gnss_unsynchronized.fetch_add(1, std::memory_order_relaxed);
    if (!status.pps_disciplined)
        s_ntp_responses_pps_undisciplined.fetch_add(1, std::memory_order_relaxed);
#endif
    build_ntp_reply(request, reply, version, receive_time, status);

