roblatour/ESP32TimeServer/main/main.cpp
    const uint64_t client_receive_timestamp = read_ntp_timestamp(request, 32);
    const uint64_t client_origin_timestamp = read_ntp_timestamp(request, 24);
    const uint64_t client_transmit_timestamp = read_ntp_timestamp(request, 40);
    const bool interleaved_reply = client_record.prev_t2 != 0 &&
                                   client_receive_timestamp != client_transmit_timestamp &&
                                   client_origin_timestamp == client_record.prev_t2;
    if (interleaved_reply)
    {
        write_ntp_timestamp(reply, 24, client_receive_timestamp);
        write_ntp_timestamp(reply, 40, client_record.prev_t3);
    }
    else
    {
        write_ntp_timestamp(reply, 40, get_current_time_in_ntp64_format());
    }

    uint8_t response_frame[RAW_IPV6_NTP_FRAME_SIZE] = {};
    memcpy(response_frame, frame + 6, 6);
    memcpy(response_frame + 6, frame, 6);
    response_frame[12] = 0x86;
    response_frame[13] = 0xDD;
    uint8_t *ip = response_frame + ETH_HEADER_SIZE;
    ip[0] = 0x60;
    ip[5] = UDP_HEADER_SIZE + NTP_PACKET_SIZE;
    ip[6] = IPPROTO_UDP;
    ip[7] = 64;
    memcpy(ip + 8, frame + ip_offset + 24, 16);
    memcpy(ip + 24, frame + ip_offset + 8, 16);
    uint8_t *udp = ip + IPV6_HEADER_SIZE;
    udp[1] = static_cast<uint8_t>(NTP_PORT);
    udp[2] = frame[udp_offset];
    udp[3] = frame[udp_offset + 1];
    udp[5] = UDP_HEADER_SIZE + NTP_PACKET_SIZE;
    memcpy(udp + UDP_HEADER_SIZE, reply, sizeof(reply));
    const uint16_t checksum = ipv6_udp_checksum(ip + 8, ip + 24, udp, UDP_HEADER_SIZE + NTP_PACKET_SIZE);
    udp[6] = static_cast<uint8_t>(checksum >> 8);
    udp[7] = static_cast<uint8_t>(checksum);

    const bool request_hardware_tx_timestamp = interleaved_reply || client_record.prev_t2 == 0 ||
                                               (esp_timer_get_time() / 1000 - client_record.last_seen_ms) >= HARDWARE_NTP_TIMESTAMP_REFRESH_MS;
    eth_mac_time_t tx_timestamp{};
    bool tx_timestamp_valid = false;
    esp_err_t result = ESP_ERR_INVALID_STATE;
    if (s_hardware_ntp_accepting.load(std::memory_order_acquire) && s_hardware_ntp_transmit_mutex != nullptr &&
        xSemaphoreTake(s_hardware_ntp_transmit_mutex, portMAX_DELAY) == pdTRUE)
    {
        if (s_hardware_ntp_accepting.load(std::memory_order_acquire))
        {
            for (uint32_t attempt = 0; attempt < HARDWARE_NTP_TRANSMIT_RETRY_COUNT; ++attempt)
            {
                if (!interleaved_reply)
                {
                    write_ntp_timestamp(reply, 40, get_current_time_in_ntp64_format());
                    memcpy(udp + UDP_HEADER_SIZE, reply, sizeof(reply));
                    udp[6] = 0;
                    udp[7] = 0;
                    const uint16_t refreshed_checksum = ipv6_udp_checksum(ip + 8, ip + 24, udp, UDP_HEADER_SIZE + NTP_PACKET_SIZE);
                    udp[6] = static_cast<uint8_t>(refreshed_checksum >> 8);
                    udp[7] = static_cast<uint8_t>(refreshed_checksum);
                }
                if (request_hardware_tx_timestamp)
                {
                    result = esp_eth_transmit_ctrl_vargs(handle, &tx_timestamp, 2, response_frame, sizeof(response_frame));
                    tx_timestamp_valid = timestamp_is_valid(&tx_timestamp);
                }
                else
                {
                    result = esp_eth_transmit(handle, response_frame, sizeof(response_frame));
                }
                if (result != ESP_ERR_NO_MEM)
                    break;
                esp_rom_delay_us(HARDWARE_NTP_TRANSMIT_RETRY_DELAY_US);
            }
        }
        xSemaphoreGive(s_hardware_ntp_transmit_mutex);
    }
    if (result == ESP_OK)
    {
        if (tx_timestamp_valid)
            ntp_cache_update_ipv6(&client_ip, client_port, receive_time, ntp64_from_hardware_timestamp(tx_timestamp));
        s_last_hardware_ntp_response_us.store(esp_timer_get_time(), std::memory_order_release);
#if MQTT_ENABLED
        s_ntp_responses.fetch_add(1, std::memory_order_relaxed);
#endif
    }

    release_hardware_ntp_request_buffer(frame);
    return result;
}

static esp_err_t ntp_ethernet_input(esp_eth_handle_t handle, uint8_t *frame, uint32_t length, void *netif, void *info)
{
    size_t ip_offset = 0;
    size_t udp_offset = 0;
    const eth_mac_time_t *rx_timestamp = static_cast<const eth_mac_time_t *>(info);
    if (!is_ipv4_ntp_request(frame, length, &ip_offset, &udp_offset) &&
        !is_ipv6_ntp_request(frame, length, &ip_offset, &udp_offset))
        return esp_netif_receive(static_cast<esp_netif_t *>(netif), frame, length, nullptr);
    const uint8_t *request = frame + udp_offset + UDP_HEADER_SIZE;
    const uint8_t version = (request[0] >> 3) & 0x07;
    const uint8_t mode = request[0] & 0x07;
    if (version < 3 || version > 4 || mode != 3)
    {
        return esp_netif_receive(static_cast<esp_netif_t *>(netif), frame, length, nullptr);
    }

    if (!timestamp_is_valid(rx_timestamp))
    {
        free(frame);
        return ESP_OK;
    }

#if MQTT_ENABLED
    s_ntp_requests_this_second.fetch_add(1, std::memory_order_relaxed);
#endif
    const eth_mac_time_t receive_timestamp = *rx_timestamp;
    if (!s_hardware_ntp_accepting.load(std::memory_order_acquire) || s_hardware_ntp_request_queue == nullptr ||
        s_hardware_ntp_request_buffer_queue == nullptr)
    {
        free(frame);
    }
    else
    {
        uint8_t *request_buffer = nullptr;
        if (length > HARDWARE_NTP_REQUEST_BUFFER_SIZE ||
            xQueueReceive(s_hardware_ntp_request_buffer_queue, &request_buffer, 0) != pdTRUE)
        {
            free(frame);
            return ESP_OK;
        }
        memcpy(request_buffer, frame, length);
        free(frame);

        const hardware_ntp_request_t ntp_request{handle, request_buffer, length, static_cast<esp_netif_t *>(netif), receive_timestamp};
        if (xQueueSend(s_hardware_ntp_request_queue, &ntp_request, 0) != pdTRUE)
        {
            release_hardware_ntp_request_buffer(request_buffer);
        }
    }
    return ESP_OK;
}

static void ntp_cache_purge_task(void *parameter)
{
    (void)parameter;
    for (;;)
    {
        vTaskDelay(pdMS_TO_TICKS(60000));
        ntp_cache_purge_expired();

#if CALCULATE_NTP_CACHE_PURGE_TASK_STACK_SIZE_ENABLED
        report_current_task_stack_usage(NTP_Cache_Purge);
#endif
    }
}

// Handles NTP requests from IPv4 sources using Ethernet hardware timestamps to provide high-precision, GNSS-disciplined time responses.
// If the hardware timestamp is not available or valid, the request will be handled by the standard NTP server (ntp_server_task).
static void hardware_ntp_server_task(void *parameter)
{
    (void)parameter;
    hardware_ntp_request_t ntp_request{};
    for (;;)
    {
        if (xQueueReceive(s_hardware_ntp_request_queue, &ntp_request, portMAX_DELAY) == pdTRUE)
        {
            if (ntp_request.frame[12] == 0x86 && ntp_request.frame[13] == 0xDD)
                process_hardware_ipv6_ntp_request(ntp_request.handle, ntp_request.frame, ntp_request.length,
                                                  ntp_request.netif, &ntp_request.rx_timestamp);
            else
                process_hardware_ntp_request(ntp_request.handle, ntp_request.frame, ntp_request.length,
                                             ntp_request.netif, &ntp_request.rx_timestamp);
#if CALCULATE_HARDWARE_NTP_SERVER_TASK_STACK_SIZE_ENABLED
            report_current_task_stack_usage(Hardware_NTP_Server);
#endif
        }
    }
}

