roblatour/ESP32TimeServer/main/main.cpp
#if MQTT_ENABLED
static void recover_ethernet_transport()
{
    if (ETH.handle() == nullptr || s_hardware_ntp_transmit_mutex == nullptr ||
        xSemaphoreTake(s_hardware_ntp_transmit_mutex, portMAX_DELAY) != pdTRUE)
        return;

    ESP_LOGW(TAG, "MQTT and NTP transport stalled; restarting Ethernet");
    s_hardware_ntp_accepting.store(false, std::memory_order_release);
    hardware_ntp_request_t request{};
    while (xQueueReceive(s_hardware_ntp_request_queue, &request, 0) == pdTRUE)
    {
        release_hardware_ntp_request_buffer(request.frame);
    }

    s_ptp_clock_ready.store(false, std::memory_order_release);
    s_hardware_ntp_accepting.store(false, std::memory_order_release);
    xSemaphoreGive(s_hardware_ntp_transmit_mutex);

    if (mqtt_publish_or_queue_restart_notification("ethernet_transport_stalled"))
    {
        ESP_LOGW(TAG, "Restarting after NTP transport stall");
        esp_restart();
    }

    ESP_LOGE(TAG, "Ethernet transport restart notification could not be published or queued");
}

static void ethernet_transport_recovery_task(void *parameter)
{
    (void)parameter;
    for (;;)
    {
        const int64_t now_us = esp_timer_get_time();
        const int64_t disconnected_since_us = s_mqtt_disconnected_since_us.load(std::memory_order_acquire);
        const int64_t last_ntp_response_us = s_last_hardware_ntp_response_us.load(std::memory_order_acquire);
        if (s_mqtt_has_connected.load(std::memory_order_acquire) &&
            !s_mqtt_connected.load(std::memory_order_acquire) && disconnected_since_us > 0 &&
            now_us - disconnected_since_us >= NTP_TRANSPORT_STALL_TIMEOUT_US &&
            last_ntp_response_us > 0 && now_us - last_ntp_response_us >= NTP_TRANSPORT_STALL_TIMEOUT_US)
        {
            recover_ethernet_transport();
            s_mqtt_disconnected_since_us.store(esp_timer_get_time(), std::memory_order_release);

#if CALCULATE_ETHERNET_TRANSPORT_RECOVERY_TASK_STACK_SIZE_ENABLED
            report_current_task_stack_usage(Ethernet_Transport_Recovery);
#endif
        }
        vTaskDelay(pdMS_TO_TICKS(1000));
    }
}
#endif

static void synchronize_hardware_clock()
{
    if (!s_ptp_clock_ready.load(std::memory_order_acquire))
        return;

    struct timeval now{};
    gettimeofday(&now, nullptr);
    const struct timespec clock_time{
        now.tv_sec,
        static_cast<long>(now.tv_usec) * 1000L};
    clock_settime(CLOCK_PTP_SYSTEM, &clock_time);
}

static bool configure_hardware_timestamps()
{
    const esp_eth_handle_t handle = ETH.handle();
    if (handle == nullptr)
        return false;

    const esp_eth_clock_cfg_t clock_config{CLOCK_PTP_SYSTEM};
    if (esp_eth_clock_init(handle, &clock_config) != ESP_OK)
        return false;

    esp_eth_mac_t *mac = nullptr;
    if (esp_eth_get_mac_instance(handle, &mac) != ESP_OK ||
        esp_eth_mac_enable_ts4all(mac, true) != ESP_OK)
        return false;

    s_ptp_clock_ready.store(true, std::memory_order_release);
    synchronize_hardware_clock();

    const bool input_path_updated = esp_eth_update_input_path_info(handle, ntp_ethernet_input, ETH.netif()) == ESP_OK;
    s_hardware_ntp_accepting.store(input_path_updated, std::memory_order_release);
    return input_path_updated;
}

static const char *fix_type_to_text(uint8_t fix_type)
{
    switch (fix_type)
    {
    case 1:
        return "Dead reckoning";
    case 2:
        return "2D";
    case 3:
        return "3D";
    case 4:
        return "GNSS + Dead reckoning";
    case 5:
        return "Date and time";
    default:
        return "No fix";
    }
}

static bool is_digit_char(char c)
{
    return c >= '0' && c <= '9';
}

static bool parse_two_digits(const char *text, int &value)
{
    if (text == nullptr || !is_digit_char(text[0]) || !is_digit_char(text[1]))
        return false;

    value = (text[0] - '0') * 10 + (text[1] - '0');
    return true;
}

static bool get_nmea_field(const char *sentence, int field_index, char *output, size_t output_size)
{
    if (sentence == nullptr || output == nullptr || output_size == 0 || field_index < 0)
        return false;

    const char *cursor = sentence;
    if (*cursor == '$')
        cursor++;

    int current_field = 0;
    const char *field_start = cursor;

    while (true)
    {
        char current = *cursor;
        bool is_delimiter = (current == ',') || (current == '*') || (current == '\0') || (current == '\r') || (current == '\n');

        if (is_delimiter)
        {
            if (current_field == field_index)
            {
                size_t length = static_cast<size_t>(cursor - field_start);
                if (length >= output_size)
                    length = output_size - 1;

                memcpy(output, field_start, length);
                output[length] = '\0';
                return true;
            }

            if (current != ',')
                break;

            current_field++;
            cursor++;
            field_start = cursor;
            continue;
        }

        cursor++;
    }

    output[0] = '\0';
    return false;
}

static bool parse_nmea_rmc_sentence(const char *sentence, nmea_rmc_time_t *time_data)
{
    if (sentence == nullptr || time_data == nullptr)
        return false;

    char sentence_type[16] = "";
    if (!get_nmea_field(sentence, 0, sentence_type, sizeof(sentence_type)))
        return false;

    size_t sentence_type_len = strlen(sentence_type);
    if (sentence_type_len < 3 || strcmp(sentence_type + sentence_type_len - 3, "RMC") != 0)
        return false;

    char status_field[4] = "";
    if (!get_nmea_field(sentence, 2, status_field, sizeof(status_field)))
        return false;

    if (status_field[0] != 'A')
        return false;

    char time_field[16] = "";
    char date_field[16] = "";
    if (!get_nmea_field(sentence, 1, time_field, sizeof(time_field)) || !get_nmea_field(sentence, 9, date_field, sizeof(date_field)))
        return false;

    if (strlen(time_field) < 6 || strlen(date_field) < 6)
        return false;

    int hour = 0;
    int minute = 0;
    int second = 0;
    int day = 0;
    int month = 0;
    int year_two_digit = 0;

