roblatour/ESP32TimeServer/main/main.cpp
    if (!parse_two_digits(time_field + 0, hour) ||
        !parse_two_digits(time_field + 2, minute) ||
        !parse_two_digits(time_field + 4, second) ||
        !parse_two_digits(date_field + 0, day) ||
        !parse_two_digits(date_field + 2, month) ||
        !parse_two_digits(date_field + 4, year_two_digit))
    {
        return false;
    }

    int year = 2000 + year_two_digit;

    if (year <= 2022 || month < 1 || month > 12 || day < 1 || day > 31 || hour < 0 || hour > 23 || minute < 0 || minute > 59 || second < 0 || second > 60)
        return false;

    time_data->year = year;
    time_data->month = month;
    time_data->day = day;
    time_data->hour = hour;
    time_data->minute = minute;
    time_data->second = second;
    return true;
}

#if UBLOX_COMPLIANT_GNSS_RECEIVER_ENABLED
#else
static constexpr size_t NMEA_GSV_GROUP_LIMIT = 8;
static constexpr uint32_t NMEA_GSV_GROUP_EXPIRY_MS = 10000UL;

struct nmea_gsv_group_t
{
    char talker[3] = "";
    char signal_id[4] = "";
    uint8_t message_count = 0;
    uint8_t next_message_number = 0;
    uint8_t satellites_in_view = 0;
    uint32_t last_updated_ms = 0;
    bool published = false;
};

static nmea_gsv_group_t s_nmea_gsv_groups[NMEA_GSV_GROUP_LIMIT]{};

static bool is_nmea_checksum_valid(const char *sentence)
{
    if (sentence == nullptr || sentence[0] != '$')
        return false;

    const char *checksum_marker = strrchr(sentence, '*');
    if (checksum_marker == nullptr || checksum_marker[1] == '\0' || checksum_marker[2] == '\0' || checksum_marker[3] != '\0')
        return false;

    unsigned int expected_checksum = 0;
    if (sscanf(checksum_marker + 1, "%2X", &expected_checksum) != 1)
        return false;

    uint8_t actual_checksum = 0;
    for (const char *cursor = sentence + 1; cursor < checksum_marker; ++cursor)
        actual_checksum ^= static_cast<uint8_t>(*cursor);

    return actual_checksum == expected_checksum;
}

static bool parse_nmea_uint8_field(const char *sentence, int field_index, uint8_t *value)
{
    if (value == nullptr)
        return false;

    char field[4] = "";
    if (!get_nmea_field(sentence, field_index, field, sizeof(field)) || field[0] == '\0')
        return false;

    unsigned int parsed_value = 0;
    if (sscanf(field, "%u", &parsed_value) != 1 || parsed_value > UINT8_MAX)
        return false;

    for (const char *cursor = field; *cursor != '\0'; ++cursor)
    {
        if (!is_digit_char(*cursor))
            return false;
    }

    *value = static_cast<uint8_t>(parsed_value);
    return true;
}

static void publish_nmea_gsv_satellite_count(uint32_t now_ms)
{
#if MQTT_ENABLED
    bool has_constellation_specific_group = false;
    bool has_reportable_group = false;
    for (const nmea_gsv_group_t &group : s_nmea_gsv_groups)
    {
        if (!group.published || (now_ms - group.last_updated_ms) > NMEA_GSV_GROUP_EXPIRY_MS)
            continue;

        has_reportable_group = true;
        if (strcmp(group.talker, "GN") != 0)
        {
            has_constellation_specific_group = true;
            break;
        }
    }

    if (!has_reportable_group)
        return;

    uint16_t total_satellites = 0;
    for (const nmea_gsv_group_t &group : s_nmea_gsv_groups)
    {
        if (group.published && (now_ms - group.last_updated_ms) <= NMEA_GSV_GROUP_EXPIRY_MS &&
            (!has_constellation_specific_group || strcmp(group.talker, "GN") != 0))
            total_satellites += group.satellites_in_view;
    }
    mqtt_note_satellite_count(static_cast<uint8_t>(std::min<uint16_t>(total_satellites, UINT8_MAX)));
#else
    (void)now_ms;
#endif
}

static void expire_nmea_gsv_groups(uint32_t now_ms)
{
    bool group_expired = false;
    for (nmea_gsv_group_t &group : s_nmea_gsv_groups)
    {
        if (group.talker[0] != '\0' && (now_ms - group.last_updated_ms) > NMEA_GSV_GROUP_EXPIRY_MS)
        {
            group = nmea_gsv_group_t{};
            group_expired = true;
        }
    }

    if (group_expired)
        publish_nmea_gsv_satellite_count(now_ms);
}

static void process_nmea_gsv_sentence(const char *sentence)
{
    if (!is_nmea_checksum_valid(sentence))
        return;

    char sentence_type[16] = "";
    if (!get_nmea_field(sentence, 0, sentence_type, sizeof(sentence_type)) || strlen(sentence_type) != 5 ||
        strcmp(sentence_type + 2, "GSV") != 0)
        return;

    uint8_t message_count = 0;
    uint8_t message_number = 0;
    uint8_t satellites_in_view = 0;
    if (!parse_nmea_uint8_field(sentence, 1, &message_count) ||
        !parse_nmea_uint8_field(sentence, 2, &message_number) ||
        !parse_nmea_uint8_field(sentence, 3, &satellites_in_view) ||
        message_count == 0 || message_number == 0 || message_number > message_count)
        return;

    const uint16_t satellite_offset = static_cast<uint16_t>(message_number - 1) * 4U;
    const uint8_t satellites_in_message = satellites_in_view > satellite_offset
                                              ? std::min<uint8_t>(4, static_cast<uint8_t>(satellites_in_view - satellite_offset))
                                              : 0;
    char signal_id[4] = "";
    (void)get_nmea_field(sentence, 4 + satellites_in_message * 4, signal_id, sizeof(signal_id));

    const uint32_t now_ms = millis();
    expire_nmea_gsv_groups(now_ms);

    nmea_gsv_group_t *group = nullptr;
    nmea_gsv_group_t *available_group = nullptr;
    for (nmea_gsv_group_t &candidate : s_nmea_gsv_groups)
    {
        if (candidate.talker[0] == '\0')
        {
            available_group = &candidate;
            continue;
        }
        if (strncmp(candidate.talker, sentence_type, 2) == 0 && strcmp(candidate.signal_id, signal_id) == 0)
        {
            group = &candidate;
            break;
        }
    }

    if (group == nullptr && available_group != nullptr)
    {
        group = available_group;
        snprintf(group->talker, sizeof(group->talker), "%.2s", sentence_type);
        snprintf(group->signal_id, sizeof(group->signal_id), "%s", signal_id);
    }

    if (group == nullptr || (message_number != 1 && (group->message_count != message_count || group->next_message_number != message_number)))
        return;

    group->message_count = message_count;
    group->next_message_number = static_cast<uint8_t>(message_number + 1);
    group->satellites_in_view = satellites_in_view;
    group->last_updated_ms = now_ms;
    group->published = message_number == message_count;

    if (group->published)
        publish_nmea_gsv_satellite_count(now_ms);
}
#endif

