roblatour/ESP32TimeServer/main/main.cpp
static bool wait_for_nmea_rmc_time(nmea_rmc_time_t *time_data, uint32_t timeout_ms)
{
    if (time_data == nullptr)
        return false;

    uint32_t start_ms = millis();
    char sentence[128] = "";
    size_t index = 0;
    bool collecting = false;

    while ((millis() - start_ms) < timeout_ms)
    {
        while (s_gnss_serial.available() > 0)
        {
            int value = s_gnss_serial.read();
            if (value < 0)
                break;

            char ch = static_cast<char>(value);
            if (ch == '$')
            {
                collecting = true;
                index = 0;
                sentence[index++] = ch;
                continue;
            }

            if (!collecting)
                continue;

            if (ch == '\r' || ch == '\n')
            {
                sentence[index] = '\0';
#if UBLOX_COMPLIANT_GNSS_RECEIVER_ENABLED
#else
                process_nmea_gsv_sentence(sentence);
#endif
                if (parse_nmea_rmc_sentence(sentence, time_data))
                    return true;

                collecting = false;
                index = 0;
                continue;
            }

            if (ch >= 32 && ch <= 126)
            {
                if (index < sizeof(sentence) - 1)
                {
                    sentence[index++] = ch;
                }
                else
                {
                    collecting = false;
                    index = 0;
                }
            }
        }

        vTaskDelay(pdMS_TO_TICKS(20));
    }

    return false;
}

struct gnss_probe_result_t
{
    bool saw_data = false;
    size_t bytes_seen = 0;
    char sample[33] = "";
};

static bool current_gnss_timing_is_valid()
{
    if (s_use_nmea_fallback)
    {
        nmea_rmc_time_t nmea_time{};
        return wait_for_nmea_rmc_time(&nmea_time, 1200UL);
    }

    // Get the latest Position/Velocity/Time solution and fill all global variables
    static constexpr uint16_t status_query_timeout_ms = 1500;
    if (!s_gnss.getPVT(status_query_timeout_ms))
    {
#if DEBUG_ENABLED
        ESP_LOGE(TAG, "getPVT failed");
#endif
        return false;
    };

    uint8_t fix_type = s_gnss.getFixType(status_query_timeout_ms); // 0 - No fix; 1 - Dead reckoning only; 2 - 2D-fix; 3: 3D-fix; 4 - GNSS + dead reckoning combined; 5 - Time only fix
#if MQTT_ENABLED
    uint8_t satellites = s_gnss.getSIV(status_query_timeout_ms);
    mqtt_note_satellite_count(satellites);
#endif
    bool gnss_fix_ok = s_gnss.getGnssFixOk(status_query_timeout_ms);
    bool date_valid = s_gnss.getDateValid(status_query_timeout_ms);
    bool time_valid = s_gnss.getTimeValid(status_query_timeout_ms);

#if DEBUG_ENABLED

    if (fix_type < 3)
        ESP_LOGW(TAG, "GNSS fix type - %s", fix_type == 0 ? "No fix" : fix_type == 1 ? "Dead reckoning only"
                                                                                     : "2D-fix");

    if (!gnss_fix_ok)
        ESP_LOGW(TAG, "GNSS fix is not ok");

    if (!date_valid)
        ESP_LOGW(TAG, "GNSS date is invalid");

    if (!time_valid)
        ESP_LOGW(TAG, "GNSS time is invalid");

#endif

    return (fix_type > 2) && gnss_fix_ok && date_valid && time_valid;
}

static gnss_probe_result_t probe_gnss_uart(uint32_t baud);

static gnss_probe_result_t probe_gnss_uart(uint32_t baud)
{
    static constexpr uint16_t gnssProbeListenTimeMs = 1500;
    gnss_probe_result_t result{};
    size_t sample_len = 0;

    s_gnss_serial.end();
    s_gnss_serial.begin(baud, SERIAL_8N1, RXPin, TXPin);
    vTaskDelay(pdMS_TO_TICKS(150));

    uint32_t start_ms = millis();
    while ((millis() - start_ms) < gnssProbeListenTimeMs)
    {
        while (s_gnss_serial.available() > 0)
        {
            int value = s_gnss_serial.read();
            if (value < 0)
                break;

            result.saw_data = true;
            result.bytes_seen++;

            if (sample_len < (sizeof(result.sample) - 1))
            {
                char character = static_cast<char>(value);
                if (character >= 32 && character <= 126)
                {
                    result.sample[sample_len++] = character;
                }
                else if (character == '\r' || character == '\n' || character == '\t')
                {
                    result.sample[sample_len++] = ' ';
                }
                else
                {
                    result.sample[sample_len++] = '.';
                }
                result.sample[sample_len] = '\0';
            }
        }
        vTaskDelay(pdMS_TO_TICKS(10));
    }

    return result;
}

static bool try_gnss_begin(uint32_t baud, bool assume_success, bool *saw_serial_data)
{

    static constexpr uint16_t gnssBeginMaxWaitMs = 2500;

    gnss_probe_result_t probe_result = probe_gnss_uart(baud);
    if (probe_result.saw_data && saw_serial_data != nullptr)
        *saw_serial_data = true;

#if DEBUG_ENABLED
    ESP_LOGI(TAG,
             "GNSS probe at %lu baud: %u bytes seen, sample: %s",
             static_cast<unsigned long>(baud),
             static_cast<unsigned int>(probe_result.bytes_seen),
             probe_result.saw_data ? probe_result.sample : "<none>");
#endif

    s_gnss_serial.end();
    s_gnss_serial.begin(baud, SERIAL_8N1, RXPin, TXPin);
    vTaskDelay(pdMS_TO_TICKS(150));

    bool begin_result = s_gnss.begin(s_gnss_serial, gnssBeginMaxWaitMs, assume_success);
#if DEBUG_ENABLED
    ESP_LOGI(TAG,
             "GNSS begin at %lu baud with assume_success=%s -> %s",
             static_cast<unsigned long>(baud),
             assume_success ? "true" : "false",
             begin_result ? "success" : "failed");
#endif

    return begin_result;
}

static bool confirm_saved_gnss_baud_rate(uint32_t baud)
{
    bool saw_serial_data = false;

    s_detected_gnss_baud = 0;
    s_gnss_required_assume_success = false;

    for (int attempt = 0; attempt < 2; ++attempt)
    {
        bool begin_without_assume = try_gnss_begin(baud, false, &saw_serial_data);
        bool begin_with_assume = false;
        if (!begin_without_assume)
            begin_with_assume = try_gnss_begin(baud, true, &saw_serial_data);

        if (begin_without_assume || begin_with_assume)
        {
            s_detected_gnss_baud = baud;
            s_gnss_required_assume_success = begin_with_assume;
            return true;
        }
    }

