roblatour/ESP32TimeServer/main/main.cpp
    return false;
}

static bool set_gnss_baud_rate(uint32_t gnss_baud, int max_attempts, uint32_t initial_probe_baud = 0)
{

    std::vector<uint32_t> candidate_baud_rates;
    uint32_t preferred_probe_baud = initial_probe_baud > 0 ? initial_probe_baud : gnss_baud;
    build_candidate_baud_rates(candidate_baud_rates, preferred_probe_baud);

    bool saw_any_serial_data = false;
    s_detected_gnss_baud = 0;
    s_gnss_required_assume_success = false;

    char baud_line[lcdColumns + 1];

    for (int attempt = 0; attempt < max_attempts; ++attempt)
    {
#if DEBUG_ENABLED
        ESP_LOGI(TAG, "GNSS initialization attempt %d of %d", attempt + 1, max_attempts);
#endif

        for (uint32_t candidate_baud : candidate_baud_rates)
        {

            char dots[10] = "";
            for (int i = 0; i < (attempt % 4); i++)
                strcat(dots, ".");

            snprintf(baud_line, sizeof(baud_line), "Baud: %lu %s", static_cast<unsigned long>(candidate_baud), dots);
            display_line(2, baud_line);

            bool begin_without_assume = try_gnss_begin(candidate_baud, false, &saw_any_serial_data);
            bool begin_with_assume = false;
            if (!begin_without_assume)
                begin_with_assume = try_gnss_begin(candidate_baud, true, &saw_any_serial_data);

            if (begin_without_assume || begin_with_assume)
            {
                s_detected_gnss_baud = candidate_baud;
                s_gnss_required_assume_success = begin_with_assume;

                if (candidate_baud != gnss_baud)
                {
#if DEBUG_ENABLED
                    ESP_LOGI(TAG,
                             "GNSS responded at %lu baud. Attempting to switch to %lu baud.",
                             static_cast<unsigned long>(candidate_baud),
                             static_cast<unsigned long>(gnss_baud));
#endif

                    bool baud_change_command_reported_success = s_gnss.setSerialRate(gnss_baud);

#if DEBUG_ENABLED
                    if (!baud_change_command_reported_success)
                        ESP_LOGW(TAG, "GNSS baud-rate change command to %lu was not acknowledged. Probing the target baud anyway.", static_cast<unsigned long>(gnss_baud));
#endif

                    vTaskDelay(pdMS_TO_TICKS(200));

                    bool reconnect_without_assume = try_gnss_begin(gnss_baud, false, &saw_any_serial_data);
                    bool reconnect_with_assume = false;
                    if (!reconnect_without_assume)
                        reconnect_with_assume = try_gnss_begin(gnss_baud, true, &saw_any_serial_data);

                    if (reconnect_without_assume || reconnect_with_assume)
                    {
                        s_detected_gnss_baud = gnss_baud;
                        s_gnss_required_assume_success = reconnect_with_assume;

#if DEBUG_ENABLED
                        if (!baud_change_command_reported_success)
                            ESP_LOGW(TAG, "GNSS baud-rate change command to %lu reported failure, but reconnect succeeded at the new baud.", static_cast<unsigned long>(gnss_baud));
#endif
                    }
                    else
                    {
                        bool old_baud_without_assume = try_gnss_begin(candidate_baud, false, &saw_any_serial_data);
                        bool old_baud_with_assume = false;
                        if (!old_baud_without_assume)
                            old_baud_with_assume = try_gnss_begin(candidate_baud, true, &saw_any_serial_data);

                        if (old_baud_without_assume || old_baud_with_assume)
                        {
                            s_detected_gnss_baud = candidate_baud;
                            s_gnss_required_assume_success = old_baud_with_assume;

                            if (baud_change_command_reported_success && rebootIfGNSSBaudChangeCommandSucceedsButImmediateReconnectFails)
                            {
#if DEBUG_ENABLED
                                ESP_LOGW(TAG, "GNSS baud-rate change command to %lu was acknowledged, but immediate reconnect failed. Rebooting to complete transition.", static_cast<unsigned long>(gnss_baud));
#endif
                                display_line(1, "GNSS baud changed");
                                display_line(2, "Rebooting...");
                                vTaskDelay(pdMS_TO_TICKS(1000));
#if MQTT_ENABLED
                                mqtt_publish_final_report();
#endif
                                esp_restart();
                            }

#if DEBUG_ENABLED
                            ESP_LOGW(TAG, "GNSS baud-rate change to %lu did not take effect immediately. Continuing at detected baud %lu.", static_cast<unsigned long>(gnss_baud), static_cast<unsigned long>(candidate_baud));
#endif
                        }
                        else
                        {
#if DEBUG_ENABLED
                            ESP_LOGW(TAG, "GNSS baud-rate change attempt left module unreachable at both %lu and %lu. Continuing with best-known state.", static_cast<unsigned long>(candidate_baud), static_cast<unsigned long>(gnss_baud));
#endif
                        }
                    }
                }

#if DEBUG_ENABLED
                if (s_gnss_required_assume_success)
                {
                    ESP_LOGW(TAG,
                             "GNSS communication was established only with assume_success=true at %lu baud. The attached module may have limited u-blox compatibility.",
                             static_cast<unsigned long>(s_detected_gnss_baud));
                };

                ESP_LOGI(TAG, "GNSS initialization will continue at %lu baud.", static_cast<unsigned long>(s_detected_gnss_baud));
#endif
                return true;
            }
        }

        vTaskDelay(pdMS_TO_TICKS(2000));
    }

#if DEBUG_ENABLED
    if (saw_any_serial_data)
        ESP_LOGW(TAG, "GNSS serial data was detected, but SparkFun u-blox GNSS v3 could not initialize the module. The module may be an older NEO-6/7/M8 variant.");
    else
        ESP_LOGW(TAG, "No GNSS serial data was detected on GPIO%d/GPIO%d at any tested baud rate. Check power, TX/RX wiring, and signal levels.", RXPin, TXPin);
#endif

