roblatour/ESP32TimeServer/main/main.cpp
    return false;
}

static bool configure_gnss_outputs(bool *uart1_output_set_result)
{
#if UBLOX_COMPLIANT_GNSS_RECEIVER_ENABLED
    bool i2c_output_disabled = s_gnss.setI2COutput(0);
    bool uart2_output_disabled = s_gnss.setUART2Output(0);
#else
    bool i2c_output_disabled = true;
    bool uart2_output_disabled = true;
#endif

    bool uart1_output_set = s_gnss.setUART1Output(COM_TYPE_UBX | COM_TYPE_NMEA);

    if (uart1_output_set_result != nullptr)
        *uart1_output_set_result = uart1_output_set;

#if DEBUG_ENABLED
    ESP_LOGI(TAG,
             "GNSS port config results: I2C off=%s, UART1 UBX=%s, UART2 off=%s",
             i2c_output_disabled ? "ok" : "failed",
             uart1_output_set ? "ok" : "failed",
             uart2_output_disabled ? "ok" : "failed");

    if (!uart2_output_disabled)
        ESP_LOGI(TAG, "UART2 output disable is not supported by this module/firmware. Continuing with UART1 configuration.");

    if (!i2c_output_disabled)
        ESP_LOGI(TAG, "I2C output disable did not succeed. This is non-fatal for UART1 operation.");

#endif

    return uart1_output_set;
}

/* pre-release code - commented out

static bool configure_gnss_time_only_uart1_output()
{
    if (!reduceGNSSUART1OutputToTimeMessages)
        return true;

    uint8_t layer = saveReducedGNSSUART1OutputPermanently ? VAL_LAYER_ALL : VAL_LAYER_RAM_BBR;
    auto set_message_rate = [layer](uint32_t key, uint8_t rate, const char *message_name)
    {
        bool command_worked = s_gnss.setVal8(key, rate, layer);
#if DEBUG_ENABLED
        ESP_LOGI(TAG, "GNSS UART1 %s: %s", message_name, command_worked ? "ok" : "failed");
#endif
        return command_worked;
    };

    bool configured = true;
    configured = set_message_rate(UBLOX_CFG_MSGOUT_NMEA_ID_RMC_UART1, 1, "RMC enabled") && configured;
    configured = set_message_rate(UBLOX_CFG_MSGOUT_NMEA_ID_GGA_UART1, 0, "GGA disabled") && configured;
    configured = set_message_rate(UBLOX_CFG_MSGOUT_NMEA_ID_GLL_UART1, 0, "GLL disabled") && configured;
    configured = set_message_rate(UBLOX_CFG_MSGOUT_NMEA_ID_GSA_UART1, 0, "GSA disabled") && configured;
    configured = set_message_rate(UBLOX_CFG_MSGOUT_NMEA_ID_GSV_UART1, 0, "GSV disabled") && configured;
    configured = set_message_rate(UBLOX_CFG_MSGOUT_NMEA_ID_VTG_UART1, 0, "VTG disabled") && configured;

#if DEBUG_ENABLED
    ESP_LOGI(TAG,
             "GNSS time-only UART1 message configuration: %s (%s)",
             configured ? "ok" : "partially applied; continuing with available output",
             saveReducedGNSSUART1OutputPermanently ? "saved to receiver flash" : "RAM/BBR only");
#endif

    return configured;
}

end of pre-release code */

static void halt_with_display(const char *line1, const char *line2, const char *line3)
{
    display_line(1, line1);
    display_line(2, line2);
    display_line(3, line3);
    while (true)
        vTaskDelay(pdMS_TO_TICKS(1000));
}

static bool IRAM_ATTR pps_capture_callback(mcpwm_cap_channel_handle_t,
                                           const mcpwm_capture_event_data_t *,
                                           void *)
{
    PpsCaptureEvent event{};
    event.approximate_edge_us = esp_timer_get_time();

    BaseType_t higher_priority_task_woken = pdFALSE;
    if (s_pps_semaphore != nullptr)
        xSemaphoreGiveFromISR(s_pps_semaphore, &higher_priority_task_woken);
    if (s_pps_timestamp_queue != nullptr)
        xQueueOverwriteFromISR(s_pps_timestamp_queue, &event, &higher_priority_task_woken);
    if (s_pps_sync_timestamp_queue != nullptr)
        xQueueOverwriteFromISR(s_pps_sync_timestamp_queue, &event, &higher_priority_task_woken);
    return higher_priority_task_woken == pdTRUE;
}

static void setup_pps_input()
{
    mcpwm_capture_timer_config_t timer_config{};
    timer_config.group_id = 0;
    timer_config.clk_src = MCPWM_CAPTURE_CLK_SRC_DEFAULT;
    timer_config.resolution_hz = PPS_CAPTURE_RESOLUTION_HZ;
    ESP_ERROR_CHECK(mcpwm_new_capture_timer(&timer_config, &s_pps_capture_timer));

    mcpwm_capture_channel_config_t channel_config{};
    channel_config.gpio_num = PPSPin;
    channel_config.prescale = 1;
    channel_config.flags.pos_edge = true;
    ESP_ERROR_CHECK(mcpwm_new_capture_channel(s_pps_capture_timer, &channel_config, &s_pps_capture_channel));

    mcpwm_capture_event_callbacks_t callbacks{};
    callbacks.on_cap = pps_capture_callback;
    ESP_ERROR_CHECK(mcpwm_capture_channel_register_event_callbacks(s_pps_capture_channel, &callbacks, nullptr));
    ESP_ERROR_CHECK(mcpwm_capture_channel_enable(s_pps_capture_channel));
    ESP_ERROR_CHECK(mcpwm_capture_timer_enable(s_pps_capture_timer));
    ESP_ERROR_CHECK(mcpwm_capture_timer_start(s_pps_capture_timer));
}

static void clear_pps_events() // to do
{
    while (xSemaphoreTake(s_pps_semaphore, 0) == pdTRUE)
    {
    }

    PpsCaptureEvent event{};
    while (xQueueReceive(s_pps_sync_timestamp_queue, &event, 0) == pdTRUE)
    {
    }
}

static bool wait_for_pps_capture_event(PpsCaptureEvent *event, TickType_t timeout)
{
    return xQueueReceive(s_pps_sync_timestamp_queue, event, timeout) == pdTRUE;
}

static void finish_ntp_request_rate_second()
{
#if MQTT_ENABLED
    const uint32_t requests_this_second = s_ntp_requests_this_second.exchange(0, std::memory_order_relaxed);
    uint32_t most_requests_per_second = s_ntp_most_requests_per_second.load(std::memory_order_relaxed);
    while (most_requests_per_second < requests_this_second &&
           !s_ntp_most_requests_per_second.compare_exchange_weak(most_requests_per_second, requests_this_second,
                                                                 std::memory_order_relaxed, std::memory_order_relaxed))
    {
    }
#endif
}

static void pps_discipline_task(void *parameter)
{
    static constexpr int64_t ppsTimeoutUs = 3500000;
    static constexpr int64_t maxPhaseErrorUsToCorrect = 250000;
    static constexpr int64_t minCorrectionMagnitudeUs = 2;

    int64_t last_pps_us = esp_timer_get_time();
    bool logged_active = false;

    for (;;)
    {
        PpsCaptureEvent capture_event{};
        if (xQueueReceive(s_pps_timestamp_queue, &capture_event, pdMS_TO_TICKS(1000)) == pdTRUE)
        {
            int64_t edge_us = capture_event.approximate_edge_us;
            last_pps_us = edge_us;
            s_pps_discipline_active.store(true);
#if MQTT_ENABLED
            s_pps_pulses.fetch_add(1);
#endif
            sync_state_note_pps_edge(edge_us);
            finish_ntp_request_rate_second();

            if (!logged_active)
            {
#if DEBUG_ENABLED
                ESP_LOGI(TAG, "PPS discipline active.");
#endif
                logged_active = true;
            }

