roblatour/ESP32TimeServer/main/main.cpp
            if (!s_time_has_been_set.load() || s_time_setting_in_progress.load())
                continue;

            if (xSemaphoreTake(s_time_mutex, pdMS_TO_TICKS(20)) != pdTRUE)
                continue;

            int64_t processing_now_us = esp_timer_get_time();
            struct timeval now{};
            gettimeofday(&now, nullptr);

            int64_t current_time_us = static_cast<int64_t>(now.tv_sec) * 1000000LL + static_cast<int64_t>(now.tv_usec);
            int64_t wake_delay_us = processing_now_us - edge_us;
            if (wake_delay_us < 0)
                wake_delay_us = 0;
            int64_t edge_time_us = current_time_us - wake_delay_us;

            int64_t phase_error_us = edge_time_us % 1000000LL;
            if (phase_error_us > 500000)
                phase_error_us -= 1000000;
            else if (phase_error_us < -500000)
                phase_error_us += 1000000;

            int64_t correction_us = -phase_error_us;
            if (llabs(correction_us) >= minCorrectionMagnitudeUs && llabs(phase_error_us) <= maxPhaseErrorUsToCorrect)
            {
                struct timeval delta{};
                delta.tv_sec = static_cast<time_t>(correction_us / 1000000LL);
                delta.tv_usec = static_cast<suseconds_t>(correction_us % 1000000LL);
                if (delta.tv_usec < 0)
                {
                    delta.tv_usec += 1000000;
                    delta.tv_sec -= 1;
                }

                if (adjtime(&delta, nullptr) == 0)
                {
                    synchronize_hardware_clock();
                    s_ntp_reference_time_64 = get_current_time_in_ntp64_format();
                    s_ntp_reference_valid = true;
                }
            }

            xSemaphoreGive(s_time_mutex);
        }
        else
        {
            int64_t now_us = esp_timer_get_time();
            if ((now_us - last_pps_us) > ppsTimeoutUs)
            {
                if (logged_active && DEBUG_ENABLED)
                    ESP_LOGW(TAG, "PPS discipline inactive (PPS signal unavailable).");
                logged_active = false;
                s_pps_discipline_active.store(false);
                sync_state_note_pps_timeout(now_us);
            }
        }

#if CALCULATE_PPS_DISCIPLINE_TASK_STACK_SIZE_ENABLED
        report_current_task_stack_usage(PPS_Discipline);
#endif
    }
}

static bool wait_for_gnss_startup_qualification()
{
    int64_t valid_started_us = 0;
    int64_t last_pps_us = 0;
    uint32_t stable_pps_edges = 0;

    clear_pps_events();

#if DEBUG_ENABLED
    ESP_LOGI(TAG, "Qualifying GNSS and PPS stability before startup.");
#endif

    for (;;)
    {
        int64_t now_us = esp_timer_get_time();
        if (!current_gnss_timing_is_valid())
        {
            valid_started_us = 0;
            last_pps_us = 0;
            stable_pps_edges = 0;
            clear_pps_events();
            vTaskDelay(pdMS_TO_TICKS(250));
            continue;
        }

        if (valid_started_us == 0)
        {
            valid_started_us = now_us;
            display_line(1, "GNSS Time Valid");
            display_line(2, "Qualifying PPS");
        }

        if (xSemaphoreTake(s_pps_semaphore, 0) == pdTRUE)
        {
            now_us = esp_timer_get_time();
            if (last_pps_us == 0 ||
                ((now_us - last_pps_us) >= gnss_Startup_Min_PPS_Interval_Us &&
                 (now_us - last_pps_us) <= gnss_Startup_Max_PPS_Interval_Us))
            {
                stable_pps_edges++;
            }
            else
            {
                stable_pps_edges = 1;
            }
            last_pps_us = now_us;

            uint32_t displayed_pps_edges = std::min(stable_pps_edges, gnss_Startup_Qualification_PPS_Edges);
            char pps_edges_line[lcdColumns + 1];
            snprintf(pps_edges_line,
                     sizeof(pps_edges_line),
                     "Edges %lu of %lu",
                     static_cast<unsigned long>(displayed_pps_edges),
                     static_cast<unsigned long>(gnss_Startup_Qualification_PPS_Edges));
            display_line(1, "PPS Stabilizing");
            display_line(2, pps_edges_line);
        }

        if ((now_us - valid_started_us) >= static_cast<int64_t>(gnss_Startup_Qualification_Duration_Ms) * 1000LL &&
            stable_pps_edges >= gnss_Startup_Qualification_PPS_Edges)
        {
#if DEBUG_ENABLED
            ESP_LOGI(TAG, "GNSS and PPS startup qualification complete after %lu stable PPS edges.",
                     static_cast<unsigned long>(stable_pps_edges));
#endif
            return true;
        }

        vTaskDelay(pdMS_TO_TICKS(100));
    }
}

static void setup_gnss()
{

#if UBLOX_COMPLIANT_GNSS_RECEIVER_ENABLED
    static constexpr int maxAttemptsToInitializeGNSS = 10;
    gnss_nvs_data_t stored_gnss_data{};
    bool gnss_nvs_load_ok = load_gnss_nvs_data(&stored_gnss_data);
    bool first_time_initial_setup = !stored_gnss_data.has_id_type;
    uint32_t highest_candidate_baud = get_highest_candidate_gnss_baud();
#else
    bool first_time_initial_setup = false;
    uint32_t highest_candidate_baud = baudRateForUbloxNonCompliantGNSSReceiver;
#endif

#if DEBUG_ENABLED
    ESP_LOGI(TAG, "Startup mode: %s", first_time_initial_setup ? "First time initial setup" : "Not first time initial setup");
#endif

    uint32_t startup_target_baud = highest_candidate_baud;

#if UBLOX_COMPLIANT_GNSS_RECEIVER_ENABLED
    if (gnss_nvs_load_ok && stored_gnss_data.has_id_type && stored_gnss_data.max_baud > 0)
        startup_target_baud = stored_gnss_data.max_baud;

    bool known_module_fast_path = gnss_nvs_load_ok && stored_gnss_data.has_id_type && stored_gnss_data.max_baud > 0;
#else
    bool known_module_fast_path = false;
#endif

#if DEBUG_ENABLED
    ESP_LOGI(TAG,
             "GNSS startup path: %s (target baud=%lu)",
             known_module_fast_path ? "known module fast path" : "first-time scan path",
             static_cast<unsigned long>(startup_target_baud));
#endif

#if UBLOX_COMPLIANT_GNSS_RECEIVER_ENABLED

    bool gnss_communication_confirmed = false;
    if (known_module_fast_path)
    {
        s_gnss_target_baud = startup_target_baud;
        gnss_communication_confirmed = confirm_saved_gnss_baud_rate(s_gnss_target_baud);
#if DEBUG_ENABLED
        if (!gnss_communication_confirmed)
            ESP_LOGW(TAG, "Saved GNSS baud %lu did not confirm communication; starting automatic recovery scan.", static_cast<unsigned long>(s_gnss_target_baud));
#endif
    }

    if (!gnss_communication_confirmed)
    {
        s_gnss_target_baud = highest_candidate_baud;
        uint32_t initial_probe_baud = first_time_initial_setup ? 9600 : s_gnss_target_baud;
        if (!set_gnss_baud_rate(s_gnss_target_baud, maxAttemptsToInitializeGNSS, initial_probe_baud))
        {
#if DEBUG_ENABLED
            ESP_LOGE(TAG, "GNSS comms failed - check TX/RX + power");
#endif
            halt_with_display("GNSS comms failed", "Check TX/RX + power", "See serial log");
        }
    }

