roblatour/ESP32TimeServer/main/main.cpp
    gnss_identity_t current_identity = query_gnss_identity();
    bool should_retry_as_first_time = gnss_nvs_load_ok && stored_gnss_data.has_id_type;
    if (should_retry_as_first_time)
    {
        bool same_gnss_module = gnss_identity_matches(stored_gnss_data, current_identity);
        if (!same_gnss_module && startup_target_baud != highest_candidate_baud)
        {
            s_gnss_target_baud = highest_candidate_baud;
            if (!set_gnss_baud_rate(s_gnss_target_baud, maxAttemptsToInitializeGNSS, s_gnss_target_baud))
            {
                ESP_LOGE(TAG, "GNSS comms failed after module mismatch fallback");
                halt_with_display("GNSS comms failed", "Check TX/RX + power", "See serial log");
            }
            current_identity = query_gnss_identity();
        }
    }

    s_gnss_is_max_m10s = strstr(current_identity.value, "MAX-M10S") != nullptr;

#else

    s_gnss_target_baud = highest_candidate_baud;
    s_detected_gnss_baud = highest_candidate_baud;
    s_gnss_is_max_m10s = false;
    s_gnss_required_assume_success = false;
    s_use_nmea_fallback = true;
    uint32_t baud = highest_candidate_baud;
    static constexpr uint16_t gnssBeginMaxWaitMs = 2500;
    bool assume_success = false;

    s_gnss_serial.end();
    s_gnss_serial.begin(baud, SERIAL_8N1, RXPin, TXPin);
    vTaskDelay(pdMS_TO_TICKS(150));

    bool begin_result = s_gnss.begin(s_gnss_serial, gnssBeginMaxWaitMs, assume_success);
#if DEBUG_ENABLED
    ESP_LOGI(TAG,
             "GNSS begin at %lu baud with assume_success=%s -> %s",
             static_cast<unsigned long>(baud),
             assume_success ? "true" : "false",
             begin_result ? "success" : "failed");
#endif

#endif

#if DEBUG_ENABLED
    ESP_LOGI(TAG, "GNSS module profile: %s", s_gnss_is_max_m10s ? "MAX-M10S" : "generic/fallback");

    ESP_LOGI(TAG, "GNSS startup mode: baud=%lu, initialization=%s",
             static_cast<unsigned long>(s_detected_gnss_baud),
             s_gnss_required_assume_success ? "assume_success" : "confirmed");
#endif

#if UBLOX_COMPLIANT_GNSS_RECEIVER_ENABLED
    if (s_detected_gnss_baud > 0)
    {
        bool save_ok = save_gnss_nvs_data(current_identity, s_detected_gnss_baud);
#if DEBUG_ENABLED
        ESP_LOGI(TAG,
                 "GNSS identity persistence: type=%s, value=%s, max_baud=%lu, save=%s",
                 current_identity.type,
                 current_identity.value,
                 static_cast<unsigned long>(s_detected_gnss_baud),
                 save_ok ? "ok" : "failed");
#endif
    }

#endif

    bool uart1_output_set = false;
    configure_gnss_outputs(&uart1_output_set);

    /* pre-release code - commented out
    configure_gnss_time_only_uart1_output();
    end of pre-release code */
#if DEBUG_ENABLED
    if (!uart1_output_set)
        ESP_LOGW(TAG, "GNSS UART1 output configuration failed. Continuing with the module's current output settings.");
#endif

#if UBLOX_COMPLIANT_GNSS_RECEIVER_ENABLED
    s_use_nmea_fallback = s_gnss_required_assume_success || !uart1_output_set;
#else
    s_use_nmea_fallback = true;
#endif

    if (s_use_nmea_fallback && !allowFallbackProcessing)
    {
        ESP_LOGE(TAG, "NMEA fallback processing is required but not allowed - check the ESP32TimeServerSetting.h file.");
        halt_with_display("GNSS fallback required", "Fallback not allowed", "Check settings");
    }
#if DEBUG_ENABLED
    if (s_use_nmea_fallback)
        ESP_LOGW(TAG, "NMEA fallback mode enabled for GNSS fix/time acquisition.");
#endif

    display_line(1, "Waiting for GNSS fix");
    display_line(2, "");

    static constexpr uint32_t gnssFixEscalationToNmeaFallbackMs = 120000UL;

    bool nmea_fallback_enabled = s_use_nmea_fallback;
    uint32_t wait_start_ms = millis();
    uint32_t last_status_log_ms = 0;
    uint32_t last_long_wait_warning_ms = 0;

    for (;;)
    {
        uint8_t fix_type = 0;
        bool gnss_fix_ok = false;
        uint8_t satellites_used = 0;
        bool date_valid = false;
        bool time_valid = false;
        bool ubx_fix_ready = false;
        bool nmea_fix_ready = false;

        if (!s_use_nmea_fallback)
        {
            fix_type = s_gnss.getFixType();
            gnss_fix_ok = s_gnss.getGnssFixOk();
            satellites_used = s_gnss.getSIV();
            date_valid = s_gnss.getDateValid();
            time_valid = s_gnss.getTimeValid();
            ubx_fix_ready = (fix_type == 3 || fix_type == 4 || fix_type == 5) && gnss_fix_ok && date_valid && time_valid;

            if ((fix_type == 3 || fix_type == 4) && satellites_used >= 4 && !gnss_fix_ok)
            {
                display_line(1, "3D Fix Detected");
                display_line(2, "Verifying GNSS");
            }
            else if (ubx_fix_ready)
            {
                display_line(1, "GNSS Time Valid");
                display_line(2, "Qualifying PPS");
            }
            else
            {
                char satellites_line[lcdColumns + 1];
                snprintf(satellites_line, sizeof(satellites_line), "Satellites %u of 4", static_cast<unsigned int>(satellites_used));
                display_line(1, "Acquiring GNSS");
                display_line(2, satellites_line);
            }
        }

        uint32_t now_ms = millis();
        if (!ubx_fix_ready && !nmea_fallback_enabled && allowFallbackProcessing && (now_ms - wait_start_ms) >= gnssFixEscalationToNmeaFallbackMs)
        {
            nmea_fallback_enabled = true;
#if DEBUG_ENABLED
            ESP_LOGW(TAG, "No UBX fix after %lu ms. Enabling NMEA fallback for additional acquisition path.", static_cast<unsigned long>(now_ms - wait_start_ms));
#endif
        }

        if (!ubx_fix_ready && nmea_fallback_enabled)
        {
            nmea_rmc_time_t nmea_time{};
            nmea_fix_ready = wait_for_nmea_rmc_time(&nmea_time, 1200UL);
        }

        if (ubx_fix_ready || nmea_fix_ready)
        {
            if (nmea_fix_ready)
                s_use_nmea_fallback = true;

