roblatour/ESP32TimeServer/main/main.cpp
static bool mqtt_publish_report(const char *payload)
{
    if (!s_mqtt_connected.load())
        return false;

    return esp_mqtt_client_publish(s_mqtt_client, s_mqtt_report_topic, payload, 0, MQTT_QOS, MQTTBrokerRetain) >= 0;
}

static std::vector<std::string> mqtt_tf_queue_files()
{
    std::vector<std::string> files;
    DIR *directory = opendir(TF_QUEUE_DIRECTORY);
    if (directory == nullptr)
        return files;

    dirent *entry = nullptr;
    while ((entry = readdir(directory)) != nullptr)
    {
        unsigned long high = 0;
        unsigned long low = 0;
        if (strlen(entry->d_name) == 12 && sscanf(entry->d_name, "R%7lX.%3lX", &high, &low) == 2)
            files.emplace_back(std::string(TF_QUEUE_DIRECTORY) + "/" + entry->d_name);
    }
    closedir(directory);
    std::sort(files.begin(), files.end());
    return files;
}

static void mqtt_tf_refresh_queue_count()
{
    s_mqtt_queued_messages_count.store(mqtt_tf_queue_files().size());
}

static bool mqtt_tf_write_report(const char *payload)
{
    char path[128] = "";
    char temporary_path[128] = "";
    uint64_t sequence = s_tf_queue_next_sequence++;
    unsigned long high = static_cast<unsigned long>(sequence >> 12);
    unsigned long low = static_cast<unsigned long>(sequence & 0xFFF);
    snprintf(path, sizeof(path), "%s/R%07lX.%03lX", TF_QUEUE_DIRECTORY, high, low);
    snprintf(temporary_path, sizeof(temporary_path), "%s/R%07lX.TMP", TF_QUEUE_DIRECTORY, high);
    FILE *file = fopen(temporary_path, "wb");
    if (file == nullptr)
        return false;

    const size_t length = strlen(payload);
    bool written = fwrite(payload, 1, length, file) == length && fflush(file) == 0 && fsync(fileno(file)) == 0;
    fclose(file);
    if (!written || rename(temporary_path, path) != 0)
    {
        unlink(temporary_path);
        return false;
    }
    mqtt_tf_refresh_queue_count();
    return true;
}

static bool mqtt_enqueue_report(const char *payload)
{
    if (MQTT_QOS == 0)
        return false;

    if (s_tf_queue_available.load())
    {
        while (!mqtt_tf_write_report(payload))
        {
            std::vector<std::string> files = mqtt_tf_queue_files();
            if (files.empty() || unlink(files.front().c_str()) != 0)
            {
#if DEBUG_ENABLED
                ESP_LOGE(TAG, "Unable to queue MQTT report on TF card");
#endif
                return false;
            }
            s_mqtt_queued_messages_discarded++;
            mqtt_tf_refresh_queue_count();
        }
        return true;
    }

    if (s_mqtt_queued_messages_count.load() == MQTT_REPORT_QUEUE_DEPTH)
    {
        s_mqtt_report_head = (s_mqtt_report_head + 1) % MQTT_REPORT_QUEUE_DEPTH;
        s_mqtt_queued_messages_count--;
        s_mqtt_queued_messages_discarded++;
    }

    size_t index = (s_mqtt_report_head + s_mqtt_queued_messages_count.load()) % MQTT_REPORT_QUEUE_DEPTH;
    snprintf(s_mqtt_reports[index].payload, sizeof(s_mqtt_reports[index].payload), "%s", payload);
    s_mqtt_queued_messages_count++;
    return true;
}

static bool mqtt_publish_queued_report(const char *payload)
{
    if (MQTT_QOS != 2)
        return mqtt_publish_report(payload);

    s_mqtt_restart_publish_id.store(-1);
    s_mqtt_restart_publish_completed.store(false);
    int message_id = esp_mqtt_client_publish(s_mqtt_client, s_mqtt_report_topic, payload, 0, MQTT_QOS, MQTTBrokerRetain);
    if (message_id < 0)
        return false;

    s_mqtt_restart_publish_id.store(message_id);
    TickType_t wait_started = xTaskGetTickCount();
    while (!s_mqtt_restart_publish_completed.load() && s_mqtt_connected.load() &&
           (xTaskGetTickCount() - wait_started) < pdMS_TO_TICKS(MQTT_RESTART_PUBLISH_TIMEOUT_MS))
        vTaskDelay(pdMS_TO_TICKS(10));
    bool published = s_mqtt_restart_publish_completed.load();
    s_mqtt_restart_publish_id.store(-1);
    return published;
}

static void mqtt_send_queued_messages()
{
    if (MQTT_QOS == 0 || !s_mqtt_connected.load() || s_mqtt_queued_messages_count.load() == 0)
        return;

    if (!s_tf_queue_available.load())
    {
        if (mqtt_publish_queued_report(s_mqtt_reports[s_mqtt_report_head].payload))
        {
#if DEBUG_ENABLED
            ESP_LOGI(TAG, "Published queued message (RAM): %.200s", s_mqtt_reports[s_mqtt_report_head].payload);
#endif
            s_mqtt_report_head = (s_mqtt_report_head + 1) % MQTT_REPORT_QUEUE_DEPTH;
            s_mqtt_queued_messages_count--;
        }
        return;
    }

    std::vector<std::string> files = mqtt_tf_queue_files();
    if (files.empty())
    {
        mqtt_tf_refresh_queue_count();
        return;
    }

    FILE *file = fopen(files.front().c_str(), "rb");
    if (file == nullptr)
        return;
    std::string payload;
    char buffer[512];
    size_t read = 0;
    while ((read = fread(buffer, 1, sizeof(buffer), file)) > 0)
        payload.append(buffer, read);
    bool read_failed = ferror(file) != 0;
    fclose(file);
    if (!read_failed && mqtt_publish_queued_report(payload.c_str()))
    {
#if DEBUG_ENABLED
        ESP_LOGW(TAG, "Published queued message (TF): %.200s", payload.c_str());
#endif
        if (unlink(files.front().c_str()) == 0)
            mqtt_tf_refresh_queue_count();
    }
}

static uint32_t gnss_locked_seconds_this_period()
{
    static int64_t previous_total_us = 0;
    int64_t total_us = s_gnss_locked_total_us.load();
    int64_t lock_started_us = s_gnss_lock_started_us.load();

    if (s_gnss_locked.load() && lock_started_us > 0)
    {
        int64_t now_us = esp_timer_get_time();
        if (now_us > lock_started_us)
            total_us += now_us - lock_started_us;
    }

    int64_t period_us = total_us - previous_total_us;
    previous_total_us = total_us;
    if (period_us <= 0)
        return 0;

    return static_cast<uint32_t>(period_us / 1000000LL);
}

static void mqtt_build_report(char *payload, size_t payload_size)
{
    uint32_t queued_messages = static_cast<uint32_t>(s_mqtt_queued_messages_count.load());
    uint32_t queued_messages_discarded = s_mqtt_queued_messages_discarded;
    s_mqtt_queued_messages_discarded = 0;
    uint32_t most_requests_per_second = s_ntp_most_requests_per_second.exchange(0, std::memory_order_relaxed);

    char publishing_date_and_time[25] = "";
    format_time_to_ISO8601(time(nullptr), publishing_date_and_time, sizeof(publishing_date_and_time));

#if MQTT_HISTORICAL_REPORTING_ENABLED
    char last_synchronized_and_disciplined[25] = "";
    char last_gnss_unsynchronized[25] = "";
    char last_pps_undisciplined[25] = "";
    format_time_to_ISO8601(s_last_synchronized_and_disciplined.load(), last_synchronized_and_disciplined, sizeof(last_synchronized_and_disciplined));
    format_time_to_ISO8601(s_last_gnss_unsynchronized.load(), last_gnss_unsynchronized, sizeof(last_gnss_unsynchronized));
    format_time_to_ISO8601(s_last_pps_undisciplined.load(), last_pps_undisciplined, sizeof(last_pps_undisciplined));
#endif

