roblatour/ESP32TimeServer/main/main.cpp
    if (MQTT_QOS > 0)
    {
        len += snprintf(payload + len, payload_size - len, "\"queued_messages\":{");
        len += snprintf(payload + len, payload_size - len, "\"held\":%lu,", (unsigned long)queued_messages);
        len += snprintf(payload + len, payload_size - len, "\"discarded\":%lu", (unsigned long)queued_messages_discarded);
        len += snprintf(payload + len, payload_size - len, "},");
    };

    len += snprintf(payload + len, payload_size - len, "\"this_period\":{");
    len += snprintf(payload + len, payload_size - len, "\"ethernet_up_secs\":%lld,", (long long)(link_up_us / 1000000LL));
    len += snprintf(payload + len, payload_size - len, "\"pps_pulses\":%lu,", (unsigned long)s_pps_pulses.exchange(0));
    len += snprintf(payload + len, payload_size - len, "\"gnss_locked_secs\":%lu,", (unsigned long)gnss_locked_seconds_this_period());
    len += snprintf(payload + len, payload_size - len, "\"satellites\":{");
    len += snprintf(payload + len, payload_size - len, "\"min\":%u,", (unsigned int)satellite_min);
    len += snprintf(payload + len, payload_size - len, "\"max\":%u", (unsigned int)satellite_max);
    len += snprintf(payload + len, payload_size - len, "},");
    len += snprintf(payload + len, payload_size - len, "\"ntp\":{");
    len += snprintf(payload + len, payload_size - len, "\"requests\":{");
    len += snprintf(payload + len, payload_size - len, "\"valid\":%lu,", (unsigned long)s_ntp_valid_requests.exchange(0));
    len += snprintf(payload + len, payload_size - len, "\"invalid\":%lu,", (unsigned long)s_ntp_invalid_requests.exchange(0));
    len += snprintf(payload + len, payload_size - len, "\"telemetry_dropped\":%lu,", (unsigned long)s_ntp_telemetry_events_dropped.exchange(0));
    len += snprintf(payload + len, payload_size - len, "\"max_per_second\":%lu", (unsigned long)most_requests_per_second);
    len += snprintf(payload + len, payload_size - len, "},");
    len += snprintf(payload + len, payload_size - len, "\"responses\":{");
    len += snprintf(payload + len, payload_size - len, "\"synchronized_and_disciplined\":%lu,", (unsigned long)s_ntp_responses_synchronized_and_disciplined.exchange(0));
    len += snprintf(payload + len, payload_size - len, "\"gnss_unsynchronized\":%lu,", (unsigned long)s_ntp_responses_gnss_unsynchronized.exchange(0));
    len += snprintf(payload + len, payload_size - len, "\"pps_undisciplined\":%lu", (unsigned long)s_ntp_responses_pps_undisciplined.exchange(0));
    len += snprintf(payload + len, payload_size - len, "}");

#if MQTT_CLIENT_REPORTING_ENABLED
    len += snprintf(payload + len, payload_size - len, "},");
    len += snprintf(payload + len, payload_size - len, "\"clients\":[");
    bool first_client = true;
    if (xSemaphoreTake(s_mqtt_stats_mutex, portMAX_DELAY) == pdTRUE)
    {
        std::sort(s_mqtt_clients, s_mqtt_clients + s_mqtt_client_count,
                  [](const mqtt_client_request_t &left, const mqtt_client_request_t &right)
                  {
                      auto address_family_order = [](sa_family_t address_family)
                      {
                          if (address_family == AF_INET)
                              return 0;
                          if (address_family == AF_INET6)
                              return 1;
                          return 2;
                      };
                      int left_order = address_family_order(left.address_family);
                      int right_order = address_family_order(right.address_family);
                      if (left_order != right_order)
                          return left_order < right_order;
                      size_t address_size = left.address_family == AF_INET ? sizeof(struct in_addr) : sizeof(struct in6_addr);
                      return memcmp(left.address, right.address, address_size) < 0;
                  });
        for (size_t index = 0; index < s_mqtt_client_count && len < payload_size; index++)
        {
            struct sockaddr_storage address{};
            address.ss_family = s_mqtt_clients[index].address_family;
            if (address.ss_family == AF_INET)
                memcpy(&reinterpret_cast<struct sockaddr_in *>(&address)->sin_addr, s_mqtt_clients[index].address, sizeof(struct in_addr));
            else if (address.ss_family == AF_INET6)
                memcpy(&reinterpret_cast<struct sockaddr_in6 *>(&address)->sin6_addr, s_mqtt_clients[index].address, sizeof(struct in6_addr));
            else
                continue;

            char address_text[IP_ADDRESS_TEXT_SIZE] = "";
            if (!format_socket_address(address, address_text, sizeof(address_text)))
                continue;
            int written = snprintf(payload + len, payload_size - len,
                                   "%s{\"address\":\"%s\",\"requests\":%lu}",
                                   first_client ? "" : ",", address_text,
                                   static_cast<unsigned long>(s_mqtt_clients[index].requests));
            if (written < 0 || static_cast<size_t>(written) >= payload_size - len)
                break;
            len += static_cast<size_t>(written);
            first_client = false;
        }
        s_mqtt_client_count = 0;
        xSemaphoreGive(s_mqtt_stats_mutex);
    }
    len += snprintf(payload + len, payload_size - len, "],");
    len += snprintf(payload + len, payload_size - len, "\"clients_overflown\":%s", s_mqtt_client_table_overflown.exchange(false) ? "true" : "false");
#else
    len += snprintf(payload + len, payload_size - len, "}");
#endif

#if MQTT_HISTORICAL_REPORTING_ENABLED
    len += snprintf(payload + len, payload_size - len, "},");
    len += snprintf(payload + len, payload_size - len, "\"historical\":{");
    len += snprintf(payload + len, payload_size - len, "\"gnss_receiver_last\":{");
    len += snprintf(payload + len, payload_size - len, "\"synchronized_and_disciplined\":\"%s\",", last_synchronized_and_disciplined);
    len += snprintf(payload + len, payload_size - len, "\"gnss_unsynchronized\":\"%s\",", last_gnss_unsynchronized);
    len += snprintf(payload + len, payload_size - len, "\"pps_undisciplined\":\"%s\"", last_pps_undisciplined);
    len += snprintf(payload + len, payload_size - len, "}");
#endif

    len += snprintf(payload + len, payload_size - len, "}");
    len += snprintf(payload + len, payload_size - len, "}");

