roblatour/ESP32TimeServer/main/main.cpp
#if DEBUG_ENABLED
    ESP_LOGI(TAG, "Published: \n\r%s", payload);
#endif
}

static void mqtt_publish_final_report()
{
    if (!s_mqtt_connected.load())
        return;

    char payload[MQTT_REPORT_SIZE] = "";
    mqtt_build_report(payload, sizeof(payload));

    s_mqtt_restart_publish_id.store(-1);
    s_mqtt_restart_publish_completed.store(false);
    int message_id = esp_mqtt_client_publish(s_mqtt_client, s_mqtt_report_topic, payload, 0, MQTT_QOS, MQTTBrokerRetain);
    if (message_id < 0)
        return;

    s_mqtt_restart_publish_id.store(message_id);
    TickType_t wait_started = xTaskGetTickCount();
    TickType_t wait_timeout = pdMS_TO_TICKS(MQTT_RESTART_PUBLISH_TIMEOUT_MS);
    while (!s_mqtt_restart_publish_completed.load() && (xTaskGetTickCount() - wait_started) < wait_timeout)
        vTaskDelay(pdMS_TO_TICKS(10));

    s_mqtt_restart_publish_id.store(-1);
}

static bool mqtt_publish_or_queue_restart_notification(const char *reason)
{
    char payload[128] = "";
    snprintf(payload, sizeof(payload), "{\"event\":\"controlled_restart\",\"reason\":\"%s\"}", reason);

    bool published = false;
    if (s_mqtt_connected.load())
    {
        s_mqtt_restart_publish_id.store(-1);
        s_mqtt_restart_publish_completed.store(false);
        int message_id = esp_mqtt_client_publish(s_mqtt_client, s_mqtt_report_topic, payload, 0, MQTT_QOS, MQTTBrokerRetain);
        if (message_id >= 0)
        {
            s_mqtt_restart_publish_id.store(message_id);
            TickType_t wait_started = xTaskGetTickCount();
            while (!s_mqtt_restart_publish_completed.load() && s_mqtt_connected.load() &&
                   (xTaskGetTickCount() - wait_started) < pdMS_TO_TICKS(MQTT_RESTART_PUBLISH_TIMEOUT_MS))
                vTaskDelay(pdMS_TO_TICKS(10));
            published = s_mqtt_restart_publish_completed.load();
        }
        s_mqtt_restart_publish_id.store(-1);
    }

    if (published)
        return true;
    if (s_tf_queue_available.load())
        return mqtt_enqueue_report(payload);

    nvs_handle_t handle = 0;
    esp_err_t result = nvs_open(restart_NVS_NAMESPACE, NVS_READWRITE, &handle);
    if (result == ESP_OK)
    {
        result = nvs_set_str(handle, restart_NVS_KEY_PENDING, payload);
        if (result == ESP_OK)
            result = nvs_commit(handle);
        nvs_close(handle);
    }
    return result == ESP_OK;
}

static bool mqtt_publish_pending_restart_notification()
{
    if (!s_mqtt_connected.load())
        return false;

    char payload[512] = "";
    nvs_handle_t handle = 0;
    if (nvs_open(restart_NVS_NAMESPACE, NVS_READWRITE, &handle) != ESP_OK)
        return false;

    size_t payload_size = sizeof(payload);
    esp_err_t result = nvs_get_str(handle, restart_NVS_KEY_PENDING, payload, &payload_size);
    if (result == ESP_ERR_NVS_NOT_FOUND)
    {
        nvs_close(handle);
        return false;
    }
    if (result != ESP_OK)
    {
        nvs_close(handle);
        return false;
    }

    s_mqtt_restart_publish_id.store(-1);
    s_mqtt_restart_publish_completed.store(false);
    int message_id = esp_mqtt_client_publish(s_mqtt_client, s_mqtt_report_topic, payload, 0, MQTT_QOS, MQTTBrokerRetain);
    if (message_id >= 0)
    {
        s_mqtt_restart_publish_id.store(message_id);
        TickType_t wait_started = xTaskGetTickCount();
        while (!s_mqtt_restart_publish_completed.load() && s_mqtt_connected.load() &&
               (xTaskGetTickCount() - wait_started) < pdMS_TO_TICKS(MQTT_RESTART_PUBLISH_TIMEOUT_MS))
            vTaskDelay(pdMS_TO_TICKS(10));
    }
    const bool published = s_mqtt_restart_publish_completed.load();
    s_mqtt_restart_publish_id.store(-1);
    if (published)
    {
        result = nvs_erase_key(handle, restart_NVS_KEY_PENDING);
        if (result == ESP_OK)
            result = nvs_commit(handle);
    }
    nvs_close(handle);
    return published && result == ESP_OK;
}

static void mqtt_service_task(void *parameter)
{
    bool previously_connected = false;
    TickType_t next_report = xTaskGetTickCount() + pdMS_TO_TICKS(MQTTReportingPeriod * 1000UL);
    for (;;)
    {
        struct sockaddr_storage source_address{};
        for (size_t count = 0; count < MQTT_NTP_EVENT_BATCH_LIMIT &&
                               xQueueReceive(s_mqtt_ntp_event_queue, &source_address, 0) == pdTRUE;
             ++count)
            mqtt_note_ntp_request(source_address);

        bool connected = s_mqtt_connected.load();
        if (connected && !previously_connected)
            esp_mqtt_client_publish(s_mqtt_client, s_mqtt_status_topic, "online", 0, MQTT_QOS, 1);
        previously_connected = connected;

        if (connected)
            mqtt_publish_pending_restart_notification();

        if (connected && s_mqtt_queued_messages_count.load() > 0)
            mqtt_send_queued_messages();

        if (xTaskGetTickCount() >= next_report)
        {
            mqtt_build_report(s_mqtt_payload, sizeof(s_mqtt_payload));
            if (!mqtt_publish_report(s_mqtt_payload))
                mqtt_enqueue_report(s_mqtt_payload);
            next_report += pdMS_TO_TICKS(MQTTReportingPeriod * 1000UL);
        }
        vTaskDelay(pdMS_TO_TICKS(MQTT_QUEUED_PUBLISH_DELAY_MS));

#if CALCULATE_MQTT_SERVICE_TASK_STACK_SIZE_ENABLED
        report_current_task_stack_usage(MQTT_Service);
#endif
    }
}

static void mqtt_log_tf_directory(const char *path)
{
#if DEBUG_ENABLED
    DIR *directory = opendir(path);
    if (directory == nullptr)
        return;
    dirent *entry = nullptr;
    while ((entry = readdir(directory)) != nullptr)
    {
        if (strcmp(entry->d_name, ".") == 0 || strcmp(entry->d_name, "..") == 0)
            continue;
        std::string child_path = std::string(path) + "/" + entry->d_name;
        struct stat information{};
        if (stat(child_path.c_str(), &information) != 0)
            continue;
        ESP_LOGI(TAG, "%s", child_path.c_str());
        if (S_ISDIR(information.st_mode))
            mqtt_log_tf_directory(child_path.c_str());
    }
    closedir(directory);
#else
    (void)path;
#endif
}

#endif

static void setup_mqtt_tf_queue()
{

