roblatour/ESP32TimeServer/main/main.cpp
#if MQTT_ENABLED

    sdmmc_host_t host = SDMMC_HOST_DEFAULT();
    sd_pwr_ctrl_ldo_config_t ldo_config{};
    ldo_config.ldo_chan_id = 4;
    sd_pwr_ctrl_handle_t power_control = nullptr;
    esp_err_t result = sd_pwr_ctrl_new_on_chip_ldo(&ldo_config, &power_control);
    if (result != ESP_OK)
    {
#if DEBUG_ENABLED
        ESP_LOGW(TAG, "Unable to enable TF card power: %s. Queued MQTT messages will be stored in ram.", esp_err_to_name(result));
#endif
        return;
    }
    host.pwr_ctrl_handle = power_control;
    auto cleanup_power_control = [&power_control]()
    {
        if (power_control != nullptr)
        {
            sd_pwr_ctrl_del_on_chip_ldo(power_control);
            power_control = nullptr;
        }
    };

    sdmmc_slot_config_t slot = SDMMC_SLOT_CONFIG_DEFAULT();
    slot.width = 4;
    slot.clk = static_cast<gpio_num_t>(TFCardClockPin);
    slot.cmd = static_cast<gpio_num_t>(TFCardCommandPin);
    slot.d0 = static_cast<gpio_num_t>(TFCardData0Pin);
    slot.d1 = static_cast<gpio_num_t>(TFCardData1Pin);
    slot.d2 = static_cast<gpio_num_t>(TFCardData2Pin);
    slot.d3 = static_cast<gpio_num_t>(TFCardData3Pin);
    slot.flags |= SDMMC_SLOT_FLAG_INTERNAL_PULLUP;
    esp_vfs_fat_mount_config_t mount_config{};
    mount_config.format_if_mount_failed = false;
    mount_config.max_files = 4;
    mount_config.allocation_unit_size = 16 * 1024;

    result = esp_vfs_fat_sdmmc_mount(TF_MOUNT_POINT, &host, &slot, &mount_config, &s_tf_card);
    if (result != ESP_OK)
    {
#if DEBUG_ENABLED
        ESP_LOGW(TAG, "TF card unavailable: %s. Queued MQTT messages will be stored in ram.", esp_err_to_name(result));
#endif
        cleanup_power_control();
        return;
    }

    FATFS *filesystem = nullptr;
    DWORD free_clusters = 0;
    if (f_getfree("0:", &free_clusters, &filesystem) != FR_OK || filesystem == nullptr || filesystem->fs_type != FS_FAT32)
    {
#if DEBUG_ENABLED
        ESP_LOGW(TAG, "TF card is not FAT32. Queued MQTT messages will be stored in ram.");
#endif
        esp_vfs_fat_sdcard_unmount(TF_MOUNT_POINT, s_tf_card);
        s_tf_card = nullptr;
        cleanup_power_control();
        return;
    }

    mqtt_log_tf_directory(TF_MOUNT_POINT);
    bool queue_directory_created = mkdir(TF_QUEUE_DIRECTORY, 0775) == 0;
    if (!queue_directory_created && errno != EEXIST)
    {
#if DEBUG_ENABLED
        ESP_LOGW(TAG, "Unable to create TF MQTT queue directory. Queued MQTT messages will be stored in ram.");
#endif
        esp_vfs_fat_sdcard_unmount(TF_MOUNT_POINT, s_tf_card);
        s_tf_card = nullptr;
        cleanup_power_control();
        return;
    }
#if DEBUG_ENABLED
    if (queue_directory_created)
        ESP_LOGI(TAG, "%s", TF_QUEUE_DIRECTORY);
#endif

    char probe_path[128] = "";
    snprintf(probe_path, sizeof(probe_path), "%s/PROBE.TMP", TF_QUEUE_DIRECTORY);
    FILE *probe = fopen(probe_path, "wb+");
    char probe_value = 0;
    bool usable = probe != nullptr && fwrite("T", 1, 1, probe) == 1 && fflush(probe) == 0 &&
                  fseek(probe, 0, SEEK_SET) == 0 && fread(&probe_value, 1, 1, probe) == 1 && probe_value == 'T';
    if (probe != nullptr)
        fclose(probe);
    unlink(probe_path);
    if (!usable)
    {
#if DEBUG_ENABLED
        ESP_LOGW(TAG, "TF card read/write verification failed. Queued MQTT messages will be stored in ram.");
#endif
        esp_vfs_fat_sdcard_unmount(TF_MOUNT_POINT, s_tf_card);
        s_tf_card = nullptr;
        cleanup_power_control();
        return;
    }

    std::vector<std::string> files = mqtt_tf_queue_files();
    for (const std::string &path : files)
    {
        unsigned long high = 0;
        unsigned long low = 0;
        if (sscanf(path.c_str(), "/tfcard/Queue/R%7lX.%3lX", &high, &low) == 2)
        {
            uint64_t sequence = (static_cast<uint64_t>(high) << 12) | low;
            if (sequence >= s_tf_queue_next_sequence)
                s_tf_queue_next_sequence = sequence + 1;
        }
    }
    s_mqtt_queued_messages_count.store(files.size());
    s_tf_queue_available.store(true);
#if DEBUG_ENABLED
    ESP_LOGI(TAG, "TF card MQTT queue enabled");
    if (files.empty())
        ESP_LOGI(TAG, "No queued messages found");
#endif

#endif
}

static void setup_mqtt()
{
#if MQTT_ENABLED

    if (MQTTServerIPAddress[0] == '\0' || MQTT_QOS < 0 || MQTT_QOS > 2)
    {
        s_mqtt_setup_failed.store(true);
        return;
    }

    s_mqtt_stats_mutex = xSemaphoreCreateMutex();
    s_mqtt_ntp_event_queue = xQueueCreate(MQTT_NTP_EVENT_QUEUE_DEPTH, sizeof(struct sockaddr_storage));
    if (s_mqtt_stats_mutex == nullptr || s_mqtt_ntp_event_queue == nullptr)
    {
        s_mqtt_setup_failed.store(true);
        return;
    }
    snprintf(s_mqtt_uri, sizeof(s_mqtt_uri), "mqtt://%s:%u", MQTTServerIPAddress, static_cast<unsigned int>(MQTTPort));
    snprintf(s_mqtt_report_topic, sizeof(s_mqtt_report_topic), "%s/report", MQTTTopic);
    snprintf(s_mqtt_status_topic, sizeof(s_mqtt_status_topic), "%s/status", MQTTTopic);
    esp_mqtt_client_config_t config{};
    config.broker.address.uri = s_mqtt_uri;
    config.credentials.username = MQTTUsername;
    config.credentials.authentication.password = MQTTPassword;
    config.session.keepalive = MQTTFrequencyOfKeepAliveRequest;
    config.session.last_will.topic = s_mqtt_status_topic;
    config.session.last_will.msg = "offline";
    config.session.last_will.qos = MQTT_QOS;
    config.session.last_will.retain = 1;
    config.task.priority = 23;
    s_mqtt_client = esp_mqtt_client_init(&config);
    if (s_mqtt_client == nullptr)
    {
        s_mqtt_setup_failed.store(true);
        return;
    }
    if (esp_mqtt_client_register_event(s_mqtt_client, MQTT_EVENT_ANY, mqtt_event_handler, nullptr) != ESP_OK)
    {
        s_mqtt_setup_failed.store(true);
        return;
    }
    if (esp_mqtt_client_start(s_mqtt_client) != ESP_OK)
    {
        s_mqtt_setup_failed.store(true);
        return;
    }

#if DEBUG_ENABLED
    ESP_LOGI(TAG, "MQTT setup. Keep alive set at %u seconds", MQTTFrequencyOfKeepAliveRequest);
#endif
    if (xTaskCreatePinnedToCore(mqtt_service_task, "mqtt_service", MQTT_Service_Task_Stack_Size, nullptr, 5, nullptr, 0) != pdPASS ||
        xTaskCreatePinnedToCore(ethernet_transport_recovery_task, "eth_recovery", Ethernet_Transport_Recovery_Task_Stack_Size, nullptr, 6, nullptr, 0) != pdPASS)
        s_mqtt_setup_failed.store(true);
#endif
}

static void arduino_eth_event_handler(arduino_event_id_t event, arduino_event_info_t info)
{
    switch (event)
    {
    case ARDUINO_EVENT_ETH_START:
#if DEBUG_ENABLED
        ESP_LOGI(TAG, "Ethernet driver started");
#endif
        ETH.setHostname(DeviceName);
        display_line(1, "Ethernet started");
        break;
    case ARDUINO_EVENT_ETH_CONNECTED:
        s_ethernet_connected.store(true);
#if MQTT_ENABLED
        s_eth_link_connected_us.store(esp_timer_get_time());
#endif
#if DEBUG_ENABLED
        ESP_LOGI(TAG, "Ethernet link connected");
#endif
        xEventGroupSetBits(s_net_event_group, ETH_CONNECTED_BIT);
        display_line(1, "Ethernet connected");
        break;
    case ARDUINO_EVENT_ETH_GOT_IP:
        snprintf(s_ipv4_address, sizeof(s_ipv4_address), IPSTR, IP2STR(&info.got_ip.ip_info.ip));
        update_selected_ip_address();
#if DEBUG_ENABLED
        ESP_LOGI(TAG,
                 "Ethernet IPv4 acquired: ip=" IPSTR ", mask=" IPSTR ", gw=" IPSTR,
                 IP2STR(&info.got_ip.ip_info.ip),
                 IP2STR(&info.got_ip.ip_info.netmask),
                 IP2STR(&info.got_ip.ip_info.gw));
#endif
        xEventGroupSetBits(s_net_event_group, ETH_GOT_IP_BIT);
        display_selected_ip_address(static_cast<int>(time(nullptr) % 10));
        break;
    case ARDUINO_EVENT_ETH_GOT_IP6:
        if (inet_ntop(AF_INET6, &info.got_ip6.ip6_info.ip, s_ipv6_address, sizeof(s_ipv6_address)) == nullptr)
            s_ipv6_address[0] = '\0';
        update_selected_ip_address();
#if DEBUG_ENABLED
        ESP_LOGI(TAG, "Ethernet IPv6 acquired: %s", s_ipv6_address);
#endif
        xEventGroupSetBits(s_net_event_group, ETH_GOT_IP6_BIT);
        display_selected_ip_address(static_cast<int>(time(nullptr) % 10));
        break;
    case ARDUINO_EVENT_ETH_LOST_IP:
#if DEBUG_ENABLED
        ESP_LOGW(TAG, "Ethernet lost IPv4 address");
#endif
        xEventGroupClearBits(s_net_event_group, ETH_GOT_IP_BIT);
        s_ipv4_address[0] = '\0';
        update_selected_ip_address();
        display_line(1, "Ethernet lost IP");
        display_selected_ip_address(static_cast<int>(time(nullptr) % 10));
        break;
    case ARDUINO_EVENT_ETH_DISCONNECTED:
        s_ethernet_connected.store(false);
#if MQTT_ENABLED
        mqtt_note_ethernet_disconnected();
#endif
#if DEBUG_ENABLED
        ESP_LOGW(TAG, "Ethernet link disconnected");
#endif
        xEventGroupClearBits(s_net_event_group, ETH_CONNECTED_BIT | ETH_GOT_IP_BIT | ETH_GOT_IP6_BIT);
        s_ipv4_address[0] = '\0';
        s_ipv6_address[0] = '\0';
        update_selected_ip_address();
        display_line(1, "Ethernet disconnect");
        display_line(3, "");
        break;
    case ARDUINO_EVENT_ETH_STOP:
        s_ethernet_connected.store(false);
#if MQTT_ENABLED
        mqtt_note_ethernet_disconnected();
#endif
#if DEBUG_ENABLED
        ESP_LOGW(TAG, "Ethernet driver stopped");
#endif
        xEventGroupClearBits(s_net_event_group, ETH_CONNECTED_BIT | ETH_GOT_IP_BIT | ETH_GOT_IP6_BIT);
        s_ipv4_address[0] = '\0';
        s_ipv6_address[0] = '\0';
        update_selected_ip_address();
        display_line(1, "Ethernet stopped");
        display_line(3, "");
        break;
    default:
        break;
    }
}

