roblatour/ESP32TimeServer/main/main.cpp
// Apply the optional static IP address configuration from ESP32TimeServerSettings.h.
// When StaticIPAddress is empty this is a no-op and the Ethernet interface falls back
// to DHCP (the default behaviour). Returns true when a static IP was applied, false otherwise.
static bool configure_static_ip()
{
    // An empty StaticIPAddress means DHCP should be used - nothing to do here
    if (StaticIPAddress[0] == '\0')
        return false;

    IPAddress local_ip, gateway, subnet;
    if (!local_ip.fromString(StaticIPAddress))
    {
        ESP_LOGE(TAG, "Configured StaticIPAddress is invalid: %s", StaticIPAddress);
        return false;
    }
    if (!gateway.fromString(Gateway))
    {
        ESP_LOGE(TAG, "Configured Gateway is invalid: %s", Gateway);
        return false;
    }
    if (!subnet.fromString(SubnetMask))
    {
        ESP_LOGE(TAG, "Configured SubnetMask is invalid: %s", SubnetMask);
        return false;
    }

    // DNS servers are optional; default to 0.0.0.0 (unset) when left blank
    IPAddress dns1, dns2;
    if (PrimaryDNS[0] != '\0')
    {
        if (!dns1.fromString(PrimaryDNS))
        {
            ESP_LOGE(TAG, "Configured PrimaryDNS is invalid: %s", PrimaryDNS);
            return false;
        }
    }
    if (SecondaryDNS[0] != '\0')
    {
        if (!dns2.fromString(SecondaryDNS))
        {
            ESP_LOGE(TAG, "Configured SecondaryDNS is invalid: %s", SecondaryDNS);
            return false;
        }
    }

    if (!ETH.config(local_ip, gateway, subnet, dns1, dns2))
    {
        ESP_LOGE(TAG, "ETH.config() failed to apply the static IP configuration");
        return false;
    }

#if DEBUG_ENABLED
    ESP_LOGI(TAG,
             "Static IP configuration applied: ip=%s, mask=%s, gw=%s",
             StaticIPAddress, SubnetMask, Gateway);
#endif
    return true;
}

static bool start_ethernet_driver()
{
    if (!ETH.enableIPv6())
    {
#if DEBUG_ENABLED
        ESP_LOGE(TAG, "Unable to enable Ethernet IPv6 support");
#endif
    }

    return ETH.begin(ETH_PHY_IP101,
                     ETH_PHY_ADDRESS,
                     static_cast<int>(ETH_MDC_GPIO),
                     static_cast<int>(ETH_MDIO_GPIO),
                     static_cast<int>(ETH_PHY_RST_GPIO),
                     EMAC_CLK_EXT_IN);
}

static void setup_ethernet()
{
    if (s_net_event_group == nullptr)
        s_net_event_group = xEventGroupCreate();

    s_ip_address[0] = '\0';
    s_ipv4_address[0] = '\0';
    s_ipv6_address[0] = '\0';
    xEventGroupClearBits(s_net_event_group, ETH_CONNECTED_BIT | ETH_GOT_IP_BIT | ETH_GOT_IP6_BIT);

    Network.onEvent(arduino_eth_event_handler);

#if DEBUG_ENABLED
    ESP_LOGI(TAG,
             "Starting Arduino Ethernet with phy_addr=%d, mdc=%d, mdio=%d, power=%d",
             ETH_PHY_ADDRESS,
             static_cast<int>(ETH_MDC_GPIO),
             static_cast<int>(ETH_MDIO_GPIO),
             static_cast<int>(ETH_PHY_RST_GPIO));
#endif

    if (!start_ethernet_driver()) // needed for hardware time stamping
    {
#if DEBUG_ENABLED
        ESP_LOGE(TAG, "ETH.begin() failed");
#endif
        return;
    }

    if (!ntp_cache_init() ||
        (s_hardware_ntp_transmit_mutex = xSemaphoreCreateMutex()) == nullptr ||
        (s_hardware_ntp_request_queue = xQueueCreate(HARDWARE_NTP_REQUEST_QUEUE_DEPTH, sizeof(hardware_ntp_request_t))) == nullptr ||
        (s_hardware_ntp_request_buffer_queue = xQueueCreate(HARDWARE_NTP_REQUEST_BUFFER_COUNT, sizeof(uint8_t *))) == nullptr ||
        !initialize_hardware_ntp_request_buffers() ||
        xTaskCreatePinnedToCore(ntp_cache_purge_task, "ntp_cache_purge", NTP_Cache_Purge_Task_Stack_Size, nullptr, 5, &s_ntp_cache_purge_task_handle, tskNO_AFFINITY) != pdPASS ||
        xTaskCreatePinnedToCore(hardware_ntp_server_task, "hardware_ntp", Hardware_NTP_Server_Task_Stack_Size, nullptr, 17, &s_hardware_ntp_server_task_handle, 1) != pdPASS) // do not change the task priority higher than 17 causes conflicts with other mechanisms
    {
        ESP_LOGE(TAG, "Unable to initialize hardware NTP serving");
        deinitialize_hardware_ntp_server();
    }
    else if (!configure_hardware_timestamps())
    {
        ESP_LOGE(TAG, "Unable to configure Ethernet hardware timestamping");
    }

    // Apply the optional static IP address (if configured). When StaticIPAddress is
    // left empty this is a no-op and DHCP is used as usual.
    bool static_ip_applied = configure_static_ip();

#if DEBUG_ENABLED
    ESP_LOGI(TAG,
             "Waiting for Ethernet %s address...",
             static_ip_applied ? "static" : "DHCP");
#endif
    xEventGroupWaitBits(s_net_event_group, ETH_GOT_IP_BIT | ETH_GOT_IP6_BIT, pdFALSE, pdFALSE, portMAX_DELAY);
#if DEBUG_ENABLED
    ESP_LOGI(TAG, "Ethernet setup complete, current address: %s", s_ip_address[0] == '\0' ? "<none>" : s_ip_address);
#endif
}

void write_opening_messages_to_the_console()
{

    // Note: the console writes in the routine are purposefully not guarded by a DEBUG_ENABLE check - they should always be written

    Serial.begin(serialMonitorSpeed);
    vTaskDelay(pdMS_TO_TICKS(100));

    ESP_LOGI(TAG, "");
    ESP_LOGI(TAG, "******************* Application Startup *******************");

    // the values below are drawn from the CMakeLists.txt files (one in the root folder and one in the /main folder)
    const app_metadata_t *meta = get_app_metadata();
    ESP_LOGI(TAG, "%s v%s", meta->project_name, meta->version);
    ESP_LOGI(TAG, "%s", meta->copyright);
    ESP_LOGI(TAG, "License: %s", meta->license);
    ESP_LOGI(TAG, "Website: %s", meta->homepage);
    ESP_LOGI(TAG, " ");

#if UPTIME_RESTART_BUTTON_ENABLED
    ESP_LOGI(TAG, "Uptime / Reset button support: Enabled");
#else
    ESP_LOGW(TAG, "Uptime / Reset button support: Disabled");
#endif

#if LIQUID_CRYSTAL_DISPLAY_ENABLED
    ESP_LOGI(TAG, "LCD support: Enabled");
#else
    ESP_LOGW(TAG, "LCD support: Disabled");
#endif

#if OTE_UPDATES_ENABLED
    ESP_LOGI(TAG, "Over the Ethernet update support: Enabled");
#else
    ESP_LOGW(TAG, "Over the Ethernet update support: Disabled");
#endif

