roblatour/ESP32TimeServer/main/main.cpp
#if MQTT_ENABLED
    ESP_LOGI(TAG, "MQTT support: Enabled");

#if MQTT_CLIENT_REPORTING_ENABLED
    ESP_LOGI(TAG, "MQTT client reporting: Enabled");
#else
    ESP_LOGW(TAG, "MQTT client reporting: Disabled");
#endif

#if MQTT_MEMORY_REPORTING_ENABLED
    ESP_LOGI(TAG, "MQTT memory reporting: Enabled");
#else
    ESP_LOGW(TAG, "MQTT memory reporting: Disabled");
#endif

#if MQTT_HISTORICAL_REPORTING_ENABLED
    ESP_LOGI(TAG, "MQTT historical reporting: Enabled");
#else
    ESP_LOGW(TAG, "MQTT historical reporting: Disabled");
#endif

#else
    ESP_LOGW(TAG, "MQTT support: Disabled");
#endif

    ESP_LOGI(TAG, "");
}

void write_open_for_business_messages_to_the_console()
{

    char s_open_for_business_date_and_time[25] = "";
    format_time_to_ISO8601(time(nullptr), s_open_for_business_date_and_time, sizeof(s_open_for_business_date_and_time));

    // Note: the console write below is purposefully not guarded by a DEBUG_ENABLE check - it should always be written
    ESP_LOGI(TAG, "***********************************************");
    ESP_LOGI(TAG, "* Open for business: %s *", s_open_for_business_date_and_time);
    ESP_LOGI(TAG, "***********************************************");

#if DEBUG_ENABLED
#else
    ESP_LOGW(TAG, "DEBUG_ENABLED is disabled in the settings file; this will be the last console message from main_cpp");
#endif
}

void setup_NVM_storage(void)
{

    if (!initialize_nvs_storage())
        ESP_LOGE(TAG, "NVS initialization failed. GNSS module settings persistence is unavailable.");
}

void create_mutexes_and_semaphores(void)
{

    s_time_mutex = xSemaphoreCreateMutex();
    s_pps_semaphore = xSemaphoreCreateBinary();
    s_pps_timestamp_queue = xQueueCreate(1, sizeof(PpsCaptureEvent));
    s_pps_sync_timestamp_queue = xQueueCreate(1, sizeof(PpsCaptureEvent));
    s_ote_mutex = xSemaphoreCreateMutex();
    s_sync_state_mutex = xSemaphoreCreateMutex();

#if LIQUID_CRYSTAL_DISPLAY_ENABLED
    s_lcd_mutex = xSemaphoreCreateMutex();
#endif

#if CALCULATE_ETHERNET_TRANSPORT_RECOVERY_TASK_STACK_SIZE_ENABLED || \
    CALCULATE_GNSS_RECOVERY_TASK_STACK_SIZE_ENABLED ||               \
    CALCULATE_GNSS_TIME_SYNC_TASK_STACK_SIZE_ENABLED ||              \
    CALCULATE_HARDWARE_NTP_SERVER_TASK_STACK_SIZE_ENABLED ||         \
    CALCULATE_MQTT_SERVICE_TASK_STACK_SIZE_ENABLED ||                \
    CALCULATE_NTP_CACHE_PURGE_TASK_STACK_SIZE_ENABLED ||             \
    CALCULATE_NTP_SERVER_TASK_STACK_SIZE_ENABLED ||                  \
    CALCULATE_OTE_SERVICE_TASK_STACK_SIZE_ENABLED ||                 \
    CALCULATE_PPS_DISCIPLINE_TASK_STACK_SIZE_ENABLED ||              \
    CALCULATE_UPDATE_DISPLAY_TASK_STACK_SIZE_ENABLED
    s_task_stack_usage_mutex = xSemaphoreCreateMutex();
#endif
}

void initialize_the_display(void)
{

#if LIQUID_CRYSTAL_DISPLAY_ENABLED
    if (setup_lcd() == ESP_OK)
    {
        display_line(0, "ESP32 Time Server");
        display_line(1, "");
        display_line(2, "");
        display_line(3, "");
    }
    else
    {
#if DEBUG_ENABLED
        ESP_LOGE(TAG, "LCD setup failed");
#endif
    }
#endif
}

static void setup_up_time_button()
{

#if UPTIME_RESTART_BUTTON_ENABLED
    gpio_config_t config{};
    config.pin_bit_mask = 1ULL << upTimeRestartPin;
    config.mode = GPIO_MODE_INPUT;
    config.pull_up_en = GPIO_PULLUP_ENABLE;
    config.pull_down_en = GPIO_PULLDOWN_DISABLE;
    config.intr_type = GPIO_INTR_DISABLE;
    ESP_ERROR_CHECK(gpio_config(&config));

#endif
}
static std::string configure_mac_address()
{
    uint8_t real_mac_address[6];
    char real_mac_address_str[18] = {0};

    esp_err_t ret = esp_efuse_mac_get_default(real_mac_address);

    if (ret == ESP_OK)
    {
        std::snprintf(real_mac_address_str, sizeof(real_mac_address_str),
                      "%02x:%02x:%02x:%02x:%02x:%02x",
                      real_mac_address[0], real_mac_address[1], real_mac_address[2],
                      real_mac_address[3], real_mac_address[4], real_mac_address[5]);

#if DEBUG_ENABLED
        ESP_LOGI(TAG, "Real MAC address for this ESP32 is: %s", real_mac_address_str);
#endif
    }

#if DEBUG_ENABLED
    else
    {
        ESP_LOGE(TAG, "Failed to get the MAC address for this ESP32. Error: %d", ret);
    }
#endif

    // If MACAddress is empty or matches the real MAC, do nothing
    if ((MACAddress[0] == '\0') || (std::strcmp(real_mac_address_str, MACAddress) == 0))
    {
#if DEBUG_ENABLED
        ESP_LOGI(TAG, "No need to change the MAC address.");
#endif
        return std::string(real_mac_address_str);
    }

    // Parse the desired MAC
    uint8_t mac[6] = {};
    if (!parse_mac_id_string(MACAddress, mac))
    {
#if DEBUG_ENABLED
        ESP_LOGE(TAG, "The MAC address in settings is invalid: %s - the MAC ID will not be changed", MACAddress);
#endif
        return std::string(real_mac_address_str);
    }

    // Apply the new MAC
    esp_err_t err = esp_base_mac_addr_set(mac);
    if (err != ESP_OK)
    {
#if DEBUG_ENABLED
        ESP_LOGE(TAG, "Failed to set MAC address to %s: %s", MACAddress, esp_err_to_name(err));
#endif
        return std::string(real_mac_address_str);
    }

#if DEBUG_ENABLED
    ESP_LOGI(TAG, "MAC address changed to: %s", MACAddress);
#endif

    return std::string(MACAddress);
}

void setup_ethernet_connection()
{

    std::string MACToBeUsed = configure_mac_address();
    ESP_LOGI(TAG, "The MAC address that will be used for this device is: %s", MACToBeUsed.c_str());

    display_line(1, "Connecting Ethernet");
    display_line(2, "");
    setup_ethernet();
    display_selected_ip_address(static_cast<int>(time(nullptr) % 10));
}

#if OTE_UPDATES_ENABLED

static void OTE_copy_reason(char *destination, size_t destination_size, const char *reason)
{
    if (destination_size == 0)
        return;

    if (reason == nullptr || reason[0] == '\0')
    {
        destination[0] = '\0';
        return;
    }

    snprintf(destination, destination_size, "%s", reason);
}

static void OTE_set_running_state(unsigned int progress, unsigned int total)
{
    if (xSemaphoreTake(s_ote_mutex, portMAX_DELAY) == pdTRUE)
    {
        s_ote_in_progress = true;
        s_ote_failed = false;
        s_ote_success = false;
        s_ote_failure_display_until_us = 0;
        s_ote_reboot_at_us = 0;
        s_ote_error_reason[0] = '\0';
        s_ote_progress_percent = total == 0 ? 0 : static_cast<int>((progress * 100U) / total);
        xSemaphoreGive(s_ote_mutex);
    }
}

static void OTE_set_failure_state(const char *reason)
{
    if (xSemaphoreTake(s_ote_mutex, portMAX_DELAY) == pdTRUE)
    {
        s_ote_in_progress = false;
        s_ote_failed = true;
        s_ote_success = false;
        s_ote_failure_display_until_us = esp_timer_get_time() + static_cast<int64_t>(OTE_Failure_Display_Time_Ms) * 1000LL;
        s_ote_reboot_at_us = 0;
        OTE_copy_reason(s_ote_error_reason, sizeof(s_ote_error_reason), reason);
        xSemaphoreGive(s_ote_mutex);
    }
}

