roblatour/ESP32TimeServer/main/main.cpp
    s_gnss_recovery_in_progress.store(false);
    xTaskNotifyGive(sync_task_handle);
    vTaskDelete(nullptr);
}

static void handle_runtime_sync_failure(const sync_faults_t &faults, time_t update_delta, uint32_t retry_delay_ms)
{
    uint32_t failure_count = sync_state_note_failure(faults, update_delta);
    sync_state_t snapshot = get_sync_state_snapshot();

    s_time_setting_in_progress.store(false);

    if (failure_count >= Sync_Failures_Before_Runtime_Recovery && (failure_count % Sync_Failures_Before_Runtime_Recovery) == 0)
    {
        int64_t now_us = esp_timer_get_time();
        int64_t last_recovery_us = s_last_gnss_recovery_us.load();
        bool recovery_due = last_recovery_us == 0 || (now_us - last_recovery_us) >= Runtime_gnss_Recovery_Min_Interval_Us;

        if (recovery_due && !s_gnss_recovery_in_progress.exchange(true))
        {
#if DEBUG_ENABLED
            ESP_LOGW(TAG, "Runtime GNSS recovery attempt after %lu consecutive sync failures.", static_cast<unsigned long>(failure_count));
#endif
            s_last_gnss_recovery_us.store(now_us);
            TaskHandle_t sync_task_handle = xTaskGetCurrentTaskHandle();
            BaseType_t created = xTaskCreatePinnedToCore(gnss_runtime_recovery_task,
                                                         "gnss_recovery",
                                                         GNSS_Recovery_Task_Stack_Size,
                                                         sync_task_handle,
                                                         15,
                                                         nullptr,
                                                         tskNO_AFFINITY);
            if (created == pdPASS)
            {
                ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
                sync_state_reset_failure_counters();
            }
            else
            {
                s_gnss_recovery_in_progress.store(false);
#if DEBUG_ENABLED
                ESP_LOGE(TAG, "Unable to create the GNSS recovery task.");
#endif
            }
        }
    }

    if (snapshot.last_successful_sync_us > 0 && (esp_timer_get_time() - snapshot.last_successful_sync_us) > Sync_Reboot_After_Us)
    {
#if DEBUG_ENABLED
        ESP_LOGE(TAG, "Rebooting after extended holdover without a successful GNSS resync.");
#endif
        vTaskDelay(pdMS_TO_TICKS(200));
#if MQTT_ENABLED
        mqtt_publish_final_report();
#endif
        esp_restart();
    }

    vTaskDelay(pdMS_TO_TICKS(retry_delay_ms));
}

static void gnss_time_sync_task(void *parameter)
{
    bool first_sync = true;

    for (;;)
    {

        s_time_setting_in_progress.store(true);
        sync_state_note_attempt();

        /*  pre-release code - commented out
        sync_candidate_t candidate{};

        // Start stopwatch
        int64_t start_us = esp_timer_get_time();

        bool ok = acquire_sync_candidate(&candidate);

        // Stop stopwatch
        int64_t end_us = esp_timer_get_time();

        // Calculate time to sync
        int64_t elapsed_us = end_us - start_us;

        if (!ok)
        {
            // Display elapsed time even on failure
            ESP_LOGE(TAG, "acquire_sync_candidate() failed after %lld us\n", elapsed_us);

            handle_runtime_sync_failure(candidate.failures, 0, 1000);
            continue;
        }

        // Success path
        ESP_LOGI(TAG, "acquire_sync_candidate() succeeded in %lld us\n", elapsed_us);

        // end of performance test code *************************

        end of pre-release code */

        // start of code block to be replaced with the above when released

        sync_candidate_t candidate{};
        if (!acquire_sync_candidate(&candidate))
        {
            handle_runtime_sync_failure(candidate.failures, 0, 1000);
            continue;
        }

        // end of code block to be replaced with the above when released

        if (first_sync)
        {
            sync_candidate_t confirmation_candidate{};
            if (!acquire_sync_candidate(&confirmation_candidate))
            {
                handle_runtime_sync_failure(confirmation_candidate.failures, 0, 1000);
                continue;
            }

            if (!first_sync_candidates_are_plausible(candidate, confirmation_candidate))
            {
                handle_runtime_sync_failure({false, true, false, false}, 0, 1000);
                continue;
            }

            candidate = confirmation_candidate;
        }

        time_t update_delta = 0;
        if (!first_sync)
        {
            time_t current_time = time(nullptr);
            update_delta = current_time - candidate.candidate_time;
            bool sanity_check_passed = (update_delta >= -safeguardThresholdInSeconds) && (update_delta <= safeguardThresholdInSeconds);
            if (!sanity_check_passed)
            {
                uint32_t sanity_failure_count = sync_state_note_sanity_retry(update_delta);
                s_time_setting_in_progress.store(false);

#if DEBUG_ENABLED
                ESP_LOGE(TAG, "Sanity check failed with delta %lld on attempt %lu.", static_cast<long long>(update_delta), static_cast<unsigned long>(sanity_failure_count));
#endif

                if (sanity_failure_count < Sanity_Failures_Before_Fault)
                {
                    vTaskDelay(pdMS_TO_TICKS(250));
                    continue;
                }

                s_safe_guard_tripped.store(true);
                sync_state_note_failure({false, false, true, false}, update_delta);

                if (rebootIfSanityCheckFails)
                {
#if DEBUG_ENABLED
                    ESP_LOGE(TAG, "Restarting according to settings.");
#endif
                    vTaskDelay(pdMS_TO_TICKS(200));
#if MQTT_ENABLED
                    mqtt_publish_final_report();
#endif
                    esp_restart();
                }

                vTaskDelay(pdMS_TO_TICKS(1000));
                continue;
            }
        }

        sync_state_clear_sanity_failures();

        if (xSemaphoreTake(s_time_mutex, portMAX_DELAY) == pdTRUE)
        {
            int64_t elapsed_us = candidate.use_pps_alignment ? (esp_timer_get_time() - candidate.pps_release_time_us) : 0;
            if (elapsed_us < 0)
                elapsed_us = 0;

            struct timeval tv{};
            tv.tv_sec = candidate.candidate_time + static_cast<time_t>(elapsed_us / 1000000LL);
            tv.tv_usec = static_cast<suseconds_t>(elapsed_us % 1000000LL);
            settimeofday(&tv, nullptr);
            synchronize_hardware_clock();
            s_ntp_reference_time_64 = get_current_time_in_ntp64_format();
            s_ntp_reference_valid = true;

            xSemaphoreGive(s_time_mutex);

