roblatour/ESP32TimeServer/main/main.cpp
            s_safe_guard_tripped.store(false);
            s_time_setting_in_progress.store(false);
            s_time_has_been_set.store(true);
            first_sync = false;
            sync_state_note_success(update_delta);

#if DEBUG_ENABLED
            char date_string[16] = "";
            char time_string[24] = "";
            time_t now_utc = time(nullptr);
            format_local_date_time(now_utc, date_string, sizeof(date_string), time_string, sizeof(time_string));

            if (candidate.used_nmea_fallback)
                ESP_LOGI(TAG, "GNSS time sync ( using NMEA fallback %s ) on %s at %s", candidate.use_pps_alignment ? "with PPS alignment" : "without PPS alignment", date_string, time_string);
            else
                ESP_LOGI(TAG, "GNSS time sync on %s at %s", date_string, time_string);
#endif

            uint32_t refresh_start_ms = millis();
            uint32_t refresh_interval_ms = periodicGNSSRefreshEveryThisNumberOfMinutes * 60UL * 1000UL;
            int64_t invalid_started_us = 0;

            while ((millis() - refresh_start_ms) < refresh_interval_ms)
            {
                bool gnss_valid = current_gnss_timing_is_valid();

                if (gnss_valid)
                {
                    invalid_started_us = 0;
                    sync_state_note_gnss_validity(true);
                }
                else
                {
                    if (invalid_started_us == 0)
                        invalid_started_us = esp_timer_get_time();

                    if ((esp_timer_get_time() - invalid_started_us) >= Gnss_Invalid_Reacquisition_After_Us)
                    {
                        sync_state_note_gnss_validity(false);

#if DEBUG_ENABLED
                        ESP_LOGW(TAG,
                                 "GNSS timing invalid for more than %lu seconds; starting reacquisition.",
                                 static_cast<unsigned long>(Gnss_Invalid_Reacquisition_After_Us / 1000000LL));
#endif

                        break;
                    }
                }

                vTaskDelay(pdMS_TO_TICKS(1000));
            }
        }

#if CALCULATE_GNSS_Time_Sync_Task_Stack_Size_ENABLED
        report_current_task_stack_usage(GNSS_Time_Sync);
#endif
    }
}

void setup_the_gnss()
{

    display_line(1, "GNSS setup underway");
    display_line(2, "");

    apply_timezone_settings();

    setup_gnss();

    display_line(1, "Getting date & time");
    display_line(2, "");

    xTaskCreatePinnedToCore(gnss_time_sync_task, "gnss_time_sync", GNSS_Time_Sync_Task_Stack_Size, nullptr, 15, nullptr, tskNO_AFFINITY);

    xTaskCreatePinnedToCore(pps_discipline_task, "pps_discipline", PPS_Discipline_Task_Stack_Size, nullptr, 14, nullptr, tskNO_AFFINITY);

    while (!s_time_has_been_set.load())
        vTaskDelay(pdMS_TO_TICKS(100));

    display_line(1, "Time Synchronized");
    display_line(2, "PPS Disciplined");
}

// Serves standard IPv6 NTP client requests and returns the device’s current synchronized time.
// Also servers IPv4 NTP client requests that the IPv4 NTP-related traffic the hardware interception path rejects
static void ntp_server_task(void *parameter)
{
    int ipv4_socket = socket(AF_INET, SOCK_DGRAM, IPPROTO_UDP);
    int ipv6_socket = socket(AF_INET6, SOCK_DGRAM, IPPROTO_UDP);
    int ipv6_link_local_socket = socket(AF_INET6, SOCK_DGRAM, IPPROTO_UDP);
    if (ipv4_socket < 0 || ipv6_socket < 0)
    {
#if DEBUG_ENABLED
        ESP_LOGE(TAG, "Unable to create NTP UDP sockets: errno %d", errno);
#endif
        if (ipv4_socket >= 0)
            closesocket(ipv4_socket);
        if (ipv6_socket >= 0)
            closesocket(ipv6_socket);
        if (ipv6_link_local_socket >= 0)
            closesocket(ipv6_link_local_socket);
        vTaskDelete(nullptr);
        return;
    }

    struct sockaddr_in ipv4_listen_addr{};
    ipv4_listen_addr.sin_family = AF_INET;
    ipv4_listen_addr.sin_port = htons(NTP_PORT);
    ipv4_listen_addr.sin_addr.s_addr = htonl(INADDR_ANY);

    int ipv6_only = 1;
    int reuse_address = 1;
    if (setsockopt(ipv6_socket, IPPROTO_IPV6, IPV6_V6ONLY, &ipv6_only, sizeof(ipv6_only)) != 0 ||
        setsockopt(ipv6_socket, SOL_SOCKET, SO_REUSEADDR, &reuse_address, sizeof(reuse_address)) != 0 ||
        bind(ipv4_socket, reinterpret_cast<struct sockaddr *>(&ipv4_listen_addr), sizeof(ipv4_listen_addr)) != 0)
    {
#if DEBUG_ENABLED
        ESP_LOGE(TAG, "Unable to configure NTP UDP sockets: errno %d", errno);
#endif
        closesocket(ipv4_socket);
        closesocket(ipv6_socket);
        if (ipv6_link_local_socket >= 0)
            closesocket(ipv6_link_local_socket);
        vTaskDelete(nullptr);
        return;
    }

    struct sockaddr_in6 ipv6_listen_addr{};
    ipv6_listen_addr.sin6_family = AF_INET6;
    ipv6_listen_addr.sin6_port = htons(NTP_PORT);
    ipv6_listen_addr.sin6_addr = in6addr_any;
    if (bind(ipv6_socket, reinterpret_cast<struct sockaddr *>(&ipv6_listen_addr), sizeof(ipv6_listen_addr)) != 0)
    {
#if DEBUG_ENABLED
        ESP_LOGE(TAG, "Unable to bind IPv6 NTP UDP socket: errno %d", errno);
#endif
        closesocket(ipv4_socket);
        closesocket(ipv6_socket);
        if (ipv6_link_local_socket >= 0)
            closesocket(ipv6_link_local_socket);
        vTaskDelete(nullptr);
        return;
    }

    esp_ip6_addr_t link_local_address{};
    if (ipv6_link_local_socket < 0 ||
        setsockopt(ipv6_link_local_socket, IPPROTO_IPV6, IPV6_V6ONLY, &ipv6_only, sizeof(ipv6_only)) != 0 ||
        setsockopt(ipv6_link_local_socket, SOL_SOCKET, SO_REUSEADDR, &reuse_address, sizeof(reuse_address)) != 0 ||
        esp_netif_get_ip6_linklocal(ETH.netif(), &link_local_address) != ESP_OK)
    {
#if DEBUG_ENABLED
        ESP_LOGW(TAG, "IPv6 link-local NTP listener unavailable: errno %d", errno);
#endif
        if (ipv6_link_local_socket >= 0)
            closesocket(ipv6_link_local_socket);
        ipv6_link_local_socket = -1;
    }
    else
    {
        struct sockaddr_in6 ipv6_link_local_listen_addr{};
        ipv6_link_local_listen_addr.sin6_family = AF_INET6;
        ipv6_link_local_listen_addr.sin6_port = htons(NTP_PORT);
        memcpy(&ipv6_link_local_listen_addr.sin6_addr, link_local_address.addr, sizeof(ipv6_link_local_listen_addr.sin6_addr));
        ipv6_link_local_listen_addr.sin6_scope_id = esp_netif_get_netif_impl_index(ETH.netif());
        if (bind(ipv6_link_local_socket,
                 reinterpret_cast<struct sockaddr *>(&ipv6_link_local_listen_addr),
                 sizeof(ipv6_link_local_listen_addr)) != 0)
        {
#if DEBUG_ENABLED
            ESP_LOGW(TAG, "IPv6 link-local NTP listener unavailable: errno %d", errno);
#endif
            closesocket(ipv6_link_local_socket);
            ipv6_link_local_socket = -1;
        }
    }

    for (;;)
    {
        fd_set read_fds;
        FD_ZERO(&read_fds);
        FD_SET(ipv4_socket, &read_fds);
        FD_SET(ipv6_socket, &read_fds);
        if (ipv6_link_local_socket >= 0)
            FD_SET(ipv6_link_local_socket, &read_fds);
        struct timeval timeout{};
        timeout.tv_sec = 1;
        int max_socket = ipv4_socket;
        if (ipv6_socket > max_socket)
            max_socket = ipv6_socket;
        if (ipv6_link_local_socket >= 0 && ipv6_link_local_socket > max_socket)
            max_socket = ipv6_link_local_socket;
        int ready = select(max_socket + 1, &read_fds, nullptr, nullptr, &timeout);
        if (ready < 0)
        {
#if DEBUG_ENABLED
            ESP_LOGW(TAG, "NTP socket select failed: errno %d", errno);
#endif
#if CALCULATE_NTP_SERVER_TASK_STACK_SIZE_ENABLED
            report_current_task_stack_usage(NTP_Server);
#endif
            continue;
        }
        if (ready == 0)
            continue;

        static uint8_t next_socket = 0;
        const int sockets[] = {ipv4_socket, ipv6_socket, ipv6_link_local_socket};
        const size_t socket_count = sizeof(sockets) / sizeof(sockets[0]);
        uint8_t start_socket = next_socket;

