roblatour/ESP32TimeServer/main/main.cpp
        for (size_t offset = 0; offset < socket_count; ++offset)
        {
            size_t index = (start_socket + offset) % socket_count;
            int sock = sockets[index];
            if (sock < 0 || !FD_ISSET(sock, &read_fds))
            {
#if CALCULATE_NTP_SERVER_TASK_STACK_SIZE_ENABLED
                report_current_task_stack_usage(NTP_Server);
#endif
                continue;
            }

            next_socket = static_cast<uint8_t>((index + 1) % socket_count);
            for (size_t batch_count = 0; batch_count < NTP_SOCKET_BATCH_LIMIT; ++batch_count)
            {
                uint8_t request[NTP_PACKET_SIZE + 1];
                uint8_t reply[NTP_PACKET_SIZE];
                struct sockaddr_storage source_addr{};
                socklen_t source_addr_len = sizeof(source_addr);
                int len = recvfrom(sock, request, sizeof(request), MSG_DONTWAIT,
                                   reinterpret_cast<struct sockaddr *>(&source_addr), &source_addr_len);
                if (len < 0)
                {
                    if (errno == EAGAIN || errno == EWOULDBLOCK)
                    {
#if CALCULATE_NTP_SERVER_TASK_STACK_SIZE_ENABLED
                        report_current_task_stack_usage(NTP_Server);
#endif
                        break;
                    }
#if DEBUG_ENABLED
                    ESP_LOGW(TAG, "recvfrom failed: errno %d", errno);
#endif
#if CALCULATE_NTP_SERVER_TASK_STACK_SIZE_ENABLED
                    report_current_task_stack_usage(NTP_Server);
#endif
                    break;
                }

                uint64_t receive_time = get_current_time_in_ntp64_format();
                if (len != static_cast<int>(NTP_PACKET_SIZE))
                {
#if MQTT_ENABLED
                    s_ntp_invalid_requests.fetch_add(1, std::memory_order_relaxed);
#endif
#if CALCULATE_NTP_SERVER_TASK_STACK_SIZE_ENABLED
                    report_current_task_stack_usage(NTP_Server);
#endif
                    continue;
                }

                uint8_t ntp_version = (request[0] >> 3) & 0x07;
                uint8_t ntp_mode = request[0] & 0x07;
                if (ntp_version < 3 || ntp_version > 4 || ntp_mode != 3)
                {
#if MQTT_ENABLED
                    s_ntp_invalid_requests.fetch_add(1, std::memory_order_relaxed);
#endif
#if CALCULATE_NTP_SERVER_TASK_STACK_SIZE_ENABLED
                    report_current_task_stack_usage(NTP_Server);
#endif
                    continue;
                }

#if MQTT_ENABLED
                s_ntp_requests_this_second.fetch_add(1, std::memory_order_relaxed);
                s_ntp_valid_requests.fetch_add(1, std::memory_order_relaxed);
                mqtt_enqueue_ntp_request(source_addr);
#endif
                const struct sockaddr_in *source_ipv4 = nullptr;
                const struct in6_addr *client_ipv6 = nullptr;
                ntp_client_record_t client_ipv4_record{};
                ntp_client_record_ipv6_t client_ipv6_record{};
                if (source_addr.ss_family == AF_INET)
                {
                    source_ipv4 = reinterpret_cast<const struct sockaddr_in *>(&source_addr);
                    ntp_cache_find_or_create(ntohl(source_ipv4->sin_addr.s_addr), ntohs(source_ipv4->sin_port), &client_ipv4_record);
                }
                else if (source_addr.ss_family == AF_INET6)
                {
                    client_ipv6 = &reinterpret_cast<const struct sockaddr_in6 *>(&source_addr)->sin6_addr;
                    ntp_cache_find_or_create_ipv6(client_ipv6,
                                                  ntohs(reinterpret_cast<const struct sockaddr_in6 *>(&source_addr)->sin6_port),
                                                  &client_ipv6_record);
                }

                ntp_reply_status_t status = get_ntp_reply_status();
#if MQTT_ENABLED
                if (status.gnss_synchronized && status.pps_disciplined)
                    s_ntp_responses_synchronized_and_disciplined.fetch_add(1, std::memory_order_relaxed);
                if (!status.gnss_synchronized)
                    s_ntp_responses_gnss_unsynchronized.fetch_add(1, std::memory_order_relaxed);
                if (!status.pps_disciplined)
                    s_ntp_responses_pps_undisciplined.fetch_add(1, std::memory_order_relaxed);
#endif
                build_ntp_reply(request, reply, ntp_version, receive_time, status);
                const uint64_t client_receive_timestamp =
                    (static_cast<uint64_t>(request[32]) << 56) | (static_cast<uint64_t>(request[33]) << 48) |
                    (static_cast<uint64_t>(request[34]) << 40) | (static_cast<uint64_t>(request[35]) << 32) |
                    (static_cast<uint64_t>(request[36]) << 24) | (static_cast<uint64_t>(request[37]) << 16) |
                    (static_cast<uint64_t>(request[38]) << 8) | request[39];
                const uint64_t client_origin_timestamp =
                    (static_cast<uint64_t>(request[24]) << 56) | (static_cast<uint64_t>(request[25]) << 48) |
                    (static_cast<uint64_t>(request[26]) << 40) | (static_cast<uint64_t>(request[27]) << 32) |
                    (static_cast<uint64_t>(request[28]) << 24) | (static_cast<uint64_t>(request[29]) << 16) |
                    (static_cast<uint64_t>(request[30]) << 8) | request[31];
                const uint64_t client_transmit_timestamp =
                    (static_cast<uint64_t>(request[40]) << 56) | (static_cast<uint64_t>(request[41]) << 48) |
                    (static_cast<uint64_t>(request[42]) << 40) | (static_cast<uint64_t>(request[43]) << 32) |
                    (static_cast<uint64_t>(request[44]) << 24) | (static_cast<uint64_t>(request[45]) << 16) |
                    (static_cast<uint64_t>(request[46]) << 8) | request[47];
                const uint64_t previous_ipv4_t2 = ((NTP_EPOCH_OFFSET + static_cast<uint64_t>(client_ipv4_record.prev_t2_sec)) << 32) |
                                                  ((static_cast<uint64_t>(client_ipv4_record.prev_t2_ns) << 32) / 1000000000ULL);
                const uint64_t previous_ipv4_t3 = ((NTP_EPOCH_OFFSET + static_cast<uint64_t>(client_ipv4_record.prev_t3_sec)) << 32) |
                                                  ((static_cast<uint64_t>(client_ipv4_record.prev_t3_ns) << 32) / 1000000000ULL);
                const uint64_t ipv4_t2_difference = client_origin_timestamp >= previous_ipv4_t2
                                                        ? client_origin_timestamp - previous_ipv4_t2
                                                        : previous_ipv4_t2 - client_origin_timestamp;
                const bool ipv4_interleaved_reply = source_ipv4 != nullptr && client_ipv4_record.prev_t2_sec != 0 &&
                                                    client_receive_timestamp != client_transmit_timestamp &&
                                                    ipv4_t2_difference <= NTP_CACHE_TIMESTAMP_MATCH_TOLERANCE;
                const bool ipv6_interleaved_reply = client_ipv6 != nullptr && client_ipv6_record.prev_t2 != 0 &&
                                                    client_receive_timestamp != client_transmit_timestamp &&
                                                    client_origin_timestamp == client_ipv6_record.prev_t2;
                const bool interleaved_reply = ipv4_interleaved_reply || ipv6_interleaved_reply;
                const uint64_t transmit_time = get_current_time_in_ntp64_format();
                if (interleaved_reply)
                {
                    write_ntp_timestamp(reply, 24, client_receive_timestamp);
                    write_ntp_timestamp(reply, 40, ipv4_interleaved_reply ? previous_ipv4_t3 : client_ipv6_record.prev_t3);
                }
                else
                {
                    write_ntp_timestamp(reply, 40, transmit_time);
                }

                int sent = sendto(sock, reply, sizeof(reply), 0, reinterpret_cast<struct sockaddr *>(&source_addr), source_addr_len);
                if (sent == static_cast<int>(sizeof(reply)))
                {
                    if (source_ipv4 != nullptr)
                    {
                        ntp_cache_update(ntohl(source_ipv4->sin_addr.s_addr), ntohs(source_ipv4->sin_port),
                                         static_cast<uint32_t>((receive_time >> 32) - NTP_EPOCH_OFFSET),
                                         static_cast<uint32_t>((receive_time & 0xFFFFFFFFULL) * 1000000000ULL >> 32),
                                         static_cast<uint32_t>((transmit_time >> 32) - NTP_EPOCH_OFFSET),
                                         static_cast<uint32_t>((transmit_time & 0xFFFFFFFFULL) * 1000000000ULL >> 32));
                    }
                    else if (client_ipv6 != nullptr)
                    {
                        ntp_cache_update_ipv6(client_ipv6,
                                              ntohs(reinterpret_cast<const struct sockaddr_in6 *>(&source_addr)->sin6_port),
                                              receive_time, transmit_time);
                    }
                }
#if MQTT_ENABLED
                if (sent == static_cast<int>(sizeof(reply)))
                    s_ntp_responses.fetch_add(1, std::memory_order_relaxed);
#else
                (void)sent;
#endif
#if DEBUG_ENABLED
                char source_address[IP_ADDRESS_TEXT_SIZE] = "";
                if (format_socket_address(source_addr, source_address, sizeof(source_address)))
                    ESP_LOGI(TAG, "NTP -> %s", source_address);
#endif
#if CALCULATE_NTP_SERVER_TASK_STACK_SIZE_ENABLED
                report_current_task_stack_usage(NTP_Server);
#endif
            }
#if CALCULATE_NTP_SERVER_TASK_STACK_SIZE_ENABLED
            report_current_task_stack_usage(NTP_Server);
#endif
        }
#if CALCULATE_NTP_SERVER_TASK_STACK_SIZE_ENABLED
        report_current_task_stack_usage(NTP_Server);
#endif
    }
#if CALCULATE_NTP_SERVER_TASK_STACK_SIZE_ENABLED
    report_current_task_stack_usage(NTP_Server);
#endif
}

#if STARTUP_HEALTH_TEST_ENABLED
static constexpr uint32_t Startup_Health_Test_Ready_Timeout_Ms = 30000;
static constexpr uint32_t Startup_Health_Test_Response_Timeout_Ms = 1000;
static constexpr uint32_t Startup_Health_Test_Standard_Retries = 3;
static constexpr uint64_t Startup_Health_Test_Interleaved_Tolerance = (1ULL << 32) * 5ULL / 1000ULL;
static constexpr uint32_t Startup_Health_Test_Completion_Timeout_Ms = 60000;
static constexpr size_t Startup_Health_Test_Task_Stack_Size = 4096;

struct startup_health_endpoint_results_t
{
    bool ntpv3_standard = false;
    bool ntpv4_standard = false;
    bool ntpv4_interleaved = false;
};

struct startup_health_test_results_t
{
    bool prerequisites_ready = false;
    startup_health_endpoint_results_t ipv4_loopback{};
    startup_health_endpoint_results_t ipv4_assigned{};
    startup_health_endpoint_results_t ipv6_loopback{};
    startup_health_endpoint_results_t ipv6_assigned{};
};

