roblatour/ESP32TimeServer/main/main.cpp
struct startup_health_exchange_t
{
    uint64_t t1 = 0;
    uint64_t t2 = 0;
    uint64_t t3 = 0;
    uint64_t t4 = 0;
};

static constexpr size_t Startup_Health_Test_Log_Capacity = 64;
static constexpr size_t Startup_Health_Test_Log_Message_Size = 192;

struct startup_health_log_entry_t
{
    esp_log_level_t level = ESP_LOG_INFO;
    char message[Startup_Health_Test_Log_Message_Size] = "";
};

static startup_health_test_results_t s_startup_health_test_results{};
static startup_health_log_entry_t *s_startup_health_test_log = nullptr;
static size_t s_startup_health_test_log_count = 0;
static uint32_t s_startup_health_test_number = 0;

static void queue_startup_health_log(esp_log_level_t level, const char *format, ...)
{
    if (s_startup_health_test_log == nullptr || s_startup_health_test_log_count >= Startup_Health_Test_Log_Capacity)
        return;

    startup_health_log_entry_t &entry = s_startup_health_test_log[s_startup_health_test_log_count++];
    entry.level = level;
    va_list arguments;
    va_start(arguments, format);
    vsnprintf(entry.message, sizeof(entry.message), format, arguments);
    va_end(arguments);
}

static void queue_startup_health_test_result(const char *endpoint, const char *test_name, bool passed)
{
    ++s_startup_health_test_number;
    queue_startup_health_log(passed ? ESP_LOG_INFO : ESP_LOG_WARN,
                             "Health Check %02lu - %s: %s - %s",
                             static_cast<unsigned long>(s_startup_health_test_number), endpoint, test_name,
                             passed ? "Passed" : "Failed");
}

static void flush_startup_health_log()
{
    for (size_t index = 0; index < s_startup_health_test_log_count; ++index)
        ESP_LOG_LEVEL(s_startup_health_test_log[index].level, TAG, "%s", s_startup_health_test_log[index].message);
    s_startup_health_test_log_count = 0;
}

static bool receive_startup_health_response(int socket_fd, uint8_t *reply, uint64_t *arrival_time)
{
    fd_set read_fds;
    FD_ZERO(&read_fds);
    FD_SET(socket_fd, &read_fds);
    struct timeval timeout{};
    timeout.tv_sec = Startup_Health_Test_Response_Timeout_Ms / 1000;
    timeout.tv_usec = static_cast<suseconds_t>(Startup_Health_Test_Response_Timeout_Ms % 1000) * 1000;
    if (select(socket_fd + 1, &read_fds, nullptr, nullptr, &timeout) != 1)
        return false;

    int reply_length = recvfrom(socket_fd, reply, NTP_PACKET_SIZE, 0, nullptr, nullptr);
    if (reply_length != static_cast<int>(NTP_PACKET_SIZE))
        return false;

    *arrival_time = get_current_time_in_ntp64_format();
    return true;
}

static bool run_standard_startup_health_test(int socket_fd, const struct sockaddr *destination, socklen_t destination_length,
                                             uint8_t version, startup_health_exchange_t *exchange)
{
    uint8_t request[NTP_PACKET_SIZE] = {};
    uint8_t reply[NTP_PACKET_SIZE] = {};
    exchange->t1 = get_current_time_in_ntp64_format();
    request[0] = static_cast<uint8_t>(version << 3) | 3;
    write_ntp_timestamp(request, 40, exchange->t1);

    for (uint32_t attempt = 0; attempt < Startup_Health_Test_Standard_Retries; ++attempt)
    {
        if (sendto(socket_fd, request, sizeof(request), 0, destination, destination_length) != static_cast<int>(sizeof(request)))
            continue;

        if (!receive_startup_health_response(socket_fd, reply, &exchange->t4))
            continue;

        if (((reply[0] >> 3) & 0x07) != version || (reply[0] & 0x07) != 4 || read_ntp_timestamp(reply, 24) != exchange->t1)
            continue;

        exchange->t2 = read_ntp_timestamp(reply, 32);
        exchange->t3 = read_ntp_timestamp(reply, 40);
        return exchange->t2 != 0 && exchange->t3 != 0;
    }

    return false;
}

static bool run_interleaved_startup_health_test(int socket_fd, const struct sockaddr *destination, socklen_t destination_length,
                                                uint8_t version, const startup_health_exchange_t &previous_exchange)
{
    uint8_t request[NTP_PACKET_SIZE] = {};
    uint8_t reply[NTP_PACKET_SIZE] = {};
    uint64_t arrival_time = 0;
    request[0] = static_cast<uint8_t>(version << 3) | 3;
    write_ntp_timestamp(request, 24, previous_exchange.t2);
    write_ntp_timestamp(request, 32, previous_exchange.t4);
    write_ntp_timestamp(request, 40, previous_exchange.t1);

    if (sendto(socket_fd, request, sizeof(request), 0, destination, destination_length) != static_cast<int>(sizeof(request)) ||
        !receive_startup_health_response(socket_fd, reply, &arrival_time))
        return false;

    const uint64_t reply_transmit_time = read_ntp_timestamp(reply, 40);
    const uint64_t transmit_difference = reply_transmit_time >= previous_exchange.t3
                                             ? reply_transmit_time - previous_exchange.t3
                                             : previous_exchange.t3 - reply_transmit_time;
    return ((reply[0] >> 3) & 0x07) == version && (reply[0] & 0x07) == 4 &&
           read_ntp_timestamp(reply, 24) == previous_exchange.t4 &&
           transmit_difference <= Startup_Health_Test_Interleaved_Tolerance;
}

static startup_health_endpoint_results_t run_startup_health_endpoint_test(const char *name, const struct sockaddr *destination,
                                                                          socklen_t destination_length, sa_family_t family)
{
    startup_health_endpoint_results_t results{};
    int socket_fd = socket(family, SOCK_DGRAM, IPPROTO_UDP);
    if (socket_fd < 0)
    {
        queue_startup_health_log(ESP_LOG_WARN, "Health Check %s: unable to create socket: errno %d", name, errno);
        queue_startup_health_test_result(name, "NTPv3 standard    ", false);
        queue_startup_health_test_result(name, "NTPv4 standard    ", false);
        queue_startup_health_test_result(name, "NTPv4 interleaved ", false);
        return results;
    }

    startup_health_exchange_t ntpv3_exchange{};
    startup_health_exchange_t ntpv4_exchange{};
    results.ntpv3_standard = run_standard_startup_health_test(socket_fd, destination, destination_length, 3, &ntpv3_exchange);
    results.ntpv4_standard = run_standard_startup_health_test(socket_fd, destination, destination_length, 4, &ntpv4_exchange);
    if (results.ntpv4_standard)
        results.ntpv4_interleaved = run_interleaved_startup_health_test(socket_fd, destination, destination_length, 4, ntpv4_exchange);

    closesocket(socket_fd);
    queue_startup_health_test_result(name, "NTPv3 standard    ", results.ntpv3_standard);
    queue_startup_health_test_result(name, "NTPv4 standard    ", results.ntpv4_standard);
    queue_startup_health_test_result(name, "NTPv4 interleaved ", results.ntpv4_interleaved);
    return results;
}

