roblatour/ESP32TimeServer/main/main.cpp
static startup_health_test_results_t run_startup_health_tests()
{
    startup_health_test_results_t results{};
    const EventBits_t ready_bits = ETH_CONNECTED_BIT | ETH_GOT_IP_BIT | ETH_GOT_IP6_BIT;
    const EventBits_t ready = xEventGroupWaitBits(s_net_event_group, ready_bits, pdFALSE, pdTRUE,
                                                  pdMS_TO_TICKS(Startup_Health_Test_Ready_Timeout_Ms));
    if ((ready & ready_bits) != ready_bits || !s_time_has_been_set.load(std::memory_order_acquire) ||
        !s_pps_discipline_active.load(std::memory_order_acquire))
    {
        queue_startup_health_log(ESP_LOG_ERROR, "Health Check prerequisites were not ready before timeout");
        return results;
    }

    results.prerequisites_ready = true;
    struct sockaddr_in ipv4_loopback{};
    ipv4_loopback.sin_family = AF_INET;
    ipv4_loopback.sin_port = htons(NTP_PORT);
    ipv4_loopback.sin_addr.s_addr = htonl(INADDR_LOOPBACK);
    results.ipv4_loopback = run_startup_health_endpoint_test("IPv4 loopback", reinterpret_cast<const struct sockaddr *>(&ipv4_loopback), sizeof(ipv4_loopback), AF_INET);

    struct sockaddr_in ipv4_assigned{};
    ipv4_assigned.sin_family = AF_INET;
    ipv4_assigned.sin_port = htons(NTP_PORT);
    if (inet_pton(AF_INET, s_ipv4_address, &ipv4_assigned.sin_addr) == 1)
        results.ipv4_assigned = run_startup_health_endpoint_test("IPv4 assigned", reinterpret_cast<const struct sockaddr *>(&ipv4_assigned), sizeof(ipv4_assigned), AF_INET);
    else
        queue_startup_health_log(ESP_LOG_ERROR, "Health Check IPv4 assigned: invalid address");

    struct sockaddr_in6 ipv6_loopback{};
    ipv6_loopback.sin6_family = AF_INET6;
    ipv6_loopback.sin6_port = htons(NTP_PORT);
    if (inet_pton(AF_INET6, "::1", &ipv6_loopback.sin6_addr) != 1)
    {
        queue_startup_health_log(ESP_LOG_ERROR, "Health Check IPv6 loopback: unable to initialize address");
        return results;
    }
    results.ipv6_loopback = run_startup_health_endpoint_test("IPv6 loopback", reinterpret_cast<const struct sockaddr *>(&ipv6_loopback), sizeof(ipv6_loopback), AF_INET6);

    struct sockaddr_in6 ipv6_assigned{};
    ipv6_assigned.sin6_family = AF_INET6;
    ipv6_assigned.sin6_port = htons(NTP_PORT);
    ipv6_assigned.sin6_scope_id = esp_netif_get_netif_impl_index(ETH.netif());
    if (inet_pton(AF_INET6, s_ipv6_address, &ipv6_assigned.sin6_addr) == 1)
        results.ipv6_assigned = run_startup_health_endpoint_test("IPv6 assigned", reinterpret_cast<const struct sockaddr *>(&ipv6_assigned), sizeof(ipv6_assigned), AF_INET6);
    else
        queue_startup_health_log(ESP_LOG_ERROR, "Health Check IPv6 assigned: invalid address");

    return results;
}

static void startup_health_test_task(void *parameter)
{
    s_startup_health_test_log = static_cast<startup_health_log_entry_t *>(calloc(Startup_Health_Test_Log_Capacity, sizeof(startup_health_log_entry_t)));
    if (s_startup_health_test_log == nullptr)
    {
        ESP_LOGE(TAG, "Health Check could not allocate its log buffer");
        xTaskNotifyGive(static_cast<TaskHandle_t>(parameter));
        vTaskDelete(nullptr);
        return;
    }

    queue_startup_health_log(ESP_LOG_INFO, "Health Check started");
    s_startup_health_test_results = run_startup_health_tests();
    queue_startup_health_log(ESP_LOG_INFO, "Health Check %s", s_startup_health_test_results.prerequisites_ready ? "completed" : "failed before testing");
    flush_startup_health_log();
    free(s_startup_health_test_log);
    s_startup_health_test_log = nullptr;
    xTaskNotifyGive(static_cast<TaskHandle_t>(parameter));
    vTaskDelete(nullptr);
}
#endif

static void update_display_task(void *parameter)

{
#if LIQUID_CRYSTAL_DISPLAY_ENABLED
    int previous_top_line_message = -1;
    int previous_second = -1;
#if UPTIME_RESTART_BUTTON_ENABLED
    int display_uptime_seconds_counter = 0;
#endif

    for (;;)
    {

#if OTE_UPDATES_ENABLED
        if (render_ote_display())
        {
            vTaskDelay(pdMS_TO_TICKS(100));
            continue;
        }
#endif

        time_t now_utc = time(nullptr);
        struct tm utc_tm{};
        gmtime_r(&now_utc, &utc_tm);

        if (utc_tm.tm_sec != previous_second)
        {
            previous_second = utc_tm.tm_sec;

#if UPTIME_RESTART_BUTTON_ENABLED
            if (check_uptime_request())
                display_uptime_seconds_counter = upTimeDisplayWillStayActiveForThisManySeconds;
#endif

            sync_state_t sync_snapshot = get_sync_state_snapshot();

            int required_top_line_message = 0;

            // Determine message code for the first line:
            //
            // Standard 1st line display value .................................... "ESP32 Time Server   "
            // Ethernet not connected ............................................. "ESP32 Time Server[1]"
            // MQTT setup failed .................................................. "ESP32 Time Server[2]"
            // MQTT there are queued items ........................................ "ESP32 Time Server[3]"
            // Sanity check mismatch .............................................. "ESP32 Time Server[4]"
            // PPS missing ........................................................ "ESP32 Time Server[5]"
            // GNSS missing or invalid ............................................ "ESP32 Time Server[6]"
            // GNSS sync stale .................................................... "ESP32 Time Server[7]"
            // GNSS unlocked ...................................................... "ESP32 Time Server[8]"

            // 98 used for when the button is pressed (normal periodic behaviour) . "ESP32 Time Server's "
            // 99 Time sync underway (normal periodic behaviour)                  . "ESP32 Time Server * "

            // Regarding statuses [6], [7] and [8], each condition represents a distinct failure mode:
            // [6] - GNSS timing is unusable. This is a hard fault.
            // [7] - The system hasn’t synced with GNSS as expected due to processing delays or blockages
            // [8] - GNSS module lost satellite lock. This is a raw GNSS status, not a sync fault.

            // Regarding: sync_snapshot.holdover_mode
            // In timekeeping terminology, holdover is the state where a time server continues providing time from its internal
            // oscillator after losing its external reference (in this case the GNSS). The device is no longer actively
            // synchronized but is "coasting" on its last-known good time.
            // Holdover mode is not expressly reported on the LCD's top line as it is implied when
            // Sanity check mismatch, PPS missing, GNSS missing or invalid, GNSS snyc stale, or GNSS unlocked
            // are reported.

            if (s_time_setting_in_progress.load())
            {
                required_top_line_message = 99;
            }
            else
            {
                if (!s_ethernet_connected.load())
                    required_top_line_message = 1;
#if MQTT_ENABLED
                else if (s_mqtt_queued_messages_count.load() > 0)
                    required_top_line_message = 3;
                else if (s_mqtt_setup_failed.load() || !s_mqtt_connected.load())
                    required_top_line_message = 2;
#endif
                if (sync_snapshot.faults.sanity_mismatch)
                {
                    required_top_line_message = 4;
                }
                else if (sync_snapshot.faults.pps_missing)
                {
                    required_top_line_message = 5;
                }
                else if (sync_snapshot.faults.gnss_invalid)
                {
                    required_top_line_message = 6;
                }
                else if (sync_snapshot.faults.sync_stale)
                {
                    required_top_line_message = 7;
                }
                else if (required_top_line_message == 0)
                {
                    required_top_line_message = s_gnss_locked.load() ? 0 : 8;
                }
            }

#if UPTIME_RESTART_BUTTON_ENABLED
            if (display_uptime_seconds_counter > 0)
                required_top_line_message = 98;
#endif

            // Update top line only if it has changed
            if (required_top_line_message != previous_top_line_message)
            {
                char top_line_message[21]; // 20 chars + null
                memset(top_line_message, ' ', sizeof(top_line_message));
                memcpy(top_line_message, "ESP32 Time Server", 17);

                if (required_top_line_message == 99)
                {
                    top_line_message[18] = '*';
                }
                else if (required_top_line_message > 0 && required_top_line_message < 10)
                {
                    top_line_message[17] = '[';
                    top_line_message[18] = '0' + required_top_line_message;
                    top_line_message[19] = ']';
                }
                else if (required_top_line_message == 10)
                {
                    memcpy(top_line_message, "ESP32 Time Server's", 20);
                }

                top_line_message[20] = '\0';

