roblatour/ESP32TimeServer/main/main.cpp
                display_line(0, top_line_message);
                previous_top_line_message = required_top_line_message;
            }

#if UPTIME_RESTART_BUTTON_ENABLED
            if (display_uptime_seconds_counter > 0)
            {
                char uptime_buffer[lcdColumns + 1];
                char centered[lcdColumns + 1];
                memset(centered, ' ', lcdColumns);
                centered[lcdColumns] = '\0';

                get_uptime(uptime_buffer, sizeof(uptime_buffer));
                size_t uptime_len = strlen(uptime_buffer);
                int left_pad = static_cast<int>((lcdColumns - uptime_len) / 2);
                if (left_pad < 0)
                    left_pad = 0;
                if (uptime_len > lcdColumns)
                    uptime_len = lcdColumns;

                memcpy(centered + left_pad, uptime_buffer, uptime_len);

                display_line(1, "uptime is");
                display_line(2, centered);
                display_line(3, " days hrs:mins:secs");
                display_uptime_seconds_counter--;
            }
            else
#endif
            {
                char date_line[16];
                char time_line[24];
                format_local_date_time(now_utc, date_line, sizeof(date_line), time_line, sizeof(time_line));
                display_line(1, date_line);
                display_line(2, time_line);
                display_selected_ip_address(utc_tm.tm_sec);
            }
        }
        vTaskDelay(pdMS_TO_TICKS(50));

#if CALCULATE_UPDATE_DISPLAY_TASK_STACK_SIZE_ENABLED
        report_current_task_stack_usage(Update_Display);
#endif
    }
#else
    for (;;)
    {
#if UPTIME_RESTART_BUTTON_ENABLED
        (void)check_uptime_request();
#endif
        vTaskDelay(pdMS_TO_TICKS(50));
    }
#endif
}

extern "C" void app_main()
{
    setup_pps_input();

    initArduino();

    write_opening_messages_to_the_console();

    setup_mqtt_tf_queue();

    setup_NVM_storage();

    create_mutexes_and_semaphores();

    initialize_the_display();

    setup_up_time_button();

    setup_ethernet_connection();

    setup_for_ote_updates();

    setup_the_gnss();

    setup_mqtt();

    xTaskCreatePinnedToCore(ntp_server_task, "ntp_server", NTP_Server_Task_Stack_Size, nullptr, 20, nullptr, tskNO_AFFINITY);

#if STARTUP_HEALTH_TEST_ENABLED
    if (xTaskCreatePinnedToCore(startup_health_test_task, "startup_health", Startup_Health_Test_Task_Stack_Size,
                                xTaskGetCurrentTaskHandle(), 5, nullptr, tskNO_AFFINITY) != pdPASS)
    {
        ESP_LOGE(TAG, "Health Check could not start");
    }
    else if (ulTaskNotifyTake(pdTRUE, pdMS_TO_TICKS(Startup_Health_Test_Completion_Timeout_Ms)) == 0)
    {
        ESP_LOGW(TAG, "Health Check did not complete before the startup timeout");
    }
#endif

    xTaskCreatePinnedToCore(update_display_task, "display_service", Update_Display_Task_Stack_Size, nullptr, 10, nullptr, tskNO_AFFINITY);

    write_open_for_business_messages_to_the_console();
}
